Repository: fpc/Lazarus
Catalog: tools/icons_to_html/languages/icontable.*.po
Languages: de

source: Error
de: Fehler

source: freely available, no restrictions in usage
de: Frei verwendbar ohne Einschränkungen

source: The images were kindly provided by Roland Hahn (%s).
de: Die Bilder wurden freundlicherweise von Roland Hahn zur Verfügung gestellt (%s).

source: The images in this folder can be used in Lazarus applications as toolbar or button icons.
de: Die Bilder in diesem Ordner können in Lazarus-Anwendungen als Toolbar- oder Button-Icons verwendet werden.

source: The different sizes as required by LCL scaling for high-dpi screens can be used like this, for example:
de: Die verschiedenen, für LCL-Skalierung auf hochaufgelösten Bildschirmen benötigten Größen können beispielsweise wie folgt eingesetzt werden:

source: License: %s
de: Lizenz: %s

source: No matching PNG image files found in %s
de: Keine passenden PNG-Bilddateien gefunden in %s

source: No PNG image files found in %s
de: Keine PNG-Bilddateien gefunden in %s

source: Saved as: %s
de: Gespeichert als: %s

source: Size
de: Größe

source: 32x32, 48x48 and 64x64 pixels for "large" images.
de: 32x32, 48x48 und 64x64 Pixel für "große" Bilder.

source: 24x24, 36x36 and 48x48 pixels for "medium" sized images,
de: 24x24, 36x36 und 48x48 Pixel für Bilder "mittlerer" Größe,

source: 16x16, 24x24 and 32x32 pixels for "small" images,
de: 16x16, 24x24 und 32x32 Pixel für "kleine" Bilder,

source: Configuration file could not be saved.
de: Die Konfiguration konnte nicht gespeichert werden.

source: The file could not be saved as: %s
de: Die Datei konnte nicht gespeichert werden als: %s

source: Folder "%s" does not exist or is currently not available. Should it be removed from the list?
de: Der Order [%s] existiert nicht oder ist derzeit nicht verfügbar. Soll er von der Liste gestrichen werden?

source: Temporary file could not be deleted.
de: Die Temporär-Datei konnte nicht gelöscht werden.

source: This folder contains %0:d icons in %1:d icon groups with %2:d icon sizes.
de: Dieser Ordner enthält %0:d Icons in %1:d Icon-Gruppen mit %2:d Icon-Größen.

source: Close
de: Beenden

source: Close application
de: Programm beenden

source: Create HTML
de: HTML erzeugen

source: Create HTML page for images found in the selected directory
de: Erzeugt den HTML-Code für die im ausgewählten Ordner gefundenen Icons

source: Preview
de: Vorschau

source: Save
de: Speichern

source: Save created HTML page as "IconTable.html" file in the specified folder
de: Speichert den generierten HTML-Code in der Datei "IconTable.html" im angegebenen Ordner

source: Folder with images for which the HTML preview should be created
de: Ordner mit den Bildern, für die der HTML-Code erzeugt werden soll

# tmainform.menudarkhtmlpage.caption
source: Dark HTML page
de: Dunkle HTML-Seite

# tmainform.menuhtmlpageenglish.caption
source: HTML page in English
de: HTML-Seite auf Englisch

source: Last used
de: Zuletzt benutzt

source: Options
de: Optionen
