Repository: fpc/Lazarus
Catalog: languages/lazaruside.*.po
Languages: lo

source: There is no backend of recommended type in the list of existing debuggers. Consider creating a new backend.
lo: ບໍ່ມີ backend ປະເພດທີ່ແນະນຳໃນລາຍການຂອງ debugger ທີ່ມີຢູ່. ພິຈາລະນາສ້າງ backend ໃໝ່.

source: Setup is OK.
lo: ການຕັ້ງຄ່າຮຽບຮ້ອຍ.

source: You are using an older backend. This may not give you the best debugging experience. Consider upgrading to the recommended backend.
lo: ທ່ານກຳລັງໃຊ້ backend ເກົ່າ. ນີ້ອາດຈະບໍ່ໃຫ້ປະສົບການການດີບັກທີ່ດີທີ່ສຸດ. ພິຈາລະນາອັບເກຣດເປັນ backend ທີ່ແນະນຳ.

source: 0 = no, 1 = draw divider lines only for top level, 2 = draw lines for first two levels, ...
lo: 0 = ບໍ່, 1 = ແຕ້ມເສັ້ນແບ່ງສະເພາະລະດັບເທິງສຸດ, 2 = ແຕ້ມເສັ້ນສຳລັບສອງລະດັບທຳອິດ, ...

source: Add Files
lo: ເພີ່ມໄຟລ໌

source: Ambiguous Ancestor Type
lo: ປະເພດບັນພະບຸລຸດທີ່ບໍ່ຊັດເຈນ

source: Ambiguous Class Name
lo: ຊື່ Class ບໍ່ຊັດເຈນ

source: Ambiguous Unit Name
lo: ຊື່ Unit ບໍ່ຊັດເຈນ

source: Ancestor type
lo: ປະເພດບັນພະບຸລຸດ

source: Broken Dependencies
lo: ຄວາມຂຶ້ນຕໍ່ກັນທີ່ເສຍຫາຍ

source: Class Name already exists
lo: ຊື່ Class ມີຢູ່ແລ້ວ

source: Create New Component
lo: ສ້າງ Component ໃໝ່

source: Dependency
lo: ຄວາມຂຶ້ນຕໍ່ກັນ

source: Directory for unit file:
lo: ໄດເຣັກທໍຣີສຳລັບໄຟລ໌ unit:

source: Existing file: "%s"
lo: ໄຟລ໌ທີ່ມີຢູ່: "%s"

source: File already exists
lo: ໄຟລ໌ມີຢູ່ແລ້ວ

source: File "%s" already exists in the package.
lo: ໄຟລ໌ "%s" ມີຢູ່ແລ້ວໃນແພັກເກັດ.

source: File is used
lo: ໄຟລ໌ຖືກໃຊ້ງານຢູ່

source: Filename/URL
lo: ຊື່ໄຟລ໌/URL

source: File not unit
lo: ໄຟລ໌ບໍ່ແມ່ນ unit

source: Icon 24x24:
lo: ໄອຄອນ 24x24:

source: Icon 36x36:
lo: ໄອຄອນ 36x36:

source: Icon 48x48:
lo: ໄອຄອນ 48x48:

source: Invalid Ancestor Type
lo: ປະເພດບັນພະບຸລຸດບໍ່ຖືກຕ້ອງ

source: Invalid Circular Dependency
lo: Circular Dependency ບໍ່ຖືກຕ້ອງ

source: Invalid Class Name
lo: ຊື່ Class ບໍ່ຖືກຕ້ອງ

source: Invalid file
lo: ໄຟລ໌ບໍ່ຖືກຕ້ອງ

source: Invalid filename
lo: ຊື່ໄຟລ໌ບໍ່ຖືກຕ້ອງ

source: Invalid Unit Name
lo: ຊື່ Unit ບໍ່ຖືກຕ້ອງ

source: "%s" is not a valid unit name.
lo: "%s" ບໍ່ແມ່ນຊື່ unit ທີ່ຖືກຕ້ອງ.

source: New class name:
lo: ຊື່ class ໃໝ່:

source: New File
lo: ໄຟລ໌ໃໝ່

source: No package found for dependency "%s".%sPlease choose an existing package.
lo: ບໍ່ພົບແພັກເກັດສຳລັບ dependency "%s".%sກະລຸນາເລືອກແພັກເກັດທີ່ມີຢູ່.

source: Package/Project
lo: ແພັກເກັດ/ໂປຣເຈັກ

source: Page Name too long
lo: ຊື່ໜ້າຍາວເກີນໄປ

source: Palette page:
lo: ໜ້າ Palette:

source: Shorten or expand filename
lo: ຫຍໍ້ ຫຼື ຂະຫຍາຍຊື່ໄຟລ໌

# lazarusidestrconsts.lisa2pshowall
source: Show all
lo: ສະແດງທັງໝົດ

source: The ancestor type "%s" has the same name as%sthe unit "%s".
lo: ປະເພດບັນພະບຸລຸດ "%s" ມີຊື່ດຽວກັນກັບ%sunit "%s".

source: The ancestor type "%s" is not a valid Pascal identifier.
lo: ປະເພດບັນພະບຸລຸດ "%s" ບໍ່ແມ່ນ Pascal identifier ທີ່ຖືກຕ້ອງ.

source: The class name "%s" and ancestor type "%s" are the same.
lo: ຊື່ class "%s" ແລະ ປະເພດບັນພະບຸລຸດ "%s" ຄືກັນ.

source: The class name "%s" exists already in%sPackage %s%sFile: "%s"
lo: ຊື່ class "%s" ມີຢູ່ແລ້ວໃນ%sແພັກເກັດ %s%sໄຟລ໌: "%s"

source: The class name "%s" has the same name as%sthe unit "%s".
lo: ຊື່ class "%s" ມີຊື່ດຽວກັນກັບ%sunit "%s".

source: The class name "%s" is not a valid Pascal identifier.
lo: ຊື່ class "%s" ບໍ່ແມ່ນ Pascal identifier ທີ່ຖືກຕ້ອງ.

source: The file "%s" is part of the current project.%sIt is a bad idea to share files between projects and packages.
lo: ໄຟລ໌ "%s" ເປັນສ່ວນໜຶ່ງຂອງໂປຣເຈັກປັດຈຸບັນ.%sມັນເປັນຄວາມຄິດທີ່ບໍ່ດີທີ່ຈະແບ່ງປັນໄຟລ໌ລະຫວ່າງໂປຣເຈັກ ແລະ ແພັກເກັດ.

source: The filename "%s" is ambiguous because the package has no default directory yet.%sPlease specify a filename with full path.
lo: ຊື່ໄຟລ໌ "%s" ບໍ່ຊັດເຈນເພາະວ່າແພັກເກັດຍັງບໍ່ມີໄດເຣັກທໍຣີເລີ່ມຕົ້ນ.%sກະລຸນາລະບຸຊື່ໄຟລ໌ພ້ອມທີ່ຢູ່ເຕັມ.

# lazarusidestrconsts.lisa2pthemaximumversionislowerthantheminimimversion
source: The Maximum Version is lower than the Minimim Version.
lo: ເວີຊັນສູງສຸດຕ່ຳກວ່າເວີຊັນຕ່ຳສຸດ.

source: The package already has a dependency on the package "%s".
lo: ແພັກເກັດມີ dependency ກັບແພັກເກັດ "%s" ແລ້ວ.

source: The page name "%s" is too long (max 100 chars).
lo: ຊື່ໜ້າ "%s" ຍາວເກີນໄປ (ສູງສຸດ 100 ຕົວອັກສອນ).

source: The unitname "%s" already exists in the package:%s%s
lo: ຊື່ unit "%s" ມີຢູ່ແລ້ວໃນແພັກເກັດ:%s%s

source: The unitname "%s" already exists in this package.
lo: ຊື່ unit "%s" ມີຢູ່ແລ້ວໃນແພັກເກັດນີ້.

source: The unit name "%s"%sand filename "%s" differ.
lo: ຊື່ unit "%s"%sແລະ ຊື່ໄຟລ໌ "%s" ແຕກຕ່າງກັນ.

source: The unit name "%s" is the same as a registered component.%sUsing this can cause strange error messages.
lo: ຊື່ unit "%s" ຄືກັນກັບ component ທີ່ລົງທະບຽນແລ້ວ.%sການໃຊ້ອັນນີ້ອາດເຮັດໃຫ້ເກີດຂໍ້ຄວາມຜິດພາດທີ່ແປກໆໄດ້.

source: Unit name:
lo: ຊື່ Unit:

source: Unitname already exists
lo: ຊື່ Unit ມີຢູ່ແລ້ວ

source: Abandon changes?
lo: ປະຖິ້ມການປ່ຽນແປງບໍ່?

source: Abort all loading
lo: ຍົກເລີກການໂຫຼດທັງໝົດ

source: Aborted
lo: ຖືກຍົກເລີກ

source: Abort loading project
lo: ຍົກເລີກການໂຫຼດໂປຣເຈັກ

# lazarusidestrconsts.lisabout
source: About
lo: ກ່ຽວກັບ

source: About %s
lo: ກ່ຽວກັບ %s

source: Documentation:
lo: ເອກະສານ:

source: About IDE
lo: ກ່ຽວກັບ IDE

source: About Lazarus
lo: ກ່ຽວກັບ Lazarus

source: License: GPL/LGPL. See Lazarus and Free Pascal sources for license details.%sLazarus is an IDE to create graphical and console applications with Free Pascal. Free Pascal is a Pascal and Object Pascal compiler that runs on Windows, Linux, macOS, FreeBSD and more.%sLazarus is the missing part of the puzzle that will allow you to develop programs for all of the above platforms in a Delphi-like environment. The IDE is a RAD tool that includes a form designer.%sAs Lazarus is growing, we need more developers.
lo: ໃບອະນຸຍາດ: GPL/LGPL. ເບິ່ງ Lazarus ແລະ Free Pascal sources ສຳລັບລາຍລະອຽດໃບອະນຸຍາດ.%sLazarus ແມ່ນ IDE ເພື່ອສ້າງແອັບພລິເຄຊັນກຣາຟິກ ແລະ ຄອນໂຊນດ້ວຍ Free Pascal. Free Pascal ແມ່ນ Pascal ແລະ Object Pascal compiler ທີ່ຣັນໃນ Windows, Linux, macOS, FreeBSD ແລະ ອື່ນໆ.%sLazarus ແມ່ນຊິ້ນສ່ວນທີ່ຫາຍໄປຂອງຈິ໊ກຊໍທີ່ຈະຊ່ວຍໃຫ້ທ່ານພັດທະນາໂປຣແກຣມສຳລັບທຸກແພລັດຟອມຂ້າງເທິງໃນສະພາບແວດລ້ອມທີ່ຄ້າຍຄື Delphi. IDE ເປັນເຄື່ອງມື RAD ທີ່ລວມມີ form designer.%sຂະນະທີ່ Lazarus ກຳລັງເຕີບໃຫຍ່, ພວກເຮົາຕ້ອງການນັກພັດທະນາເພີ່ມເຕີມ.

source: Cannot find contributors list.
lo: ບໍ່ພົບລາຍຊື່ຜູ້ປະກອບສ່ວນ.

source: Official:
lo: ທາງການ:

source: A %s cannot hold TControls.%sYou can only put nonvisual components on it.
lo: %s ບໍ່ສາມາດບັນຈຸ TControls ໄດ້.%sທ່ານສາມາດວາງພຽງແຕ່ component ທີ່ບໍ່ສະແດງຜົນໃສ່ມັນ.

source: Acknowledgements
lo: ຜູ້ສະໜັບສະໜຸນ

source: Action:
lo: ການກະທຳ:

source: Activate
lo: ເປີດໃຊ້ງານ

source: Activate regular expression syntax for text and replacement (pretty much like perl)
lo: ເປີດໃຊ້ງານ syntax regular expression ສຳລັບຂໍ້ຄວາມ ແລະ ການແທນທີ່ (ຄ້າຍຄື perl)

source: Activate Selected
lo: ເປີດໃຊ້ງານທີ່ເລືອກ

source: Active Filter
lo: ຕົວຄັດກອງທີ່ໃຊ້ງານຢູ່

source: Add a new separator above selected item
lo: ເພີ່ມຕົວຂັ້ນໃໝ່ເທິງລາຍການທີ່ເລືອກ

source: Add a new separator below selected item
lo: ເພີ່ມຕົວຂັ້ນໃໝ່ລຸ່ມລາຍການທີ່ເລືອກ

source: Add defines simulating Delphi7
lo: ເພີ່ມ defines ຈຳລອງ Delphi7

source: Useful when the code has checks for supported compiler versions
lo: ເປັນປະໂຫຍດເມື່ອໂຄ້ດມີການກວດສອບເວີຊັນ compiler ທີ່ຮອງຮັບ

source: Added missing object "%s" to pascal source.
lo: ເພີ່ມ object "%s" ທີ່ຂາດຫາຍໄປໃສ່ pascal source.

source: Added property "%s" for %s.
lo: ເພີ່ມ property "%s" ສຳລັບ %s.

source: Add -FcUTF8
lo: ເພີ່ມ -FcUTF8

source: May be needed if source files have non-ansistring literals.
lo: ອາດຈະຈຳເປັນຖ້າໄຟລ໌ source ມີ literals ທີ່ບໍ່ແມ່ນ ansistring.

source: Add Filter ...
lo: ເພີ່ມຕົວຄັດກອງ ...

source: Addition does not fit the current message
lo: ສ່ວນເພີ່ມເຕີມບໍ່ເຂົ້າກັບຂໍ້ຄວາມປັດຈຸບັນ

source: Addition fits the current message
lo: ສ່ວນເພີ່ມເຕີມເຂົ້າກັບຂໍ້ຄວາມປັດຈຸບັນ

source: Additions
lo: ສ່ວນເພີ່ມເຕີມ

source: Add keyword "do"
lo: ເພີ່ມຄຳສັ່ງ "do"

source: Add modifier "overload"
lo: ເພີ່ມ modifier "overload"

source: Add modifier "override"
lo: ເພີ່ມ modifier "override"

source: Add modifier "reintroduce"
lo: ເພີ່ມ modifier "reintroduce"

source: Add new build mode, copying settings from "%s"
lo: ເພີ່ມ build mode ໃໝ່, ສຳເນົາການຕັ້ງຄ່າຈາກ "%s"

source: Add new disk files?
lo: ເພີ່ມໄຟລ໌ຈາກດິດໃໝ່ບໍ່?

source: Add New Files from File System
lo: ເພີ່ມໄຟລ໌ໃໝ່ຈາກລະບົບໄຟລ໌

source: Add new macro
lo: ເພີ່ມ macro ໃໝ່

source: Add new set
lo: ເພີ່ມ set ໃໝ່

source: Add package requirement?
lo: ເພີ່ມຄວາມຕ້ອງການແພັກເກັດບໍ່?

source: Add package(s) to the list of installed packages (combine with --build-ide to rebuild IDE).
lo: ເພີ່ມແພັກເກັດເຂົ້າໃນລາຍການແພັກເກັດທີ່ຕິດຕັ້ງແລ້ວ (ສົມທົບກັບ --build-ide ເພື່ອ rebuild IDE).

source: Add package to project
lo: ເພີ່ມແພັກເກັດໃສ່ໂປຣເຈັກ

source: Add parameter brackets
lo: ເພີ່ມວົງເລັບພາຣາມິເຕີ

source: Add the following files:
lo: ເພີ່ມໄຟລ໌ຕໍ່ໄປນີ້:

source: Add to include search path?
lo: ເພີ່ມໃສ່ include search path ບໍ່?

source: Add %s to project?
lo: ເພີ່ມ %s ໃສ່ໂປຣເຈັກບໍ່?

source: Add to startup components?
lo: ເພີ່ມໃສ່ startup components ບໍ່?

source: Add to unit search path?
lo: ເພີ່ມໃສ່ unit search path ບໍ່?

source: Add unit interfaces
lo: ເພີ່ມ unit interface

source: Add unit (not recommended)
lo: ເພີ່ມ unit (ບໍ່ແນະນຳ)

source: Add value to macro %s
lo: ເພີ່ມຄ່າໃສ່ macro %s

source: Add File to Package
lo: ເພີ່ມໄຟລ໌ໃສ່ແພັກເກັດ

source: Destination package
lo: ແພັກເກັດປາຍທາງ

source: File type
lo: ປະເພດໄຟລ໌

source: Invalid Package
lo: ແພັກເກັດບໍ່ຖືກຕ້ອງ

source: Invalid package ID: "%s"
lo: ID ແພັກເກັດບໍ່ຖືກຕ້ອງ: "%s"

source: Package is read only
lo: ແພັກເກັດອ່ານໄດ້ຢ່າງດຽວ

source: Package "%s" not found.
lo: ບໍ່ພົບແພັກເກັດ "%s".

# lazarusidestrconsts.lisaf2pshowall
source: Show all
lo: ສະແດງທັງໝົດ

source: The package %s is read only.
lo: ແພັກເກັດ %s ອ່ານໄດ້ຢ່າງດຽວ.

source: A filter with the name "%s" already exists.
lo: ຕົວຄັດກອງທີ່ມີຊື່ "%s" ມີຢູ່ແລ້ວ.

source: After building with cleaning all switch to "automatic" clean up mode
lo: ຫຼັງຈາກ build ດ້ວຍການລຶບລ້າງທັງໝົດ ໃຫ້ປ່ຽນໄປເປັນໂໝດລຶບລ້າງ "ອັດຕະໂນມັດ"

source: Alignment
lo: ການຈັດລຽງ

source: All blocks look ok.
lo: ທຸກບລັອກເບິ່ງຄືວ່າໂອເຄ.

source: <All build modes>
lo: <ທຸກ build mode>

source: All inherited options
lo: ທຸກຕົວເລືອກທີ່ສືບທອດມາ

source: All options of FPC%s ("%s")
lo: ທຸກຕົວເລືອກຂອງ FPC%s ("%s")

source: Allow searching for multiple lines
lo: ອະນຸຍາດໃຫ້ຄົ້ນຫາຫຼາຍແຖວ

source: All parameters of this function are already set at this call. Nothing to add.
lo: ພາຣາມິເຕີທັງໝົດຂອງຟັງຊັນນີ້ຖືກຕັ້ງຄ່າແລ້ວໃນການຮຽກນີ້. ບໍ່ມີຫຍັງຕ້ອງເພີ່ມ.

source: All .pas, .pp, .p, .inc in unit/include path are already in a project/package.
lo: ທຸກ .pas, .pp, .p, .inc ໃນ unit/include path ມີຢູ່ໃນໂປຣເຈັກ/ແພັກເກັດແລ້ວ.

source: All your modifications to "%s"%swill be lost and the file reopened.
lo: ການແກ້ໄຂທັງໝົດຂອງທ່ານຕໍ່ "%s"%sຈະສູນຫາຍ ແລະ ໄຟລ໌ຈະຖືກເປີດໃໝ່.

source: %s already contains the help: %s
lo: %s ມີ help ຢູ່ແລ້ວ: %s

source: Alternative key
lo: ປຸ່ມທາງເລືອກ

source: Alternative key (or 2 key sequence)
lo: ປຸ່ມທາງເລືອກ (ຫຼື ລຳດັບ 2 ປຸ່ມ)

source: Always convert suggested default file name to lowercase
lo: ປ່ຽນຊື່ໄຟລ໌ເລີ່ມຕົ້ນທີ່ແນະນຳເປັນຕົວພິມນ້ອຍສະເໝີ

source: Always draw selected items focused
lo: ແຕ້ມລາຍການທີ່ເລືອກໃຫ້ຢູ່ໃນສະຖານະໂຟກັດສະເໝີ

source: Always ignore
lo: ບໍ່ສົນໃຈສະເໝີ

source: A macro with this name already exists.
lo: macro ທີ່ມີຊື່ນີ້ມີຢູ່ແລ້ວ.

source: Ambiguous file found
lo: ພົບໄຟລ໌ທີ່ບໍ່ຊັດເຈນ

source: Ambiguous file found: "%s"%sThis file can be mistaken with "%s"%sDelete the ambiguous file?
lo: ພົບໄຟລ໌ທີ່ບໍ່ຊັດເຈນ: "%s"%sໄຟລ໌ນີ້ອາດຈະເຂົ້າໃຈຜິດກັບ "%s"%sລຶບໄຟລ໌ທີ່ບໍ່ຊັດເຈນນີ້ບໍ່?

source: Anchor bottom side to bottom side of sibling. Use BorderSpacing to set a distance. BorderSpacing of sibling is ignored.
lo: ຍຶດດ້ານລຸ່ມໃສ່ດ້ານລຸ່ມຂອງ sibling. ໃຊ້ BorderSpacing ເພື່ອກຳນົດໄລຍະຫ່າງ. BorderSpacing ຂອງ sibling ຈະຖືກລະເລີຍ.

source: Anchor bottom side to top side of sibling. The kept distance is defined by both BorderSpacing properties of this and sibling.
lo: ຍຶດດ້ານລຸ່ມໃສ່ດ້ານເທິງຂອງ sibling. ໄລຍະຫ່າງຖືກກຳນົດໂດຍທັງສອງ BorderSpacing ຂອງຕົວນີ້ ແລະ sibling.

source: Anchor Editor - no control selected
lo: Anchor Editor - ບໍ່ມີຕົວຄວບຄຸມຖືກເລືອກ

source: Enabled = Include %s in Anchors
lo: Enabled = ລວມ %s ໃນ Anchors

source: Anchor left side to left side of sibling. Use BorderSpacing to set a distance. BorderSpacing of sibling is ignored.
lo: ຍຶດດ້ານຊ້າຍໃສ່ດ້ານຊ້າຍຂອງ sibling. ໃຊ້ BorderSpacing ເພື່ອກຳນົດໄລຍະຫ່າງ. BorderSpacing ຂອງ sibling ຈະຖືກລະເລີຍ.

source: Anchor left side to right side of sibling. The kept distance is defined by both BorderSpacing properties of this and sibling.
lo: ຍຶດດ້ານຊ້າຍໃສ່ດ້ານຂວາຂອງ sibling. ໄລຍະຫ່າງຖືກກຳນົດໂດຍທັງສອງ BorderSpacing ຂອງຕົວນີ້ ແລະ sibling.

source: Anchor right side to left side of sibling. The kept distance is defined by both BorderSpacing properties of this and sibling.
lo: ຍຶດດ້ານຂວາໃສ່ດ້ານຊ້າຍຂອງ sibling. ໄລຍະຫ່າງຖືກກຳນົດໂດຍທັງສອງ BorderSpacing ຂອງຕົວນີ້ ແລະ sibling.

source: Anchor right side to right side of sibling. Use BorderSpacing to set a distance. BorderSpacing of sibling is ignored.
lo: ຍຶດດ້ານຂວາໃສ່ດ້ານຂວາຂອງ sibling. ໃຊ້ BorderSpacing ເພື່ອກຳນົດໄລຍະຫ່າງ. BorderSpacing ຂອງ sibling ຈະຖືກລະເລີຍ.

source: Anchors of %s
lo: Anchors ຂອງ %s

source: Anchors of selected controls
lo: Anchors ຂອງຕົວຄວບຄຸມທີ່ເລືອກ

source: Anchor top side to bottom side of sibling. The kept distance is defined by both BorderSpacing properties of this and sibling.
lo: ຍຶດດ້ານເທິງໃສ່ດ້ານລຸ່ມຂອງ sibling. ໄລຍະຫ່າງຖືກກຳນົດໂດຍທັງສອງ BorderSpacing ຂອງຕົວນີ້ ແລະ sibling.

source: Anchor top side to top side of sibling. Use BorderSpacing to set a distance. BorderSpacing of sibling is ignored.
lo: ຍຶດດ້ານເທິງໃສ່ດ້ານເທິງຂອງ sibling. ໃຊ້ BorderSpacing ເພື່ອກຳນົດໄລຍະຫ່າງ. BorderSpacing ຂອງ sibling ຈະຖືກລະເລີຍ.

source: An error occurred at last startup while loading %s!%sLoad this project again?
lo: ເກີດຂໍ້ຜິດພາດຂຶ້ນໃນການເລີ່ມຕົ້ນຄັ້ງຫຼ້າສຸດຂະນະທີ່ໂຫຼດ %s!%sໂຫຼດໂປຣເຈັກນີ້ອີກຄັ້ງບໍ່?

source: Appearance
lo: ຮູບລັກສະນະ

source: &Application class name
lo: ຊື່ &Application class

source: A graphical Free Pascal application using the cross-platform LCL library for its GUI.
lo: ແອັບພລິເຄຊັນ Free Pascal ແບບກຣາຟິກທີ່ໃຊ້ໄລບຣາຣີ LCL ຂ້າມແພລັດຟອມສຳລັບ GUI.

# lazarusidestrconsts.lisapply
source: Apply
lo: ນຳໃຊ້

source: Apply build flags (-B) to dependencies too.
lo: ນຳໃຊ້ build flags (-B) ກັບ dependencies ເຊັ່ນກັນ.

source: Apply conventions
lo: ນຳໃຊ້ conventions

source: Adjust name extension and character case for platform and file type.
lo: ປັບນາມສະກຸນຊື່ ແລະ ຕົວພິມສຳລັບແພລັດຟອມ ແລະ ປະເພດໄຟລ໌.

source: A project unit can not be used by other packages/projects
lo: Project unit ບໍ່ສາມາດຖືກໃຊ້ໂດຍແພັກເກັດ/ໂປຣເຈັກອື່ນໄດ້

source: Borderspace around the control. The other four borderspaces are added to this value.
lo: Borderspace ອ້ອມຮອບຕົວຄວບຄຸມ. Borderspace ອີກສີ່ດ້ານຈະຖືກເພີ່ມໃສ່ຄ່ານີ້.

source: Ask before replacing each found text
lo: ຖາມກ່ອນແທນທີ່ຂໍ້ຄວາມທີ່ພົບແຕ່ລະອັນ

source: Ask before saving project's session
lo: ຖາມກ່ອນບັນທຶກ session ຂອງໂປຣເຈັກ

source: Ask for component name after putting it on a designer form.
lo: ຖາມຊື່ component ຫຼັງຈາກວາງມັນໃສ່ຟອມ designer.

source: Ask for file name on new file
lo: ຖາມຊື່ໄຟລ໌ເມື່ອສ້າງໄຟລ໌ໃໝ່

source: Ask name on create
lo: ຖາມຊື່ເມື່ອສ້າງ

source: Automatically adjust IDE main window height
lo: ປັບຄວາມສູງໜ້າຕ່າງຫຼັກ IDE ອັດຕະໂນມັດ

source: Show complete component palette
lo: ສະແດງ component palette ຄົບຖ້ວນ

source: If component palette spans over more lines, show them all and not only one.
lo: ຖ້າ component palette ກິນເນື້ອທີ່ຫຼາຍແຖວ, ສະແດງພວກມັນທັງໝົດ ແລະ ບໍ່ແມ່ນພຽງແຕ່ແຖວດຽວ.

source: Auto completion: off
lo: ຕື່ມຄຳອັດຕະໂນມັດ: ປິດ

source: Auto completion: on
lo: ຕື່ມຄຳອັດຕະໂນມັດ: ເປີດ

source: Markup and Matches
lo: Markup ແລະ ການຈັບຄູ່

# lazarusidestrconsts.lisautomatic
source: Automatic
lo: ອັດຕະໂນມັດ

# lazarusidestrconsts.lisautomatically
source: Automatic
lo: ອັດຕະໂນມັດ

source: Automatically convert .lfm files to .lrs resource files
lo: ປ່ຽນໄຟລ໌ .lfm ເປັນໄຟລ໌ resource .lrs ອັດຕະໂນມັດ

source: do not complete selection
lo: ບໍ່ຕ້ອງເຕີມເຕັມການເລືອກ

source: Automatically invoke after point
lo: ເອີ້ນໃຊ້ງານອັດຕະໂນມັດຫຼັງຈາກຈຸດ

source: Automatically invoke on typing
lo: ເອີ້ນໃຊ້ງານອັດຕະໂນມັດເມື່ອພິມ

source: Only complete if word is longer or equal
lo: ເຕີມເຕັມສະເພາະເມື່ອຄຳສັບຍາວກວ່າ ຫຼື ເທົ່າກັບ

source: Only complete when at end of word
lo: ເຕີມເຕັມສະເພາະເມື່ອຢູ່ທ້າຍຄຳ

source: Use completion box delay
lo: ໃຊ້ການໜ່ວງເວລາຂອງກ່ອງເຕີມຄຳ

source: line break
lo: ຕັດແຖວ

source: space
lo: ຍະຫວ່າງ

source: word end
lo: ທ້າຍຄຳ

source: do not add character
lo: ບໍ່ຕ້ອງເພີ່ມຕົວອັກສອນ

source: Automatically use single possible identifier
lo: ໃຊ້ຕົວລະບຸທີ່ເປັນໄປໄດ້ອັນດຽວອັດຕະໂນມັດ

source: Completion and Hints
lo: ການເຕີມເຕັມ ແລະ ຄຳແນະນຳ

source: Auto show
lo: ສະແດງອັດຕະໂນມັດ

source: Available for installation
lo: ມີໃຫ້ຕິດຕັ້ງ

source: Available project build modes
lo: Build modes ຂອງໂປຣເຈັກທີ່ມີຢູ່

source: Make backup of changed files
lo: ສ້າງສຳຮອງຂອງໄຟລ໌ທີ່ປ່ຽນແປງ

source: Backup file failed
lo: ການສຳຮອງໄຟລ໌ລົ້ມເຫຼວ

source: Creates a Backup directory under project directory
lo: ສ້າງໄດເຣັກທໍຣີ Backup ພາຍໃຕ້ໄດເຣັກທໍຣີໂປຣເຈັກ

source: Changing the package name or version breaks dependencies. Should these dependencies be changed as well?%sSelect Yes to change all listed dependencies.%sSelect Ignore to break the dependencies and continue.
lo: ການປ່ຽນຊື່ແພັກເກັດ ຫຼື ເວີຊັນເຮັດໃຫ້ dependency ເສຍຫາຍ. ຄວນປ່ຽນ dependency ເຫຼົ່ານີ້ດ້ວຍບໍ່?%sເລືອກ Yes ເພື່ອປ່ຽນ dependency ທັງໝົດທີ່ລະບຸ.%sເລືອກ Ignore ເພື່ອທຳລາຍ dependency ແລະ ສືບຕໍ່.

source: begins
lo: ເລີ່ມຕົ້ນ

source: Behind related
lo: ຢູ່ຫຼັງອັນທີ່ກ່ຽວຂ້ອງ

source: Be less verbose. Can be given multiple times.
lo: ຫຼຸດຄວາມລະອຽດລົງ. ສາມາດໃສ່ໄດ້ຫຼາຍຄັ້ງ.

source: Be more verbose. Can be given multiple times.
lo: ເພີ່ມຄວາມລະອຽດຂຶ້ນ. ສາມາດໃສ່ໄດ້ຫຼາຍຄັ້ງ.

source: Best viewed by installing a HTML control like turbopoweriprodsgn
lo: ເບິ່ງໄດ້ດີທີ່ສຸດໂດຍການຕິດຕັ້ງ HTML control ເຊັ່ນ turbopoweriprodsgn

source: Always build before run
lo: Build ກ່ອນ Run ສະເໝີ

source: Build Command
lo: ຄຳສັ່ງ Build

source: On build project execute the Build File command instead
lo: ເມື່ອ build ໂປຣເຈັກ ໃຫ້ປະຕິບັດຄຳສັ່ງ Build File ແທນ

source: On run project execute the Run File command instead
lo: ເມື່ອ run ໂປຣເຈັກ ໃຫ້ປະຕິບັດຄຳສັ່ງ Run File ແທນ

source: Run Command
lo: ຄຳສັ່ງ Run

source: When this file is active in source editor
lo: ເມື່ອໄຟລ໌ນີ້ active ໃນ source editor

source: Working directory (leave empty for file path)
lo: ໄດເຣັກທໍຣີເຮັດວຽກ (ປະຫວ່າງໄວ້ສຳລັບ file path)

source: Bold non default values
lo: ເຮັດຕົວໜາຄ່າທີ່ບໍ່ແມ່ນຄ່າເລີ່ມຕົ້ນ

source: Border space
lo: ໄລຍະຫ່າງຂອບ

# lazarusidestrconsts.lisbottom
source: Bottom
lo: ລຸ່ມ

source: Bottom borderspace. This value is added to base borderspace and used for the space below the control.
lo: Borderspace ດ້ານລຸ່ມ. ຄ່ານີ້ຖືກເພີ່ມໃສ່ base borderspace ແລະ ໃຊ້ສຳລັບພື້ນທີ່ລຸ່ມຕົວຄວບຄຸມ.

source: Bottom anchoring
lo: ການຍຶດດ້ານລຸ່ມ

source: Bottoms
lo: ດ້ານລຸ່ມ

source: This is the sibling control to which the bottom side is anchored. Leave empty for anchoring to parent in Delphi style (BorderSpacing and ReferenceSide do not matter).
lo: ນີ້ແມ່ນຕົວຄວບຄຸມ sibling ທີ່ດ້ານລຸ່ມຖືກຍຶດໃສ່. ປະຫວ່າງໄວ້ເພື່ອຍຶດໃສ່ parent ໃນແບບ Delphi (BorderSpacing ແລະ ReferenceSide ບໍ່ສຳຄັນ).

source: Bottom space equally
lo: ພື້ນທີ່ດ້ານລຸ່ມເທົ່າກັນ

source: Browse and select a compiler (e.g. ppcx64
lo: ເລືອກຫາ ແລະ ເລືອກ compiler (ເຊັ່ນ ppcx64)

source: &Apply
lo: &ນຳໃຊ້

# lazarusidestrconsts.lisbtnclose
source: &Close
lo: &ປິດ

# lazarusidestrconsts.lisbtndlgreplace
source: &Replace ...
lo: &ແທນທີ່ ...

source: &Find
lo: &ຄົ້ນຫາ

# lazarusidestrconsts.lisbtnquit
source: &Quit
lo: &ອອກ

# lazarusidestrconsts.lisbtnremove
source: &Remove
lo: &ລຶບອອກ

source: &Rename
lo: &ປ່ຽນຊື່

source: &Replace
lo: &ແທນທີ່

# lazarusidestrconsts.lisbuild
source: &Build
lo: &ສ້າງ (Build)

source: Build all files of project/package/IDE.
lo: Build ໄຟລ໌ທັງໝົດຂອງ ໂປຣເຈັກ/ແພັກເກັດ/IDE.

# lazarusidestrconsts.lisbuildcaption
source: Build
lo: ສ້າງ (Build)

source: Build Date
lo: ວັນທີ Build

source: Build IDE
lo: ສ້າງ IDE

source: Build IDE with packages. Optional compiler options will be passed after the options from used build mode and can be specified here or with the --opt option.
lo: ສ້າງ IDE ພ້ອມແພັກເກັດ. ຕົວເລືອກ compiler ເພີ່ມເຕີມຈະຖືກສົ່ງຕໍ່ຫຼັງຈາກຕົວເລືອກຈາກ build mode ທີ່ໃຊ້ ແລະ ສາມາດລະບຸໄດ້ທີ່ນີ້ ຫຼື ດ້ວຍຕົວເລືອກ --opt.

source: Building
lo: ກຳລັງສ້າງ

source: Building Lazarus failed
lo: ການສ້າງ Lazarus ລົ້ມເຫຼວ

source: Build Mode: %s
lo: ໂໝດ Build: %s

source: Differences between build modes
lo: ຄວາມແຕກຕ່າງລະຫວ່າງ build modes

source: Differences from other build modes
lo: ຄວາມແຕກຕ່າງຈາກ build modes ອື່ນໆ

source: Mode:
lo: ໂໝດ:

source: Build mode
lo: ໂໝດ Build

source: All build modes must have a name.
lo: ໂໝດການສ້າງທັງໝົດຕ້ອງມີຊື່.

source: Build new project
lo: ສ້າງໂຄງການໃໝ່

source: Build number
lo: ໝາຍເລກການສ້າງ

# lazarusidestrconsts.lisbuildstage
source: Build
lo: ສ້າງ

source: Busy
lo: ກຳລັງເຮັດວຽກ

source: %s byte
lo: %s ໄບຕ໌

source: Cancel loading this component
lo: ຍົກເລີກການໂຫຼດອົງປະກອບນີ້

source: Cancel loading unit
lo: ຍົກເລີກການໂຫຼດຢູນິດ

source: Cancel renaming
lo: ຍົກເລີກການປ່ຽນຊື່

source: Cannot compile project
lo: ບໍ່ສາມາດຄອມໄພລ໌ໂຄງການໄດ້

source: Cannot copy top level component.
lo: ບໍ່ສາມາດສຳເນົາອົງປະກອບລະດັບເທິງສຸດໄດ້.

source: Cannot create file "%s"
lo: ບໍ່ສາມາດສ້າງຟາຍລ໌ "%s"

source: Cannot delete last mode.
lo: ບໍ່ສາມາດລຶບໂໝດສຸດທ້າຍໄດ້.

source: cannot execute "%s"
lo: ບໍ່ສາມາດປະຕິບັດການ "%s"

source: Cannot find %s
lo: ບໍ່ສາມາດຊອກຫາ %s

source: cannot find executable "%s"
lo: ບໍ່ສາມາດຊອກຫາຟາຍລ໌ໂປຣແກຣມ "%s"

source: Cannot find Lazarus starter:%s%s
lo: ບໍ່ສາມາດຊອກຫາຕົວເລີ່ມ Lazarus:%s%s

source: Cannot open form "%s".
lo: ບໍ່ສາມາດເປີດຟອມ "%s".

source: Cannot save form "%s".
lo: ບໍ່ສາມາດບັນທຶກຟອມ "%s".

source: Cannot substitute macro "%s".
lo: ບໍ່ສາມາດແທນທີ່ macro "%s".

source: Cannot test the compiler while debugging or compiling.
lo: ບໍ່ສາມາດທົດສອບຄອມໄພເລີໃນຂະນະທີ່ກຳລັງດີບັກ ຫຼື ຄອມໄພລ໌ຢູ່.

source: Can only change the class of TComponents.
lo: ສາມາດປ່ຽນຄລາສຂອງ TComponents ໄດ້ເທົ່ານັ້ນ.

source: Can't find a valid %s.ppu
lo: ບໍ່ສາມາດຊອກຫາ %s.ppu ທີ່ຖືກຕ້ອງ

source: Compare files (not for creating patches)
lo: ປຽບທຽບຟາຍລ໌ (ບໍ່ແມ່ນສຳລັບການສ້າງ patch)

source: Caption of active build mode
lo: ຄຳອະທິບາຍຂອງໂໝດການສ້າງທີ່ໃຊ້ງານຢູ່

source: %s (%s files)
lo: %s (%s ຟາຍລ໌)

source: Really delete %s source files%s%s
lo: ຕ້ອງການລຶບຟາຍລ໌ຊອດໂຄດ %s ແທ້ບໍ່%s%s

source: Change Class of %s
lo: ປ່ຽນຄລາສຂອງ %s

source: no class
lo: ບໍ່ມີຄລາສ

source: Ambiguous compiler
lo: ຄອມໄພເລີບໍ່ຈະແຈ້ງ

source: Please check the Test directory under %sTools -> Options -> Files -> Directory for building test projects
lo: ກະລຸນາກວດສອບໄດເຣັກທໍຣີທົດສອບພາຍໃຕ້ %sTools -> Options -> Files -> Directory ສຳລັບ ການສ້າງໂຄງການທົດສອບ

source: The compiler "%s" is not an executable file.%sDetails: %s
lo: ຄອມໄພເລີ "%s" ບໍ່ແມ່ນຟາຍລ໌ໂປຣແກຣມ.%sລາຍລະອຽດ: %s

source: contains
lo: ປະກອບມີ

source: Copy output to clipboard
lo: ສຳເນົາຜົນລາຍງານໄປທີ່ clipboard

source: The dates of the .ppu files of FPC differ by more than one hour.%sThis can mean, they are from two different installations.%sFile1: %s%sFile2: %s
lo: ວັນທີຂອງຟາຍລ໌ .ppu ຂອງ FPC ແຕກຕ່າງກັນຫຼາຍກວ່າໜຶ່ງຊົ່ວໂມງ.%sນີ້ອາດຈະໝາຍຄວາມວ່າ ພວກມັນມາຈາກການຕິດຕັ້ງທີ່ແຕກຕ່າງກັນ.%sຟາຍລ໌ 1: %s%sຟາຍລ໌ 2: %s

source: ERROR:
lo: ຂໍ້ຜິດພາດ:

source: FPC unit path contains a source:
lo: path ຂອງຢູນິດ FPC ປະກອບມີຊອດໂຄດ:

source: new line symbols
lo: ສັນຍາລັກແຖວໃໝ່

source: HINT:
lo: ຄຳແນະນຳ:

source: Invalid compiler
lo: ຄອມໄພເລີບໍ່ຖືກຕ້ອງ

source: Invalid search path
lo: ເສັ້ນທາງຄົ້ນຫາບໍ່ຖືກຕ້ອງ

source: Invalid Test Directory
lo: ໄດເຣັກທໍຣີທົດສອບບໍ່ຖືກຕ້ອງ

source: Missing unit
lo: ຢູນິດທີ່ຂາດໄປ

source: RTL unit not found: %s
lo: ບໍ່ພົບຢູນິດ RTL: %s
