Repository: fpc/Lazarus
Catalog: languages/lazaruside.*.po
Languages: lo

source: Find block start
lo: ຄົ້ນຫາຈຸດເລີ່ມຕົ້ນບລັອກ

source: Find Declaration
lo: ຄົ້ນຫາການປະກາດ (Declaration)

source: Find Identifier References
lo: ຄົ້ນຫາການອ້າງອີງ Identifier

source: Find in Files
lo: ຄົ້ນຫາໃນໄຟລ໌

# lazarusidestrconsts.srkmecfindnext
source: Find Next
lo: ຄົ້ນຫາຖັດໄປ

source: Find Next Word Occurrence
lo: ຄົ້ນຫາຄຳສັບທີ່ປະກົດຖັດໄປ

source: Find Overloads
lo: ຄົ້ນຫາ Overloads

source: Find Overloads ...
lo: ຄົ້ນຫາ Overloads ...

source: Find Previous
lo: ຄົ້ນຫາກ່ອນໜ້າ

source: Find Previous Word Occurrence
lo: ຄົ້ນຫາຄຳສັບທີ່ປະກົດກ່ອນໜ້າ

source: Find Procedure Definiton
lo: ຄົ້ນຫາຄຳນິຍາມ Procedure

source: Find Procedure Method
lo: ຄົ້ນຫາ Procedure Method

source: Fold at Cursor
lo: ພັບຢູ່ບ່ອນເຄີເຊີ

source: Fold to Level %d
lo: ພັບໄປທີ່ລະດັບ %d

source: Toggle Fold at Cursor
lo: ເປີດ/ປິດ ການພັບຢູ່ບ່ອນເຄີເຊີ

source: Go to source editor %d
lo: ໄປທີ່ຕົວແກ້ໄຂຊອດໂຄ້ດ %d

source: Go to include directive of current include file
lo: ໄປທີ່ include directive ຂອງໄຟລ໌ include ປັດຈຸບັນ

source: Go to Line Number
lo: ໄປທີ່ໝາຍເລກແຖວ

source: Go to bookmark %d
lo: ໄປທີ່ bookmark %d

source: Goto XY
lo: ໄປທີ່ XY

source: Guess Misplaced $IFDEF
lo: ຄາດເດົາ $IFDEF ທີ່ວາງຜິດບ່ອນ

source: Move cursor part-word left (e.g. CamelCase)
lo: ຍ້າຍເຄີເຊີສ່ວນຂອງຄຳໄປທາງຊ້າຍ (ເຊັ່ນ CamelCase)

source: Move cursor part-word right (e.g. CamelCase)
lo: ຍ້າຍເຄີເຊີສ່ວນຂອງຄຳໄປທາງຂວາ (ເຊັ່ນ CamelCase)

source: Insert ChangeLog entry
lo: ແຊກລາຍການ ChangeLog

source: Insert from Charactermap
lo: ແຊກຈາກແຜນຜັງຕົວອັກສອນ

source: Insert CVS keyword Author
lo: ແຊກ CVS keyword Author

source: Insert CVS keyword Date
lo: ແຊກ CVS keyword Date

source: Insert CVS keyword Header
lo: ແຊກ CVS keyword Header

source: Insert CVS keyword ID
lo: ແຊກ CVS keyword ID

source: Insert CVS keyword Log
lo: ແຊກ CVS keyword Log

source: Insert CVS keyword Name
lo: ແຊກ CVS keyword Name

source: Insert CVS keyword Revision
lo: ແຊກ CVS keyword Revision

source: Insert CVS keyword Source
lo: ແຊກ CVS keyword Source

source: Insert current date and time
lo: ແຊກວັນທີ ແລະ ເວລາປັດຈຸບັນ

source: Insert Full Filename
lo: ແຊກຊື່ໄຟລ໌ເຕັມ

source: Insert GPL notice
lo: ແຊກປະກາດ GPL

source: Insert GPL notice (translated)
lo: ແຊກປະກາດ GPL (ແປແລ້ວ)

source: Insert a GUID
lo: ແຊກ GUID

source: Insert LGPL notice
lo: ແຊກປະກາດ LGPL

source: Insert LGPL notice (translated)
lo: ແຊກປະກາດ LGPL (ແປແລ້ວ)

source: Break line, leave cursor
lo: ຕັດແຖວ, ປະເຄີເຊີໄວ້

source: Insert MIT notice
lo: ແຊກປະກາດ MIT

source: Insert MIT notice (translated)
lo: ແຊກປະກາດ MIT (ແປແລ້ວ)

source: Insert Mode
lo: ໂໝດແຊກ

source: Insert modified LGPL notice
lo: ແຊກປະກາດ LGPL ດັດແກ້

source: Insert modified LGPL notice (translated)
lo: ແຊກປະກາດ LGPL ດັດແກ້ (ແປແລ້ວ)

source: Insert current username
lo: ແຊກຊື່ຜູ້ໃຊ້ປັດຈຸບັນ

source: inspect
lo: ກວດສອບ

# lazarusidestrconsts.srkmecinvertassignment
source: Invert Assignment
lo: ກັບດ້ານການກຳນົດຄ່າ

source: Jump to next search result
lo: ໄປທີ່ຜົນການຄົ້ນຫາຖັດໄປ

source: Jump to previous search result
lo: ໄປທີ່ຜົນການຄົ້ນຫາກ່ອນໜ້າ

# lazarusidestrconsts.srkmeckeymapleft
source: Left
lo: ຊ້າຍ

# lazarusidestrconsts.srkmeckeymapright
source: Right
lo: ຂວາ

source: Move cursor left
lo: ຍ້າຍເຄີເຊີໄປທາງຊ້າຍ

source: Break line and move cursor
lo: ຕັດແຖວ ແລະ ຍ້າຍເຄີເຊີ

source: Move cursor to line end
lo: ຍ້າຍເຄີເຊີໄປສຸດແຖວ

source: Line selection mode
lo: ໂໝດການເລືອກແຖວ

source: Move cursor to line start
lo: ຍ້າຍເຄີເຊີໄປຕົ້ນແຖວ

source: Move cursor to text start in line
lo: ຍ້າຍເຄີເຊີໄປຈຸດເລີ່ມຕົ້ນຂໍ້ຄວາມໃນແຖວ

source: Lock Editor
lo: ລັອກຕົວແກ້ໄຂ

source: Make Resource String
lo: ສ້າງ Resource String

source: Go to matching bracket
lo: ໄປທີ່ວົງເລັບຄູ່ກັນ

source: Move editor left
lo: ຍ້າຍຕົວແກ້ໄຂໄປທາງຊ້າຍ

source: Move editor leftmost
lo: ຍ້າຍຕົວແກ້ໄຂໄປຊ້າຍສຸດ

source: Move editor to new window
lo: ຍ້າຍຕົວແກ້ໄຂໄປໜ້າຕ່າງໃໝ່

source: Move editor to next free window
lo: ຍ້າຍຕົວແກ້ໄຂໄປໜ້າຕ່າງວ່າງຖັດໄປ

source: Move editor to prior free window
lo: ຍ້າຍຕົວແກ້ໄຂໄປໜ້າຕ່າງວ່າງກ່ອນໜ້າ

source: Move editor right
lo: ຍ້າຍຕົວແກ້ໄຂໄປທາງຂວາ

source: Move editor rightmost
lo: ຍ້າຍຕົວແກ້ໄຂໄປຂວາສຸດ

source: Move line down
lo: ຍ້າຍແຖວລົງ

source: Move line up
lo: ຍ້າຍແຖວຂຶ້ນ

source: Move selection down
lo: ຍ້າຍສ່ວນທີ່ເລືອກລົງ

source: Move selection left
lo: ຍ້າຍສ່ວນທີ່ເລືອກໄປທາງຊ້າຍ

source: Move selection right
lo: ຍ້າຍສ່ວນທີ່ເລືອກໄປທາງຂວາ

source: Move selection up
lo: ຍ້າຍສ່ວນທີ່ເລືອກຂຶ້ນ

source: Next Bookmark
lo: Bookmark ຖັດໄປ

source: Go to next editor
lo: ໄປທີ່ຕົວແກ້ໄຂຖັດໄປ

source: Go to next editor in history
lo: ໄປທີ່ຕົວແກ້ໄຂຖັດໄປໃນປະຫວັດ

source: Go to next editor with same Source
lo: ໄປທີ່ຕົວແກ້ໄຂຖັດໄປທີ່ມີ Source ດຽວກັນ

source: Go to next window
lo: ໄປທີ່ໜ້າຕ່າງຖັດໄປ

source: Normal selection mode
lo: ໂໝດການເລືອກແບບປົກກະຕິ

source: Open File at Cursor
lo: ເປີດໄຟລ໌ຢູ່ບ່ອນເຄີເຊີ

source: Overwrite Mode
lo: ໂໝດຂຽນທັບ

source: Move cursor to bottom of page
lo: ຍ້າຍເຄີເຊີໄປທ້າຍໜ້າ

source: Move cursor down one page
lo: ຍ້າຍເຄີເຊີລົງໜຶ່ງໜ້າ

source: Move cursor left one page
lo: ຍ້າຍເຄີເຊີໄປຊ້າຍໜຶ່ງໜ້າ

source: Move cursor right one page
lo: ຍ້າຍເຄີເຊີໄປຂວາໜຶ່ງໜ້າ

source: Move cursor to top of page
lo: ຍ້າຍເຄີເຊີໄປເທິງສຸດຂອງໜ້າ

source: Move cursor up one page
lo: ຍ້າຍເຄີເຊີຂຶ້ນໜຶ່ງໜ້າ

# lazarusidestrconsts.srkmecpaste
source: Paste
lo: ວາງ

source: Paste (as Columns)
lo: ວາງ (ແບບຖັນ)

source: pause program
lo: ຢຸດໂປຣແກຣມຊົ່ວຄາວ

source: Clear all extra carets
lo: ລ້າງ extra carets ທັງໝົດ

source: Cursor keys clear all extra carets
lo: ປຸ່ມເຄີເຊີລ້າງ extra carets ທັງໝົດ

source: Cursor keys move all extra carets
lo: ປຸ່ມເຄີເຊີຍ້າຍ extra carets ທັງໝົດ

source: Add extra caret
lo: ເພີ່ມ extra caret

source: Toggle extra caret
lo: ເປີດ/ປິດ extra caret

source: Remove extra caret
lo: ລຶບ extra caret

source: Previous Bookmark
lo: Bookmark ກ່ອນໜ້າ

source: Go to prior editor
lo: ໄປທີ່ຕົວແກ້ໄຂກ່ອນໜ້າ

source: Go to previous editor in history
lo: ໄປທີ່ຕົວແກ້ໄຂກ່ອນໜ້າໃນປະຫວັດ

source: Go to prior editor with same Source
lo: ໄປທີ່ຕົວແກ້ໄຂກ່ອນໜ້າທີ່ມີ Source ດຽວກັນ

source: Go to prior window
lo: ໄປທີ່ໜ້າຕ່າງກ່ອນໜ້າ

source: quick compile, no linking
lo: compile ດ່ວນ, ບໍ່ມີການ linking

source: remove breakpoint
lo: ລຶບ breakpoint

source: Remove Empty Methods
lo: ລຶບ Methods ທີ່ວ່າງເປົ່າ

source: Remove Unused Units
lo: ລຶບ Units ທີ່ບໍ່ໄດ້ໃຊ້

source: Rename Identifier
lo: ປ່ຽນຊື່ Identifier

source: Replace Text
lo: ແທນທີ່ຂໍ້ຄວາມ

# lazarusidestrconsts.srkmecreportingbug
source: Reporting a bug
lo: ການລາຍງານບັກ (bug)

source: reset debugger
lo: ຣີເຊັດ debugger

source: Move cursor right
lo: ຍ້າຍເຄີເຊີໄປທາງຂວາ

source: run program
lo: run ໂປຣແກຣມ

source: run file
lo: run ໄຟລ໌

source: run with debugging
lo: run ພ້ອມ debugging

source: run without debugging
lo: run ໂດຍບໍ່ມີ debugging

source: Scroll current line to center
lo: ເລື່ອນແຖວປັດຈຸບັນມາເຄິ່ງກາງ

source: Scroll down one line
lo: ເລື່ອນລົງໜຶ່ງແຖວ

source: Scroll left one char
lo: ເລື່ອນຊ້າຍໜຶ່ງຕົວອັກສອນ

source: Scroll right one char
lo: ເລື່ອນຂວາໜຶ່ງຕົວອັກສອນ

source: Scroll up one line
lo: ເລື່ອນຂຶ້ນໜຶ່ງແຖວ

source: Select Down
lo: ເລືອກລົງ

# lazarusidestrconsts.srkmecselectall
source: Select All
lo: ເລືອກທັງໝົດ

source: Convert tabs to spaces in selection
lo: ປ່ຽນ tabs ເປັນ spaces ໃນສ່ວນທີ່ເລືອກ

source: Select to absolute end
lo: ເລືອກຈົນສຸດທ້າຍ

source: Select to absolute beginning
lo: ເລືອກຈົນເລີ່ມຕົ້ນ

source: Select Goto XY
lo: ເລືອກ Goto XY

source: Select part-word left (e.g. CamelCase)
lo: ເລືອກສ່ວນຂອງຄຳທາງຊ້າຍ (ເຊັ່ນ CamelCase)

source: Select part-word right (e.g. CamelCase)
lo: ເລືອກສ່ວນຂອງຄຳທາງຂວາ (ເຊັ່ນ CamelCase)

source: Select Left
lo: ເລືອກທາງຊ້າຍ

# lazarusidestrconsts.srkmecsellineend
source: Select Line End
lo: ເລືອກຈົນສຸດແຖວ

# lazarusidestrconsts.srkmecsellinestart
source: Select Line Start
lo: ເລືອກຈົນຕົ້ນແຖວ

source: Select to text start in line
lo: ເລືອກໄປຍັງຈຸດເລີ່ມຕົ້ນຂໍ້ຄວາມໃນແຖວ

# lazarusidestrconsts.srkmecselpagebottom
source: Select Page Bottom
lo: ເລືອກທ້າຍໜ້າ

source: Select Page Down
lo: ເລືອກລົງໜຶ່ງໜ້າ

source: Select Page Left
lo: ເລືອກຊ້າຍໜຶ່ງໜ້າ

source: Select Page Right
lo: ເລືອກຂວາໜຶ່ງໜ້າ

# lazarusidestrconsts.srkmecselpagetop
source: Select Page Top
lo: ເລືອກເທິງສຸດຂອງໜ້າ

source: Select Page Up
lo: ເລືອກຂຶ້ນໜຶ່ງໜ້າ

source: Select Right
lo: ເລືອກທາງຂວາ

source: Smart select word left (start/end of word)
lo: ເລືອກຄຳສັບອັດສະລິຍະທາງຊ້າຍ (ເລີ່ມຕົ້ນ/ສິ້ນສຸດຂອງຄຳ)

source: Smart select word right (start/end of word)
lo: ເລືອກຄຳສັບອັດສະລິຍະທາງຂວາ (ເລີ່ມຕົ້ນ/ສິ້ນສຸດຂອງຄຳ)

source: Start sticky selecting
lo: ເລີ່ມການເລືອກແບບ sticky

source: Start sticky selecting (Columns)
lo: ເລີ່ມການເລືອກແບບ sticky (ຖັນ)

source: Start sticky selecting (Line)
lo: ເລີ່ມການເລືອກແບບ sticky (ແຖວ)

source: Stop sticky selecting
lo: ຢຸດການເລືອກແບບ sticky

source: Select Up
lo: ເລືອກຂຶ້ນ

source: Select word-end left
lo: ເລືອກຈຸດສິ້ນສຸດຄຳທາງຊ້າຍ

source: Select word-end right
lo: ເລືອກຈຸດສິ້ນສຸດຄຳທາງຂວາ

# lazarusidestrconsts.srkmecselwordleft
source: Select Word Left
lo: ເລືອກຄຳສັບທາງຊ້າຍ

# lazarusidestrconsts.srkmecselwordright
source: Select Word Right
lo: ເລືອກຄຳສັບທາງຂວາ

# lazarusidestrconsts.srkmecsetfreebookmark
source: Set a free Bookmark
lo: ຕັ້ງຄ່າ Bookmark ທີ່ວ່າງ

source: Set bookmark %d
lo: ຕັ້ງຄ່າ bookmark %d

source: Show Abstract Methods
lo: ສະແດງ Abstract Methods

source: Show Code Context
lo: ສະແດງ Code Context

source: show execution point
lo: ສະແດງຈຸດ execution

source: Smart move cursor left (start/end of word)
lo: ຍ້າຍເຄີເຊີອັດສະລິຍະໄປທາງຊ້າຍ (ເລີ່ມຕົ້ນ/ສິ້ນສຸດຂອງຄຳ)

source: Smart move cursor right (start/end of word)
lo: ຍ້າຍເຄີເຊີອັດສະລິຍະໄປທາງຂວາ (ເລີ່ມຕົ້ນ/ສິ້ນສຸດຂອງຄຳ)

source: stop program
lo: ຢຸດໂປຣແກຣມ

source: Play Macro
lo: ຫຼິ້ນ Macro

source: Record Macro
lo: ບັນທຶກ Macro

source: Column Select to wrapped line end
lo: ເລືອກຖັນຈົນສຸດແຖວທີ່ຖືກຕັດ

source: Column Select to wrapped line start
lo: ເລືອກຖັນຈົນຕົ້ນແຖວທີ່ຖືກຕັດ

source: Move cursor to wrapped line end
lo: ຍ້າຍເຄີເຊີໄປສຸດແຖວທີ່ຖືກຕັດ

source: Move cursor to wrapped line start
lo: ຍ້າຍເຄີເຊີໄປຕົ້ນແຖວທີ່ຖືກຕັດ

source: Select to wrapped line end
lo: ເລືອກຈົນສຸດແຖວທີ່ຖືກຕັດ

source: Select to wrapped line start
lo: ເລືອກຈົນຕົ້ນແຖວທີ່ຖືກຕັດ

source: Add Cell
lo: ເພີ່ມ Cell

source: Add Cell (case-sensitive)
lo: ເພີ່ມ Cell (case-sensitive)

source: Add Cell (context-sensitive)
lo: ເພີ່ມ Cell (context-sensitive)

source: Add Cell (context & case-sensitive)
lo: ເພີ່ມ Cell (context & case-sensitive)

# lazarusidestrconsts.srkmecsynpsyncroedcellend
source: Goto last pos in cell
lo: ໄປທີ່ຕຳແໜ່ງສຸດທ້າຍໃນ cell

# lazarusidestrconsts.srkmecsynpsyncroedcellhome
source: Goto first pos in cell
lo: ໄປທີ່ຕຳແໜ່ງທຳອິດໃນ cell

source: Select Cell
lo: ເລືອກ Cell

source: Remove current Cell
lo: ລຶບ Cell ປັດຈຸບັນ

source: Grow cell on the left
lo: ຂະຫຍາຍ cell ໄປທາງຊ້າຍ

source: Grow cell on the right
lo: ຂະຫຍາຍ cell ໄປທາງຂວາ

# lazarusidestrconsts.srkmecsynpsyncroednextcell
source: Next Cell
lo: Cell ຖັດໄປ

# lazarusidestrconsts.srkmecsynpsyncroednextcellsel
source: Next Cell (all selected)
lo: Cell ຖັດໄປ (ເລືອກທັງໝົດ)

# lazarusidestrconsts.srkmecsynpsyncroednextfirstcell
source: Next Cell (firsts only)
lo: Cell ຖັດໄປ (ອັນທຳອິດເທົ່ານັ້ນ)

# lazarusidestrconsts.srkmecsynpsyncroednextfirstcellsel
source: Next Cell (all selected / firsts only)
lo: Cell ຖັດໄປ (ເລືອກທັງໝົດ / ອັນທຳອິດເທົ່ານັ້ນ)

# lazarusidestrconsts.srkmecsynpsyncroedprevcell
source: Previous Cell
lo: Cell ກ່ອນໜ້າ

# lazarusidestrconsts.srkmecsynpsyncroedprevcellsel
source: Previous Cell (all selected)
lo: Cell ກ່ອນໜ້າ (ເລືອກທັງໝົດ)

# lazarusidestrconsts.srkmecsynpsyncroedprevfirstcell
source: Previous Cell (firsts only)
lo: Cell ກ່ອນໜ້າ (ອັນທຳອິດເທົ່ານັ້ນ)

# lazarusidestrconsts.srkmecsynpsyncroedprevfirstcellsel
source: Previous Cell (all selected / firsts only)
lo: Cell ກ່ອນໜ້າ (ເລືອກທັງໝົດ / ອັນທຳອິດເທົ່ານັ້ນ)

source: Shrink cell on the left
lo: ຫຍໍ້ cell ທາງຊ້າຍ

source: Shrink cell on the right
lo: ຫຍໍ້ cell ທາງຂວາ

source: Start Syncro edit
lo: ເລີ່ມ Syncro edit

source: Start Syncro edit (case-sensitive)
lo: ເລີ່ມ Syncro edit (case-sensitive)

source: Start Syncro edit (context-sensitive)
lo: ເລີ່ມ Syncro edit (context-sensitive)

source: Start Syncro edit (context & case-sensitive)
lo: ເລີ່ມ Syncro edit (context & case-sensitive)

# lazarusidestrconsts.srkmecsynptmpledcellend
source: Goto last pos in cell
lo: ໄປທີ່ຕຳແໜ່ງສຸດທ້າຍໃນ cell

# lazarusidestrconsts.srkmecsynptmpledcellhome
source: Goto first pos in cell
lo: ໄປທີ່ຕຳແໜ່ງທຳອິດໃນ cell

source: Select cell
lo: ເລືອກ cell

source: Finish
lo: ສຳເລັດ

# lazarusidestrconsts.srkmecsynptmplednextcell
source: Next Cell
lo: Cell ຖັດໄປ

source: Next Cell (rotate)
lo: Cell ຖັດໄປ (rotate)

# lazarusidestrconsts.srkmecsynptmplednextcellsel
source: Next Cell (all selected)
lo: Cell ຖັດໄປ (ເລືອກທັງໝົດ)

source: Next Cell (rotate / all selected)
lo: Cell ຖັດໄປ (rotate / ເລືອກທັງໝົດ)

# lazarusidestrconsts.srkmecsynptmplednextfirstcell
source: Next Cell (firsts only)
lo: Cell ຖັດໄປ (ອັນທຳອິດເທົ່ານັ້ນ)

source: Next Cell (rotate / firsts only)
lo: Cell ຖັດໄປ (rotate / ອັນທຳອິດເທົ່ານັ້ນ)

# lazarusidestrconsts.srkmecsynptmplednextfirstcellsel
source: Next Cell (all selected / firsts only)
lo: Cell ຖັດໄປ (ເລືອກທັງໝົດ / ອັນທຳອິດເທົ່ານັ້ນ)

source: Next Cell (rotate / all selected / firsts only)
lo: Cell ຖັດໄປ (rotate / ເລືອກທັງໝົດ / ອັນທຳອິດເທົ່ານັ້ນ)

# lazarusidestrconsts.srkmecsynptmpledprevcell
source: Previous Cell
lo: Cell ກ່ອນໜ້າ

# lazarusidestrconsts.srkmecsynptmpledprevcellsel
source: Previous Cell (all selected)
lo: Cell ກ່ອນໜ້າ (ເລືອກທັງໝົດ)

# lazarusidestrconsts.srkmecsynptmpledprevfirstcell
source: Previous Cell (firsts only)
lo: Cell ກ່ອນໜ້າ (ອັນທຳອິດເທົ່ານັ້ນ)

# lazarusidestrconsts.srkmecsynptmpledprevfirstcellsel
source: Previous Cell (all selected / firsts only)
lo: Cell ກ່ອນໜ້າ (ເລືອກທັງໝົດ / ອັນທຳອິດເທົ່ານັ້ນ)

source: Syntax Check
lo: ກວດສອບ Syntax

source: toggle breakpoint
lo: ເປີດ/ປິດ breakpoint

source: enable/disable breakpoint
lo: ເປີດໃຊ້/ປິດໃຊ້ breakpoint

source: View code browser
lo: ເບິ່ງ code browser

source: View Code Explorer
lo: ເບິ່ງ Code Explorer

source: View component palette
lo: ເບິ່ງ component palette

source: Switch between form and unit
lo: ສະລັບລະຫວ່າງ form ແລະ unit

source: View Documentation Editor
lo: ເບິ່ງ Documentation Editor

# lazarusidestrconsts.srkmectoggleidespeedbtns
source: View IDE speed buttons
lo: ເບິ່ງປຸ່ມລັດ IDE

source: Toggle bookmark %d
lo: ເປີດ/ປິດ bookmark %d

source: Toggle Current-Word highlight
lo: ເປີດ/ປິດ ໄຮໄລ້ຄຳປັດຈຸບັນ

# lazarusidestrconsts.srkmectogglememviewer
source: View Memory Viewer
lo: ເບິ່ງ Memory Viewer

source: View messages
lo: ເບິ່ງຂໍ້ຄວາມ

source: Toggle Mode
lo: ເປີດ/ປິດ ໂໝດ

source: View Object Inspector
lo: ເບິ່ງ Object Inspector

source: View restriction browser
lo: ເບິ່ງ restriction browser

source: View Search Results
lo: ເບິ່ງຜົນການຄົ້ນຫາ

source: View Source Editor
lo: ເບິ່ງຕົວແກ້ໄຂຊອດໂຄ້ດ

# lazarusidestrconsts.srkmecunfoldall
source: Unfold all
lo: ຄາຍອອກທັງໝົດ

source: Unfold at Cursor
lo: ຄາຍອອກບ່ອນເຄີເຊີ

source: unknown editor command
lo: ຄຳສັ່ງຕົວແກ້ໄຂທີ່ບໍ່ຮູ້ຈັກ

source: Unused Units ...
lo: Units ທີ່ບໍ່ໄດ້ໃຊ້ ...

source: Move cursor up
lo: ຍ້າຍເຄີເຊີຂຶ້ນ

source: View anchor editor
lo: ເບິ່ງ anchor editor

source: View components
lo: ເບິ່ງ components

source: View editor macros
lo: ເບິ່ງ editor macros

source: View forms
lo: ເບິ່ງ forms

source: View Tab Order
lo: ເບິ່ງ Tab Order

source: View unit dependencies
lo: ເບິ່ງການເພິ່ງພາຂອງ unit

source: View unit information
lo: ເບິ່ງຂໍ້ມູນ unit

source: View units
lo: ເບິ່ງ units

source: Word Completion
lo: ການເຕີມເຕັມຄຳສັບ

source: Move cursor word-end left
lo: ຍ້າຍເຄີເຊີໄປຈຸດສິ້ນສຸດຄຳທາງຊ້າຍ

source: Move cursor word-end right
lo: ຍ້າຍເຄີເຊີໄປຈຸດສິ້ນສຸດຄຳທາງຂວາ

source: Move cursor word left
lo: ຍ້າຍເຄີເຊີໄປຄຳທາງຊ້າຍ

source: Move cursor word right
lo: ຍ້າຍເຄີເຊີໄປຄຳທາງຂວາ

source: Zoom in
lo: ຂະຫຍາຍເຂົ້າ

source: Zoom out
lo: ຫຍໍ້ອອກ

source: Edit keys of command
lo: ແກ້ໄຂປຸ່ມຂອງຄຳສັ່ງ

source: Continue with next mouse up action
lo: ດຳເນີນການຕໍ່ກັບການກະທຳປ່ອຍເມົາສ໌ຖັດໄປ

source: Fold comments
lo: ພັບຄຳອະທິບາຍ (comments)

source: Fold comments in selection
lo: ພັບຄຳອະທິບາຍໃນສ່ວນທີ່ເລືອກ

source: Fold inactive Ifdef
lo: ພັບ Ifdef ທີ່ບໍ່ໄດ້ເຮັດວຽກ

source: Fold inactive Ifdef (exclude mixed state)
lo: ພັບ Ifdef ທີ່ບໍ່ໄດ້ເຮັດວຽກ (ຍົກເວັ້ນສະຖານະປະສົມ)

source: Fold inactive Ifdef in selection
lo: ພັບ Ifdef ທີ່ບໍ່ໄດ້ເຮັດວຽກໃນສ່ວນທີ່ເລືອກ

source: Fold inactive Ifdef in selection (exclude mixed state)
lo: ພັບ Ifdef ທີ່ບໍ່ໄດ້ເຮັດວຽກໃນສ່ວນທີ່ເລືອກ (ຍົກເວັ້ນສະຖານະປະສົມ)

source: Hide comments
lo: ເຊື່ອງຄຳອະທິບາຍ

source: Hide comments in selection
lo: ເຊື່ອງຄຳອະທິບາຍໃນສ່ວນທີ່ເລືອກ

source: Match action button of mouse down
lo: ຈັບຄູ່ປຸ່ມການກະທຳຂອງການກົດເມົາສ໌

source: Match action line of mouse down
lo: ຈັບຄູ່ແຖວການກະທຳຂອງການກົດເມົາສ໌

source: Match action modifiers of mouse down
lo: ຈັບຄູ່ຕົວດັດແປງການກະທຳຂອງການກົດເມົາສ໌

source: Match action pos of mouse down
lo: ຈັບຄູ່ຕຳແໜ່ງການກະທຳຂອງການກົດເມົາສ໌

source: Search all action of mouse down
lo: ຄົ້ນຫາການກະທຳທັງໝົດຂອງການກົດເມົາສ໌

source: Unfold active Ifdef
lo: ຄາຍ Ifdef ທີ່ເຮັດວຽກຢູ່ອອກ

source: Unfold active Ifdef in selection
lo: ຄາຍ Ifdef ທີ່ເຮັດວຽກຢູ່ອອກໃນສ່ວນທີ່ເລືອກ

# lazarusidestrconsts.synfunfoldall
source: Unfold all
lo: ຄາຍອອກທັງໝົດ

source: Unfold all Ifdef
lo: ຄາຍ Ifdef ທັງໝົດອອກ

source: Unfold all Ifdef in selection
lo: ຄາຍ Ifdef ທັງໝົດອອກໃນສ່ວນທີ່ເລືອກ

source: Unfold all in selection
lo: ຄາຍທັງໝົດອອກໃນສ່ວນທີ່ເລືອກ

source: Unfold comments
lo: ຄາຍຄຳອະທິບາຍອອກ

source: Unfold comments in selection
lo: ຄາຍຄຳອະທິບາຍອອກໃນສ່ວນທີ່ເລືອກ

source: Unfold inactive Ifdef
lo: ຄາຍ Ifdef ທີ່ບໍ່ໄດ້ເຮັດວຽກອອກ

source: Unfold inactive Ifdef in selection
lo: ຄາຍ Ifdef ທີ່ບໍ່ໄດ້ເຮັດວຽກອອກໃນສ່ວນທີ່ເລືອກ

source: File is readonly
lo: ໄຟລ໌ເປັນແບບອ່ານຢ່າງດຽວ

source: The file "
lo: ໄຟລ໌ "

source: " is not writable.
lo: " ບໍ່ສາມາດຂຽນໄດ້.

source: Locked
lo: ຖືກລັອກ

source: Recording
lo: ກຳລັງບັນທຶກ

source: Rec-pause
lo: ຢຸດບັນທຶກຊົ່ວຄາວ

source: Add &Watch At Cursor
lo: ເພີ່ມ &Watch ຢູ່ບ່ອນເຄີເຊີ

source: Add Watch&Point At Cursor
lo: ເພີ່ມ Watch&Point ຢູ່ບ່ອນເຄີເຊີ

source: Close All &Other Pages
lo: ປິດໜ້າ&ອື່ນໆທັງໝົດ

source: Close All Other Pages
lo: ປິດໜ້າອື່ນໆທັງໝົດ

source: Close Pages on the &Right
lo: ປິດໜ້າທາງ&ຂວາ

source: Close Pages on the Right
lo: ປິດໜ້າທາງຂວາ

source: &Close Page
lo: &ປິດໜ້າ

source: Copy Filename
lo: ສຳເນົາຊື່ໄຟລ໌

source: Clone to New Window
lo: ໂຄລນໄປໜ້າຕ່າງໃໝ່

source: Clone to Other Window
lo: ໂຄລນໄປໜ້າຕ່າງອື່ນ

# lazarusidestrconsts.uemcopytootherwindownew
source: New Window
lo: ໜ້າຕ່າງໃໝ່

source: Encoding
lo: ການເຂົ້າລະຫັດ (Encoding)

source: &Evaluate/Modify ...
lo: &ປະເມີນ/ແກ້ໄຂ ...

source: &Find Declaration
lo: &ຄົ້ນຫາການປະກາດ

source: Find in other Window
lo: ຄົ້ນຫາໃນໜ້າຕ່າງອື່ນ

source: &Goto Bookmark
lo: &ໄປທີ່ Bookmark

source: Goto Bookmark ...
lo: ໄປທີ່ Bookmark ...

source: Highlighter
lo: ຕົວໄຮໄລ້ (Highlighter)

# lazarusidestrconsts.ueminspect
source: &Inspect ...
lo: &ກວດສອບ ...

# lazarusidestrconsts.ueminvertassignment
source: Invert Assignment
lo: ກັບດ້ານການກຳນົດຄ່າ

source: Line Ending
lo: ການສິ້ນສຸດແຖວ

source: &Lock Page
lo: &ລັອກໜ້າ

source: Move Page Left
lo: ຍ້າຍໜ້າໄປທາງຊ້າຍ

source: Move Page Leftmost
lo: ຍ້າຍໜ້າໄປຊ້າຍສຸດ

source: Move Page Right
lo: ຍ້າຍໜ້າໄປທາງຂວາ

source: Move Page Rightmost
lo: ຍ້າຍໜ້າໄປຂວາສຸດ

source: Move to New Window
lo: ຍ້າຍໄປໜ້າຕ່າງໃໝ່

source: Move to Other Window
lo: ຍ້າຍໄປໜ້າຕ່າງອື່ນ

# lazarusidestrconsts.uemmovetootherwindownew
source: New Window
lo: ໜ້າຕ່າງໃໝ່

source: Goto Next Bookmark
lo: ໄປທີ່ Bookmark ຖັດໄປ

source: Modified
lo: ຖືກແກ້ໄຂ

source: &Open File at Cursor
lo: &ເປີດໄຟລ໌ຢູ່ບ່ອນເຄີເຊີ

source: Goto Previous Bookmark
lo: ໄປທີ່ Bookmark ກ່ອນໜ້າ

source: Procedure Jump
lo: ໄປທີ່ Procedure

# lazarusidestrconsts.uemreadonly
source: Read Only
lo: ອ່ານຢ່າງດຽວ

source: Show Line Numbers
lo: ສະແດງໝາຍເລກແຖວ

source: &Toggle Bookmark
lo: &ເປີດ/ປິດ Bookmark

source: Toggle Bookmark &%s: %s
lo: ເປີດ/ປິດ Bookmark &%s: %s

source: Toggle Bookmark &%s
lo: ເປີດ/ປິດ Bookmark &%s

source: Toggle Bookmark ...
lo: ເປີດ/ປິດ Bookmark ...

source: Toggle &Breakpoint
lo: ເປີດ/ປິດ &Breakpoint

# lazarusidestrconsts.uemviewcallstack
source: View Call Stack
lo: ເບິ່ງ Call Stack

source: Not implemented yet
lo: ຍັງບໍ່ທັນໄດ້ implementation

source: Readonly
lo: ອ່ານຢ່າງດຽວ

source: Options for Package graph
lo: ຕົວເລືອກສຳລັບກຣາບ Package

source: Options for Unit graph
lo: ຕົວເລືອກສຳລັບກຣາບ Unit

source: Version Info
lo: ຂໍ້ມູນເວີຊັນ
