Repository: fpc/Lazarus
Catalog: languages/lazaruside.*.po
Languages: lo

source: Guess Misplaced IFDEF/ENDIF
lo: ຄາດເດົາ IFDEF/ENDIF ທີ່ວາງຜິດບ່ອນ

source: Guess Unclosed Block
lo: ຄາດເດົາບຣັອກທີ່ບໍ່ໄດ້ປິດ

source: &Help
lo: &ຄວາມຊ່ວຍເຫຼືອ

source: Incremental Find
lo: ການຄົ້ນຫາແບບເພີ່ມຂຶ້ນ (Incremental Find)

source: Indent Selection
lo: ຫຍໍ້ໜ້າສ່ວນທີ່ເລືອກ

source: ChangeLog Entry
lo: ລາຍການ ChangeLog

source: Insert from Character Map ...
lo: ແຊກຈາກແຜນຜັງຕົວອັກສອນ...

source: Insert CVS Keyword
lo: ແຊກຄຳສັ່ງ CVS

source: Current Date and Time
lo: ວັນທີ ແລະ ເວລາ ປັດຈຸບັນ

source: Insert Full Filename ...
lo: ແຊກຊື່ໄຟລ໌ເຕັມ...

# lazarusidestrconsts.lismenuinsertgeneral
source: Insert General
lo: ແຊກທົ່ວໄປ

source: GPL Notice
lo: ແຈ້ງການ GPL

source: GPL Notice (translated)
lo: ແຈ້ງການ GPL (ແປແລ້ວ)

source: LGPL Notice
lo: ແຈ້ງການ LGPL

source: LGPL Notice (translated)
lo: ແຈ້ງການ LGPL (ແປແລ້ວ)

source: MIT Notice
lo: ແຈ້ງການ MIT

source: MIT Notice (translated)
lo: ແຈ້ງການ MIT (ແປແລ້ວ)

source: Modified LGPL Notice
lo: ແຈ້ງການ Modified LGPL

source: Modified LGPL Notice (translated)
lo: ແຈ້ງການ Modified LGPL (ແປແລ້ວ)

source: Current Username
lo: ຊື່ຜູ້ໃຊ້ປັດຈຸບັນ

# lazarusidestrconsts.lismenuinspect
source: &Inspect ...
lo: &ກວດສອບ...

# lazarusidestrconsts.lismenujumpback
source: Jump Back
lo: ຂ້າມກັບຄືນ

# lazarusidestrconsts.lismenujumpforward
source: Jump Forward
lo: ຂ້າມໄປໜ້າ

source: Jump to
lo: ຂ້າມໄປທີ່

source: Jump to Implementation
lo: ຂ້າມໄປທີ່ Implementation

source: Jump to Implementation uses
lo: ຂ້າມໄປທີ່ Implementation uses

source: Jump to Initialization
lo: ຂ້າມໄປທີ່ Initialization

source: Jump to Interface
lo: ຂ້າມໄປທີ່ Interface

source: Jump to Interface uses
lo: ຂ້າມໄປທີ່ Interface uses

source: Jump to Next Bookmark
lo: ຂ້າມໄປທີ່ Bookmark ຕໍ່ໄປ

source: Jump to Next Error
lo: ຂ້າມໄປທີ່ ຂໍ້ຜິດພາດ ຕໍ່ໄປ

source: Jump to Previous Bookmark
lo: ຂ້າມໄປທີ່ Bookmark ກ່ອນໜ້າ

source: Jump to Previous Error
lo: ຂ້າມໄປທີ່ ຂໍ້ຜິດພາດ ກ່ອນໜ້າ

source: Jump to Procedure begin
lo: ຂ້າມໄປທີ່ Procedure begin

source: Jump to Procedure header
lo: ຂ້າມໄປທີ່ Procedure header

source: Lowercase Selection
lo: ເຮັດເປັນຕົວພິມນ້ອຍສ່ວນທີ່ເລືອກ

# lazarusidestrconsts.lismenumacrolistview
source: Editor Macros
lo: ແມັກໂຄຣຕົວແກ້ໄຂ

source: Make Resource String ...
lo: ສ້າງ Resource String...

# lazarusidestrconsts.lismenunewcomponent
source: New Component
lo: ອົງປະກອບໃໝ່

source: New %s
lo: %s ໃໝ່

source: New Form
lo: ຟອມໃໝ່

source: New ...
lo: ໃໝ່...

source: New Package ...
lo: ແພັກເກັດໃໝ່...

source: New Project ...
lo: ໂຄງການໃໝ່...

source: New Project from File ...
lo: ໂຄງການໃໝ່ຈາກໄຟລ໌...

# lazarusidestrconsts.lismenunewunit
source: New Unit
lo: ຢູນິດໃໝ່

source: Online Help
lo: ຄວາມຊ່ວຍເຫຼືອອອນໄລນ໌

source: &Open ...
lo: &ເປີດ...

source: Open Filename at Cursor
lo: ເປີດຊື່ໄຟລ໌ທີ່ຕົວກະພິບ

source: Open Folder ...
lo: ເປີດໂຟນເດີ...

source: Open Loaded Package ...
lo: ເປີດແພັກເກັດທີ່ໂຫຼດແລ້ວ...

source: Open Package File (.lpk) ...
lo: ເປີດໄຟລ໌ແພັກເກັດ (.lpk)...

source: Open Package of Current Unit
lo: ເປີດແພັກເກັດຂອງຢູນິດປັດຈຸບັນ

source: Open Project ...
lo: ເປີດໂຄງການ...

source: Open &Recent
lo: ເປີດ &ລາຍການຫຼ້າສຸດ

source: Open Recent Package
lo: ເປີດແພັກເກັດຫຼ້າສຸດ

# lazarusidestrconsts.lismenuopenrecentproject
source: Open Recent Project
lo: ເປີດໂຄງການຫຼ້າສຸດ

source: Open Unit ...
lo: ເປີດຢູນິດ...

source: Pa&ckage
lo: ແພັກ&ເກັດ

source: Package Graph
lo: ກຣາບແພັກເກັດ

source: Package Links ...
lo: ລິ້ງແພັກເກັດ...

# lazarusidestrconsts.lismenupastefromclipboard
source: Paste from clipboard
lo: ວາງຈາກ clipboard

source: New package component
lo: ອົງປະກອບແພັກເກັດໃໝ່

# lazarusidestrconsts.lismenuprocedurelist
source: Procedure List ...
lo: ລາຍຊື່ Procedure...

source: &Project
lo: &ໂຄງການ

source: Project Inspector
lo: ຜູ້ກວດສອບໂຄງການ

source: Project Options ...
lo: ຕົວເລືອກໂຄງການ...

# lazarusidestrconsts.lismenuprojectrun
source: &Run
lo: &ແລ່ນ (Run)

source: Publish Project ...
lo: ເຜີຍແຜ່ໂຄງການ...

source: Quick Compile
lo: ຄອມໄພລ໌ດ່ວນ

source: Quick Syntax Check
lo: ກວດສອບ Syntax ດ່ວນ

source: Quick syntax check OK
lo: ກວດສອບ syntax ດ່ວນ OK

source: Remove from Project ...
lo: ລຶບອອກຈາກໂຄງການ...

source: Rename Identifier ...
lo: ປ່ຽນຊື່ຕົວລະບຸ...

source: Rename Unit Files to LowerCase ...
lo: ປ່ຽນຊື່ໄຟລ໌ຢູນິດເປັນຕົວພິມນ້ອຍ...

# lazarusidestrconsts.lismenureportingbug
source: Reporting a Bug
lo: ການລາຍງານບັກ (Bug)

source: Resave forms with enabled i18n
lo: ບັນທຶກຟອມຄືນໃໝ່ດ້ວຍການເປີດໃຊ້ i18n

source: Rescan FPC Source Directory
lo: ສະແກນໄດເຣັກທໍຣີຊອດໂຄດ FPC ຄືນໃໝ່

source: Reset Debugger
lo: ຣີເຊັດ Debugger

source: Revert
lo: ຍ້ອນກັບ (Revert)

source: Discard all unsaved changes in "%s"? This action cannot be undone and will affect all editor tabs with the file.
lo: ຍົກເລີກການປ່ຽນແປງທີ່ຍັງບໍ່ໄດ້ບັນທຶກທັງໝົດໃນ "%s" ບໍ່? ການກະທຳນີ້ບໍ່ສາມາດຍົກເລີກໄດ້ ແລະ ຈະສົ່ງຜົນຕໍ່ແຖບຕົວແກ້ໄຂທັງໝົດທີ່ມີໄຟລ໌ນີ້.

# lazarusidestrconsts.lismenurun
source: &Run
lo: &ແລ່ນ (Run)

source: Run File
lo: ແລ່ນໄຟລ໌

source: Run &Parameters ...
lo: ແລ່ນ &Parameters...

# lazarusidestrconsts.lismenuruntocursor
source: Run to Cursor
lo: ແລ່ນໄປຫາຕົວກະພິບ

source: Run with Debugging
lo: ແລ່ນພ້ອມກັບ Debugging

source: Run without Debugging
lo: ແລ່ນໂດຍບໍ່ມີ Debugging

# lazarusidestrconsts.lismenusave
source: &Save
lo: &ບັນທຶກ

source: Save &As ...
lo: ບັນທຶກ&ເປັນ...

source: Save Project
lo: ບັນທຶກໂຄງການ

source: Save Project As ...
lo: ບັນທຶກໂຄງການເປັນ...

source: &Search
lo: &ຄົ້ນຫາ

source: Select
lo: ເລືອກ

# lazarusidestrconsts.lismenuselectall
source: Select All
lo: ເລືອກທັງໝົດ

source: Select Code Block
lo: ເລືອກບຣັອກໂຄ້ດ

source: Select Line
lo: ເລືອກແຖວ

source: Select Paragraph
lo: ເລືອກຫຍໍ້ໜ້າ

source: Select to Brace
lo: ເລືອກໄປຫາວົງເລັບ

source: Select Word
lo: ເລືອກຄຳ

# lazarusidestrconsts.lismenusetfreebookmark
source: Set a Free Bookmark
lo: ຕັ້ງຄ່າ Free Bookmark

source: S&how Execution Point
lo: ສ&ະແດງຈຸດປະຕິບັດການ

source: Context sensitive smart hint
lo: Smart hint ຕາມບໍລິບົດ

source: Sort Selection ...
lo: ຈັດລຽງສ່ວນທີ່ເລືອກ...

source: S&ource
lo: &ຊອດໂຄດ

source: Swap Case in Selection
lo: ສະລັບຕົວພິມໃນສ່ວນທີ່ເລືອກ

source: Tabs to Spaces in Selection
lo: ປ່ຽນ Tabs ເປັນ Spaces ໃນສ່ວນທີ່ເລືອກ

# lazarusidestrconsts.lismenutemplateabout
source: About
lo: ກ່ຽວກັບ

source: Toggle Comment in Selection
lo: ເປີດ/ປິດ ຄອມເມັ້ນໃນສ່ວນທີ່ເລືອກ

source: &Tools
lo: ເ&ຄື່ອງມື

source: Uncomment Selection
lo: ເອົາຄອມເມັ້ນອອກຈາກສ່ວນທີ່ເລືອກ

source: Unindent Selection
lo: ຍ້າຍສ່ວນທີ່ເລືອກອອກນອກ (Unindent)

source: Uppercase Selection
lo: ເຮັດເປັນຕົວພິມໃຫຍ່ສ່ວນທີ່ເລືອກ

# lazarusidestrconsts.lismenuuseunit
source: Add Unit to Uses Section ...
lo: ເພີ່ມຢູນິດໃສ່ສ່ວນ Uses...

source: &View
lo: &ມຸມມອງ

source: Anchor Editor
lo: ຕົວແກ້ໄຂ Anchor

# lazarusidestrconsts.lismenuviewcodebrowser
source: Code Browser
lo: ເບຣົາເຊີໂຄ້ດ

# lazarusidestrconsts.lismenuviewcodeexplorer
source: Code Explorer
lo: ຜູ້ສຳຫຼວດໂຄ້ດ

source: &Components
lo: &ອົງປະກອບ

# lazarusidestrconsts.lismenuviewdebugevents
source: Event Log
lo: ບັນທຶກເຫດການ (Event Log)

source: Debug Output
lo: ຜົນລັບການດີບັກ

source: Forms ...
lo: ຟອມ...

# lazarusidestrconsts.lismenuviewhistory
source: History
lo: ປະຫວັດ

# lazarusidestrconsts.lismenuviewjumphistory
source: Jump History
lo: ປະຫວັດການຂ້າມ

# lazarusidestrconsts.lismenuviewlocalvariables
source: Local Variables
lo: ຕົວປ່ຽນທ້ອງຖິ່ນ (Local Variables)

# lazarusidestrconsts.lismenuviewmessages
source: Messages
lo: ຂໍ້ຄວາມ

source: &View Project Source
lo: &ສະແດງຕົ້ນສະບັບໂຄງການ

# lazarusidestrconsts.lismenuviewpseudoterminal
source: Console In/Output
lo: ຄອນໂຊນ ເຂົ້າ/ອອກ

source: Restriction Browser
lo: ຜູ້ສຳຫຼວດຂໍ້ຈຳກັດ

source: Search Results
lo: ຜົນການຄົ້ນຫາ

# lazarusidestrconsts.lismenuviewsourceeditor
source: Source Editor
lo: ຕົວແກ້ໄຂຊອດໂຄດ

source: Tab Order
lo: ລຳດັບ Tab

source: Toggle Form/Unit View
lo: ສະລັບມຸມມອງ ຟອມ/ຢູນິດ

# lazarusidestrconsts.lismenuviewunitdependencies
source: Unit Dependencies
lo: ຄວາມຂຶ້ນກັບກັນຂອງຢູນິດ

source: Unit Information ...
lo: ຂໍ້ມູນຢູນິດ...

source: Units ...
lo: ຢູນິດ...

source: What Needs Building
lo: ສິ່ງທີ່ຕ້ອງສ້າງ

source: &Window
lo: &ປ່ອງຢ້ຽມ

# lazarusidestrconsts.lismeother
source: Other tabs
lo: ແຖບອື່ນໆ

source: Messages Editor
lo: ຕົວແກ້ໄຂຂໍ້ຄວາມ

source: Messages Window
lo: ປ່ອງຢ້ຽມຂໍ້ຄວາມ

source: Method class not found
lo: ບໍ່ພົບ Method class

source: missing directory "%s"
lo: ບໍ່ພົບໄດເຣັກທໍຣີ "%s"

source: Missing Events
lo: ເຫດການທີ່ຂາດຫາຍໄປ

source: missing executable "%s"
lo: ບໍ່ພົບ executable "%s"

source: Missing identifiers
lo: ຕົວລະບຸທີ່ຂາດຫາຍໄປ

source: Missing Packages
lo: ແພັກເກັດທີ່ຂາດຫາຍໄປ

source: Your choices are:
lo: ທາງເລືອກຂອງທ່ານແມ່ນ:

source: Comment Out
lo: ຄອມເມັ້ນອອກ

source: For Delphi only
lo: ສຳລັບ Delphi ເທົ່ານັ້ນ

source: 1) Comment out the selected units.
lo: 1) ຄອມເມັ້ນຢູນິດທີ່ເລືອກອອກ.

source: 1) Use the units only for Delphi.
lo: 1) ໃຊ້ຢູນິດສະເພາະສຳລັບ Delphi.

source: 2) Search for units. Found paths are added to project settings.
lo: 2) ຄົ້ນຫາຢູນິດ. paths ທີ່ພົບຈະຖືກເພີ່ມໃສ່ການຕັ້ງຄ່າໂຄງການ.

source: 3) Leave these units in uses sections as they are.
lo: 3) ປ່ອຍຢູນິດເຫຼົ່ານີ້ໄວ້ໃນສ່ວນ uses ຕາມທີ່ເປັນຢູ່.

source: Search Unit Path
lo: ຄົ້ນຫາ Unit Path

# lazarusidestrconsts.lismissingunitsskip
source: Skip
lo: ຂ້າມ

source: <description> Copyright (c) <year> <copyright holders> Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
lo: <description> ລິຂະສິດ (c) <ປີ> <ຜູ້ຖືລິຂະສິດ> ອະນຸຍາດໃຫ້ບຸກຄົນໃດກໍຕາມທີ່ໄດ້ຮັບສຳເນົາຂອງຊອບແວນີ້ ແລະ ໄຟລ໌ເອກະສານທີ່ກ່ຽວຂ້ອງ ("ຊອບແວ"), ດຳເນີນການກັບຊອບແວໂດຍບໍ່ມີຂໍ້ຈຳກັດ, ລວມທັງສິດໃນການໃຊ້, ສຳເນົາ, ແກ້ໄຂ, ລວມເຂົ້າກັນ, ເຜີຍແຜ່, ແຈກຢາຍ, ອະນຸຍາດຊ່ວງ ແລະ/ຫຼື ຂາຍສຳເນົາຂອງຊອບແວ, ແລະ ອະນຸຍາດໃຫ້ບຸກຄົນທີ່ໄດ້ຮັບຊອບແວນີ້ດຳເນີນການດັ່ງກ່າວ, ພາຍໃຕ້ເງື່ອນໄຂດັ່ງຕໍ່ໄປນີ້: ແຈ້ງການລິຂະສິດຂ້າງເທິງ ແລະ ແຈ້ງການການອະນຸຍາດນີ້ຈະຕ້ອງລວມຢູ່ໃນທຸກສຳເນົາ ຫຼື ບາງສ່ວນຂອງຊອບແວ. ຊອບແວຖືກສະໜອງໃຫ້ "ຕາມສະພາບ", ໂດຍບໍ່ມີການຮັບປະກັນໃດໆ, ບໍ່ວ່າຈະເປັນການສະແດງອອກ ຫຼື ໂດຍທາງອ້ອມ, ລວມທັງແຕ່ບໍ່ຈຳກັດພຽງແຕ່ການຮັບປະກັນຄວາມສາມາດໃນການຂາຍ, ຄວາມເໝາະສົມສຳລັບຈຸດປະສົງສະເພາະ ແລະ ການບໍ່ລະເມີດລິຂະສິດ. ຜູ້ຂຽນ ຫຼື ຜູ້ຖືລິຂະສິດຈະບໍ່ຮັບຜິດຊອບຕໍ່ການຮຽກຮ້ອງ, ຄວາມເສຍຫາຍ ຫຼື ຄວາມຮັບຜິດຊອບອື່ນໆ, ບໍ່ວ່າຈະໃນການກະທຳຂອງສັນຍາ, ການລະເມີດ ຫຼື ອື່ນໆ, ທີ່ເກີດຂຶ້ນຈາກ, ອອກຈາກ ຫຼື ກ່ຽວຂ້ອງກັບຊອບແວ ຫຼື ການນຳໃຊ້ ຫຼື ການຈັດການອື່ນໆໃນຊອບແວ.

source: Additions and Overrides
lo: ການເພີ່ມເຕີມ ແລະ ການທັບຊ້ອນ

source: Adds custom options:
lo: ເພີ່ມຕົວເລືອກທີ່ກຳນົດເອງ:

source: Append arbitrary fpc options, e.g. -O1 -ghtl -dFlag
lo: ຕື່ມຕົວເລືອກ fpc ຕາມໃຈ, ເຊັ່ນ: -O1 -ghtl -dFlag

source: Apply to all packages.
lo: ນຳໃຊ້ກັບທຸກແພັກເກັດ.

source: Apply to all packages and projects.
lo: ນຳໃຊ້ກັບທຸກແພັກເກັດ ແລະ ໂຄງການ.

source: Apply to all packages matching name "%s"
lo: ນຳໃຊ້ກັບທຸກແພັກເກັດທີ່ກົງກັບຊື່ "%s"

source: Apply to project.
lo: ນຳໃຊ້ກັບໂຄງການ.

source: Create a new group of options
lo: ສ້າງກຸ່ມຕົວເລືອກໃໝ່

source: Custom Option
lo: ຕົວເລືອກທີ່ກຳນົດເອງ

source: Delete the selected target or option
lo: ລຶບເປົ້າໝາຍ ຫຼື ຕົວເລືອກທີ່ເລືອກ

source: Does not add custom options:
lo: ບໍ່ເພີ່ມຕົວເລືອກທີ່ກຳນົດເອງ:

source: Does not have IDE Macro %s:=%s
lo: ບໍ່ມີ IDE Macro %s:=%s

source: Does not override OutDir (-FU)
lo: ບໍ່ທັບຊ້ອນ OutDir (-FU)

source: Exclude all packages matching name "%s"
lo: ຍົກເວັ້ນທຸກແພັກເກັດທີ່ກົງກັບຊື່ "%s"

source: expected ":=" after macro name but found "%s"
lo: ຄາດຫວັງ ":=" ຫຼັງຊື່ macro ແຕ່ພົບ "%s"

source: expected macro name but found "%s"
lo: ຄາດຫວັງຊື່ macro ແຕ່ພົບ "%s"

source: From %s to %s
lo: ຈາກ %s ເຖິງ %s

source: invalid character "%s" at %s
lo: ຕົວອັກສອນບໍ່ຖືກຕ້ອງ "%s" ຢູ່ທີ່ %s

source: invalid character in macro value "%s"
lo: ຕົວອັກສອນບໍ່ຖືກຕ້ອງໃນຄ່າ macro "%s"

source: missing macro name
lo: ຊື່ macro ຂາດຫາຍໄປ

# lazarusidestrconsts.lismmmoveselecteditemdown
source: Move selected item down
lo: ຍ້າຍລາຍການທີ່ເລືອກລົງ

# lazarusidestrconsts.lismmmoveselecteditemup
source: Move selected item up
lo: ຍ້າຍລາຍການທີ່ເລືອກຂຶ້ນ

source: New Target
lo: ເປົ້າໝາຍໃໝ່

source: Override OutDir (-FU): %s
lo: ທັບຊ້ອນ OutDir (-FU): %s

source: Override output directory (-FU)
lo: ທັບຊ້ອນ output directory (-FU)

source: Override output directory -FU of target
lo: ທັບຊ້ອນ output directory -FU ຂອງເປົ້າໝາຍ

source: Redo last undo to this grid
lo: ເຮັດຊ້ຳການຍົກເລີກຫຼ້າສຸດກັບຕາຕະລາງນີ້

source: Set an IDE macro, e.g.: LCLWidgetType:=win32
lo: ຕັ້ງຄ່າ IDE macro, ເຊັ່ນ: LCLWidgetType:=win32

source: Set "%s"
lo: ຕັ້ງຄ່າ "%s"

source: Stored in IDE (environmentoptions.xml)
lo: ຖືກບັນທຶກໃນ IDE (environmentoptions.xml)

source: Stored in project (.lpi)
lo: ຖືກບັນທຶກໃນໂຄງການ (.lpi)

source: Stored in session of project (.lps)
lo: ຖືກບັນທຶກໃນ session ຂອງໂຄງການ (.lps)

source: Targets:
lo: ເປົ້າໝາຍ:

source: Undo last change to this grid
lo: ຍົກເລີກການປ່ຽນແປງຫຼ້າສຸດກັບຕາຕະລາງນີ້

source: Value "%s"
lo: ຄ່າ "%s"

source: (was "%s")
lo: (ເຄີຍເປັນ "%s")

source: WidgetSet change is available only for LCL projects
lo: ການປ່ຽນແປງ WidgetSet ສາມາດໃຊ້ໄດ້ສະເພາະກັບໂຄງການ LCL

source: <description> Copyright (C) <year> <name of author> <contact> This library is free software; you can redistribute it and/or modify it under the terms of the GNU Library General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version with the following modification: As a special exception, the copyright holders of this library give you permission to link this library with independent modules to produce an executable, regardless of the license terms of these independent modules,and to copy and distribute the resulting executable under terms of your choice, provided that you also meet, for each linked independent module, the terms and conditions of the license of that module. An independent module is a module which is not derived from or based on this library. If you modify this library, you may extend this exception to your version of the library, but you are not obligated to do so. If you do not wish to do so, delete this exception statement from your version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Library General Public License for more details. You should have received a copy of the GNU Library General Public License along with this library; if not, write to the Free Software Foundation, Inc., 51 Franklin Street - Fifth Floor, Boston, MA 02110-1335, USA.
lo: <description> ລິຂະສິດ (C) <ປີ> <ຊື່ຜູ້ຂຽນ> <ຕິດຕໍ່> Library ນີ້ແມ່ນຊອບແວເສລີ; ທ່ານສາມາດແຈກຢາຍມັນຄືນ ແລະ/ຫຼື ແກ້ໄຂມັນພາຍໃຕ້ເງື່ອນໄຂຂອງ GNU Library General Public License ຕາມທີ່ເຜີຍແຜ່ໂດຍ Free Software Foundation; ເວີຊັນ 2 ຂອງໃບອະນຸຍາດ, ຫຼື (ຕາມທາງເລືອກຂອງທ່ານ) ເວີຊັນໃດໜຶ່ງຕໍ່ມາ ພ້ອມກັບການແກ້ໄຂດັ່ງຕໍ່ໄປນີ້: ເປັນຂໍ້ຍົກເວັ້ນພິເສດ, ຜູ້ຖືລິຂະສິດຂອງ library ນີ້ອະນຸຍາດໃຫ້ທ່ານເຊື່ອມຕໍ່ library ນີ້ກັບໂມດູນອິດສະຫຼະເພື່ອຜະລິດເປັນ executable, ໂດຍບໍ່ຄຳນຶງເຖິງເງື່ອນໄຂໃບອະນຸຍາດຂອງໂມດູນອິດສະຫຼະເຫຼົ່ານີ້, ແລະ ເພື່ອສຳເນົາ ແລະ ແຈກຢາຍ executable ທີ່ໄດ້ມາພາຍໃຕ້ເງື່ອນໄຂທີ່ທ່ານເລືອກ, ໂດຍມີເງື່ອນໄຂວ່າທ່ານຕ້ອງປະຕິບັດຕາມເງື່ອນໄຂຂອງໃບອະນຸຍາດຂອງໂມດູນນັ້ນສຳລັບແຕ່ລະໂມດູນອິດສະຫຼະທີ່ເຊື່ອມຕໍ່. ໂມດູນອິດສະຫຼະແມ່ນໂມດູນທີ່ບໍ່ໄດ້ມາຈາກ ຫຼື ອີງໃສ່ library ນີ້. ຖ້າທ່ານແກ້ໄຂ library ນີ້, ທ່ານອາດຈະຂະຫຍາຍຂໍ້ຍົກເວັ້ນນີ້ໄປຍັງເວີຊັນຂອງທ່ານຂອງ library, ແຕ່ທ່ານບໍ່ຈຳເປັນຕ້ອງເຮັດແນວນັ້ນ. ຖ້າທ່ານບໍ່ຕ້ອງການເຮັດແນວນັ້ນ, ໃຫ້ລຶບຂໍ້ຄວາມຍົກເວັ້ນນີ້ອອກຈາກເວີຊັນຂອງທ່ານ. ໂປຣແກຣມນີ້ຖືກແຈກຢາຍດ້ວຍຄວາມຫວັງວ່າມັນຈະເປັນປະໂຫຍດ, ແຕ່ບໍ່ມີການຮັບປະກັນໃດໆ; ເຖິງແມ່ນວ່າຈະເປັນການຮັບປະກັນໂດຍທາງອ້ອມຂອງ MERCHANTABILITY ຫຼື FITNESS FOR A PARTICULAR PURPOSE. ເບິ່ງ GNU Library General Public License ສຳລັບລາຍລະອຽດເພີ່ມເຕີມ. ທ່ານຄວນໄດ້ຮັບສຳເນົາຂອງ GNU Library General Public License ພ້ອມກັບ library ນີ້; ຖ້າບໍ່, ໃຫ້ຂຽນຫາ Free Software Foundation, Inc., 51 Franklin Street - Fifth Floor, Boston, MA 02110-1335, USA.

# lazarusidestrconsts.lismore
source: More
lo: ເພີ່ມເຕີມ

# lazarusidestrconsts.lismoresub
source: More
lo: ເພີ່ມເຕີມ

source: Move
lo: ຍ້າຍ

source: Move Down
lo: ຍ້າຍລົງ

source: Move Files
lo: ຍ້າຍໄຟລ໌

source: Move files?
lo: ຍ້າຍໄຟລ໌ບໍ່?

source: Move %s file(s) from %s to the directory%s%s%sof %s?
lo: ຍ້າຍໄຟລ໌ %s ຈາກ %s ໄປຍັງໄດເຣັກທໍຣີ%s%s%sຂອງ %s ບໍ່?

source: Move "%s" one position down
lo: ຍ້າຍ "%s" ລົງໜຶ່ງຕຳແໜ່ງ

source: Move "%s" one position up
lo: ຍ້າຍ "%s" ຂຶ້ນໜຶ່ງຕຳແໜ່ງ

source: Move or Copy files?
lo: ຍ້າຍ ຫຼື ສຳເນົາໄຟລ໌?

source: Move or copy %s file(s) from %s to the directory%s%s%sof %s?
lo: ຍ້າຍ ຫຼື ສຳເນົາໄຟລ໌ %s ຈາກ %s ໄປຍັງໄດເຣັກທໍຣີ%s%s%sຂອງ %s ບໍ່?

source: Move Page
lo: ຍ້າຍໜ້າ

source: Move selected item down (Ctrl+Down)
lo: ຍ້າຍລາຍການທີ່ເລືອກລົງ (Ctrl+Down)

source: Move selected item up (Ctrl+Up)
lo: ຍ້າຍລາຍການທີ່ເລືອກຂຶ້ນ (Ctrl+Up)

source: Move to:
lo: ຍ້າຍໄປທີ່:

source: Move Up
lo: ຍ້າຍຂຶ້ນ

source: Moving these units will break their uses sections. See Messages window for details.
lo: ການຍ້າຍຢູນິດເຫຼົ່ານີ້ຈະເຮັດໃຫ້ສ່ວນ uses ຂອງພວກມັນເສຍຫາຍ. ເບິ່ງປ່ອງຢ້ຽມ Messages ສຳລັບລາຍລະອຽດ.

source: C style: " => \"
lo: ແບບ C: " => \"

source: Pascal style: ' => ''
lo: ແບບ Pascal: ' => ''

source: Paste &options
lo: ວາງ &options

source: &Preview
lo: &ຕົວຢ່າງ

source: Text &after each line
lo: ຂໍ້ຄວາມ &ຫຼັງແຕ່ລະແຖວ

source: Text &before each line
lo: ຂໍ້ຄວາມ &ກ່ອນແຕ່ລະແຖວ

source: &Trim clipboard contents
lo: &ຕັດແຕ່ງເນື້ອຫາ clipboard

source: Message colors
lo: ສີຂໍ້ຄວາມ

source: Multiple directories are separated with semicolons
lo: ຫຼາຍໄດເຣັກທໍຣີຖືກແຍກດ້ວຍ semicolon

source: , multiple packages:
lo: , ຫຼາຍແພັກເກັດ:

source: Save messages to file (*.txt)
lo: ບັນທຶກຂໍ້ຄວາມລົງໄຟລ໌ (*.txt)

# lazarusidestrconsts.lisname
source: Name
lo: ຊື່

source: Name conflict
lo: ຊື່ຂັດແຍ່ງກັນ

source: Name of active build mode
lo: ຊື່ຂອງໂໝດການສ້າງທີ່ໃຊ້ງານຢູ່

source: Name of new procedure
lo: ຊື່ຂອງ procedure ໃໝ່

# lazarusidestrconsts.lisnew
source: New
lo: ໃໝ່

source: New Class
lo: Class ໃໝ່

source: New console application
lo: ແອັບພລິເຄຊັນ console ໃໝ່

source: Create a new editor file.%sChoose a type.
lo: ສ້າງໄຟລ໌ຕົວແກ້ໄຂໃໝ່.%sເລືອກປະເພດ.

source: Create a new empty text file.
lo: ສ້າງໄຟລ໌ຂໍ້ຄວາມເປົ່າໃໝ່.

source: Create a new project.%sChoose a type.
lo: ສ້າງໂຄງການໃໝ່.%sເລືອກປະເພດ.

source: Create a new standard package.%sA package is a collection of units and components.
lo: ສ້າງແພັກເກັດມາດຕະຖານໃໝ່.%sແພັກເກັດແມ່ນຄໍເລັກຊັນຂອງຢູນິດ ແລະ ອົງປະກອບ.

source: Create a new unit with a datamodule.
lo: ສ້າງຢູນິດໃໝ່ພ້ອມກັບ datamodule.

source: Create a new unit with a frame.
lo: ສ້າງຢູນິດໃໝ່ພ້ອມກັບ frame.

source: Create a new unit with a LCL form.
lo: ສ້າງຢູນິດໃໝ່ພ້ອມກັບ LCL form.

source: Inherit from a project form or component
lo: Inherit ຈາກຟອມ ຫຼື ອົງປະກອບຂອງໂຄງການ

source: No item selected
lo: ບໍ່ມີລາຍການຖືກເລືອກ

source: Please select an item first.
lo: ກະລຸນາເລືອກລາຍການກ່ອນ.

source: New encoding:
lo: ການເຂົ້າລະຫັດໃໝ່:

source: Macro %d
lo: ແມັກໂຄຣ %d

source: New Macroname
lo: ຊື່ແມັກໂຄຣໃໝ່

source: New method implementations are inserted between existing methods of this class. Either alphabetically, or as last, or in declaration order.
lo: ການ implementation method ໃໝ່ຈະຖືກແຊກລະຫວ່າງ method ທີ່ມີຢູ່ຂອງ class ນີ້. ອາດຈະຕາມລຳດັບຕົວອັກສອນ, ຫຼື ໄວ້ທ້າຍສຸດ, ຫຼື ຕາມລຳດັບການປະກາດ.

source: New method and member declarations in the class..end sections are inserted alphabetically or added last.
lo: ການປະກາດ method ແລະ member ໃໝ່ໃນສ່ວນ class..end ຈະຖືກແຊກຕາມລຳດັບຕົວອັກສອນ ຫຼື ເພີ່ມໄວ້ທ້າຍສຸດ.

source: New page
lo: ໜ້າໃໝ່

source: (new project)
lo: (ໂຄງການໃໝ່)

source: New recorded macros. Not to be saved
lo: ແມັກໂຄຣທີ່ບັນທຶກໃໝ່. ຈະບໍ່ຖືກບັນທຶກ

source: New units are added to uses sections
lo: ຢູນິດໃໝ່ຖືກເພີ່ມໃສ່ສ່ວນ uses

source: 'Auto save active desktop' option is turned off, you will need to save current desktop manually.
lo: ຕົວເລືອກ 'ບັນທຶກ desktop ທີ່ໃຊ້ງານຢູ່ອັດຕະໂນມັດ' ຖືກປິດ, ເຈົ້າຈະຕ້ອງບັນທຶກ desktop ປັດຈຸບັນດ້ວຍຕົນເອງ.

source: No backup files
lo: ບໍ່ມີໄຟລ໌ສຳຮອງ

source: No profiles are selected to be built.
lo: ບໍ່ມີໂປຣໄຟລ໌ຖືກເລືອກເພື່ອສ້າງ.

source: No change
lo: ບໍ່ມີການປ່ຽນແປງ

source: No code selected
lo: ບໍ່ມີໂຄ້ດຖືກເລືອກ

source: No compiler options inherited.
lo: ບໍ່ມີຕົວເລືອກ compiler ທີ່ inherited.

source: empty Free Pascal compiler prefix.
lo: ຄຳນຳໜ້າ Free Pascal compiler ຫວ່າງເປົ່າ.

source: no hints
lo: ບໍ່ມີ hints

source: No IDE window selected
lo: ບໍ່ມີປ່ອງຢ້ຽມ IDE ຖືກເລືອກ

source: No LFM file
lo: ບໍ່ມີໄຟລ໌ LFM

source: No macro selected
lo: ບໍ່ມີ macro ຖືກເລືອກ

source: (no message selected)
lo: (ບໍ່ມີຂໍ້ຄວາມຖືກເລືອກ)

source: noname
lo: ບໍ່ມີຊື່

source: none, click to choose one
lo: ບໍ່ມີ, ຄິກເພື່ອເລືອກ

source: (None selected)
lo: (ບໍ່ໄດ້ເລືອກ)

source: No new file found
lo: ບໍ່ພົບໄຟລ໌ໃໝ່

source: no node selected
lo: ບໍ່ມີ node ຖືກເລືອກ

source: No Pascal file
lo: ບໍ່ມີໄຟລ໌ Pascal

source: No program file "%s" found.
lo: ບໍ່ພົບໄຟລ໌ໂປຣແກຣມ "%s".

source: No ResourceString Section found
lo: ບໍ່ພົບສ່ວນ ResourceString

source: Normally the filter is a regular expression. In simple syntax a . is a normal character, a * stands for anything, a ? stands for any character, and comma and semicolon separates alternatives. For example: Simple syntax *.pas;*.pp corresponds to ^(.*\.pas|.*\.pp)$
lo: ໂດຍປົກກະຕິ filter ແມ່ນ regular expression. ໃນ syntax ງ່າຍໆ . ແມ່ນຕົວອັກສອນປົກກະຕິ, * ແທນທຸກຢ່າງ, ? ແທນຕົວອັກສອນໃດໜຶ່ງ, ແລະ ຈຸດ ແລະ ຈຸດຈໍາເມັດ ແຍກທາງເລືອກ. ຕົວຢ່າງ: syntax ງ່າຍໆ *.pas;*.pp ກົງກັບ ^(.*\.pas|.*\.pp)$

source: No string constant found
lo: ບໍ່ພົບ string constant

source: Not a designtime package
lo: ບໍ່ແມ່ນ designtime package

source: Not an install package
lo: ບໍ່ແມ່ນ install package

source: Free Pascal compiler not found at the given prefix.
lo: ບໍ່ພົບ Free Pascal compiler ທີ່ prefix ທີ່ໃຫ້ມາ.

# lazarusidestrconsts.lisnote
source: Note
lo: ໝາຍເຫດ

# lazarusidestrconsts.lisnotebooktabposbottom
source: Bottom
lo: ລຸ່ມ

# lazarusidestrconsts.lisnotebooktabposleft
source: Left
lo: ຊ້າຍ

# lazarusidestrconsts.lisnotebooktabposright
source: Right
lo: ຂວາ

# lazarusidestrconsts.lisnotebooktabpostop
source: Top
lo: ເທິງ

source: NOTE: Could not create Define Template for Free Pascal Sources
lo: ໝາຍເຫດ: ບໍ່ສາມາດສ້າງ Define Template ສຳລັບ Free Pascal Sources

source: NOTE: Could not create Define Template for Lazarus Sources
lo: ໝາຍເຫດ: ບໍ່ສາມາດສ້າງ Define Template ສຳລັບ Lazarus Sources

source: no template selected
lo: ບໍ່ມີແມ່ແບບຖືກເລືອກ

source: Nothing to do
lo: ບໍ່ມີຫຍັງເຮັດ

source: not installed
lo: ບໍ່ໄດ້ຕິດຕັ້ງ

source: Not installed packages
lo: ແພັກເກັດທີ່ບໍ່ໄດ້ຕິດຕັ້ງ

source: Not now
lo: ຍັງບໍ່ແມ່ນດຽວນີ້

source: Now loaded:
lo: ໂຫຼດແລ້ວ:

source: Create a new project
lo: ສ້າງໂຄງການໃໝ່

source: Number of files to convert: %s
lo: ຈຳນວນໄຟລ໌ທີ່ຈະແປງ: %s

source: Object Inspector becomes visible when components are selected in designer.
lo: Object Inspector ຈະປາກົດຂຶ້ນເມື່ອອົງປະກອບຖືກເລືອກໃນ designer.

source: Object Pascal - default
lo: Object Pascal - ຄ່າເລີ່ມຕົ້ນ

source: Switch to Object Inspector Favorites tab
lo: ສະລັບໄປແຖບ Favorites ຂອງ Object Inspector

source: of package %s
lo: ຂອງແພັກເກັດ %s
