Repository: fpc/Lazarus
Catalog: languages/lazaruside.*.po
Languages: lo

source: Background 1
lo: ພື້ນຫຼັງ 1

source: Background 2
lo: ພື້ນຫຼັງ 2

source: Overview Gutter
lo: Gutter ພາບລວມ

# lazarusidestrconsts.dlgoverviewgutterpagecolor
source: Page
lo: ໜ້າ

source: Overwrite block
lo: ຂຽນທັບບລັອກ

source: Desktop with the name "%s" was found. Should the old desktop be overwritten?
lo: ພົບເດັສທັອບຊື່ "%s". ຕ້ອງການຂຽນທັບເດັສທັອບເກົ່າບໍ່?

source: Hints for component palette
lo: ຄຳແນະນຳສຳລັບ Component Palette

source: Color otherwise/else as case-label
lo: ໃສ່ສີ otherwise/else ເປັນ case-label

source: Extend of type-highlight in declarations
lo: ຂອບເຂດການໄຮໄລ້ປະເພດໃນການປະກາດ

source: Identifier only
lo: ຕົວລະບຸເທົ່ານັ້ນ

source: All, including symbols
lo: ທັງໝົດ, ລວມທັງສັນຍາລັກ

source: Identifier, built-in and keywords
lo: ຕົວລະບຸ, built-in ແລະ ຄຳສັ່ງສະເພາະ

source: Identifier and built-in (types/values)
lo: ຕົວລະບຸ ແລະ built-in (ປະເພດ/ຄ່າ)

source: Extend of initial-value-highlight in declarations
lo: ຂອບເຂດການໄຮໄລ້ຄ່າເລີ່ມຕົ້ນໃນການປະກາດ

source: Include literals (Number, String) in initial-value-highlight in declarations
lo: ລວມເອົາ literals (ຕົວເລກ, ຂໍ້ຄວາມ) ໃນການໄຮໄລ້ຄ່າເລີ່ມຕົ້ນໃນການປະກາດ

source: Default Pascal extension
lo: ນາມສະກຸນ Pascal ເລີ່ມຕົ້ນ

source: Extended Pascal Highlight Options
lo: ຕົວເລືອກໄຮໄລ້ Pascal ເພີ່ມເຕີມ

source: Highlight flow control statements (break, continue, exit) as keywords
lo: ໄຮໄລ້ຄຳສັ່ງຄວບຄຸມການໄຫຼ (break, continue, exit) ເປັນຄຳສັ່ງສະເພາະ

source: Markup (on caret)
lo: ໝາຍ (ຢູ່ທີ່ເຄີເຊີ)

source: Matching Keywords
lo: ຄຳສັ່ງສະເພາະທີ່ກົງກັນ

source: Outline
lo: ເຄົ້າໂຄງ

source: Pass options to linker with "-k", delimiter is space
lo: ສົ່ງຕົວເລືອກໃຫ້ linker ດ້ວຍ "-k", ຕົວຂັ້ນແມ່ນຍະຫວ່າງ

source: Highlight "String" types as keyword
lo: ໄຮໄລ້ປະເພດ "String" ເປັນຄຳສັ່ງສະເພາະ

# lazarusidestrconsts.dlgpasstringkeywordsoptdefault
source: Default
lo: ເລີ່ມຕົ້ນ

# lazarusidestrconsts.dlgpasstringkeywordsoptnone
source: None
lo: ບໍ່ມີ

source: Only "String"
lo: ສະເພາະ "String"

source: Persistent block
lo: ບລັອກຄົງທີ່

source: Visible caret in unfocused editor
lo: ເຄີເຊີເບິ່ງເຫັນໄດ້ໃນຕົວແກ້ໄຂທີ່ບໍ່ໄດ້ໂຟກັດ

source: Caret in unfocused editor does not blink
lo: ເຄີເຊີໃນຕົວແກ້ໄຂທີ່ບໍ່ໄດ້ໂຟກັດບໍ່ກະພິບ

source: ANSI codepage is UTF-8 (Windows 10 1903+)
lo: ANSI codepage ເປັນ UTF-8 (Windows 10 1903+)

source: Application
lo: ແອັບພລິເຄຊັນ

source: as invoker (asInvoker)
lo: ໃນຖານະຜູ້ຮຽກໃຊ້ (asInvoker)

source: &Clear Icon
lo: &ລຶບໄອຄອນ

source: Create Application Bundle
lo: ສ້າງ Application Bundle

source: Load &Default
lo: ໂຫຼດຄ່າ&ເລີ່ມຕົ້ນ

source: DPI awareness
lo: ການຮອງຮັບ DPI

source: off
lo: ປິດ

source: Vista-8: off, 8.1+: per monitor
lo: Vista-8: ປິດ, 8.1+: ຕໍ່ຈໍພາບ

source: Vista-8: on, 8.1+: per monitor
lo: Vista-8: ເປີດ, 8.1+: ຕໍ່ຈໍພາບ

source: Vista-8: on, 8.1/10+: per monitor/V2
lo: Vista-8: ເປີດ, 8.1/10+: ຕໍ່ຈໍພາບ/V2

source: on
lo: ເປີດ

source: Execution Level
lo: ລະດັບການປະຕິບັດງານ

source: Forms
lo: ຟອມ

source: highest available (highestAvailable)
lo: ສູງສຸດທີ່ມີຢູ່ (highestAvailable)

source: Icon:
lo: ໄອຄອນ:

source: (size: %d:%d, bpp: %d)
lo: (ຂະໜາດ: %d:%d, bpp: %d)

# lazarusidestrconsts.dlgpoicondescnone
source: (none)
lo: (ບໍ່ມີ)

source: @<pointer> returns a typed pointer
lo: @<pointer> ສົ່ງຄືນ typed pointer

source: &Load Icon
lo: &ໂຫຼດໄອຄອນ

source: Long path awareness (Windows 10 1607+)
lo: ຮອງຮັບ path ຍາວ (Windows 10 1607+)

# lazarusidestrconsts.dlgpomisc
source: Miscellaneous
lo: ເບັດຕະເລັດ

source: require administrator (requireAdministrator)
lo: ຕ້ອງການຜູ້ຄວບຄຸມລະບົບ (requireAdministrator)

source: Resources
lo: ຊັບພະຍາກອນ

source: &Save Icon
lo: &ບັນທຶກໄອຄອນ

source: Session
lo: ເຊດຊັນ

source: Title:
lo: ຫົວຂໍ້:

source: UI Access (uiAccess)
lo: ການເຂົ້າເຖິງ UI (uiAccess)

source: Use Application Bundle for running and debugging
lo: ໃຊ້ Application Bundle ສຳລັບການຣັນ ແລະ ດີບັກ

source: Use LCL scaling (Hi-DPI)
lo: ໃຊ້ LCL scaling (Hi-DPI)

source: Use manifest resource (and enable themes)
lo: ໃຊ້ manifest resource (ແລະ ເປີດໃຊ້ themes)

source: Prefer double-click over single-click
lo: ມັກດັບເບິ້ນຄລິກຫຼາຍກວ່າຄລິກດຽວ

source: Priorities
lo: ຄວາມສຳຄັນ

# lazarusidestrconsts.dlgproject
source: Project
lo: ໂປຣເຈັກ

source: Options for Project: %s
lo: ຕົວເລືອກສຳລັບໂປຣເຈັກ: %s

source: Project to Open or Create
lo: ໂປຣເຈັກທີ່ຈະເປີດ ຫຼື ສ້າງ

source: Project Files
lo: ໄຟລ໌ໂປຣເຈັກ

source: &Prompt on replace
lo: &ຖາມກ່ອນແທນທີ່

source: Property completion
lo: ການເຕີມ Property

source: Property Name
lo: ຊື່ Property

source: Open last project and packages at start
lo: ເປີດໂປຣເຈັກ ແລະ ແພັກເກັດຫຼ້າສຸດເມື່ອເລີ່ມຕົ້ນ

source: Show border spacing
lo: ສະແດງໄລຍະຫ່າງຂອບ

source: Show grid
lo: ສະແດງເສັ້ນຕາຕະລາງ

source: Snap to grid
lo: ດູດເຂົ້າຫາເສັ້ນຕາຕະລາງ

source: Really delete desktop "%s"?
lo: ຕ້ອງການລຶບເດັສທັອບ "%s" ແທ້ບໍ່?

source: To file (append)
lo: ໄປຍັງໄຟລ໌ (ຕໍ່ທ້າຍ)

source: From file
lo: ຈາກໄຟລ໌

source: From file (at EOF)
lo: ຈາກໄຟລ໌ (ທີ່ EOF)

source: No redirection
lo: ບໍ່ມີການປ່ຽນທິດທາງ

source: To file (overwrite)
lo: ໄປຍັງໄຟລ໌ (ຂຽນທັບ)

source: Redirect StdErr
lo: ປ່ຽນທິດທາງ StdErr

source: Redirect StdIn
lo: ປ່ຽນທິດທາງ StdIn

source: Current debugger does not support redirection.
lo: Debugger ປັດຈຸບັນບໍ່ຮອງຮັບການປ່ຽນທິດທາງ.

source: Redirect StdOut
lo: ປ່ຽນທິດທາງ StdOut

source: Reference
lo: ການອ້າງອີງ

source: Rename desktop
lo: ປ່ຽນຊື່ເດັສທັອບ

# lazarusidestrconsts.dlgrenameselecteddesktopbtncaption
source: Rename
lo: ປ່ຽນຊື່

source: Rename selected desktop
lo: ປ່ຽນຊື່ເດັສທັອບທີ່ເລືອກ

source: Replace &All
lo: ແທນທີ່&ທັງໝົດ

source: Replace wit&h
lo: ແທນທີ່ດ້ວ&ຍ

source: Report
lo: ລາຍງານ

# lazarusidestrconsts.dlgreset
source: Reset
lo: ຣີເຊັດ

source: Restore active
lo: ກູ້ຄືນ active

source: Restore window layout of active desktop
lo: ກູ້ຄືນເຄົ້າໂຄງໜ້າຕ່າງຂອງເດັສທັອບທີ່ໃຊ້ຢູ່

source: Reset all
lo: ຣີເຊັດທັງໝົດ

source: Guide lines Right,Bottom
lo: ເສັ້ນນຳທາງ ຂວາ,ລຸ່ມ

source: Right click selects
lo: ຄລິກຂວາເພື່ອເລືອກ

source: Right margin
lo: ຂອບຂວາ

source: Working directory
lo: ໄດເຣັກທໍຣີເຮັດວຽກ

source: Select grandchildren
lo: ເລືອກ grandchildren

source: Rubberband Creation
lo: ການສ້າງ Rubberband

# lazarusidestrconsts.dlgruberbandselectioncolor
source: Rubberband Selection
lo: ການເລືອກ Rubberband

source: The running Lazarus instance cannot accept any files. Do you want to open them in a new IDE instance? %s
lo: Lazarus ທີ່ກຳລັງເຮັດວຽກຢູ່ບໍ່ສາມາດຮັບໄຟລ໌ໃດໆໄດ້. ທ່ານຕ້ອງການເປີດພວກມັນໃນໜ້າຕ່າງ IDE ໃໝ່ບໍ່? %s

source: Lazarus instance is running but not responding.
lo: Lazarus ກຳລັງເຮັດວຽກຢູ່ແຕ່ບໍ່ຕອບສະໜອງ.

source: Display (not for win32, e.g. 198.112.45.11:0, x.org:1, hydra:0.1)
lo: ຈໍສະແດງຜົນ (ບໍ່ແມ່ນສຳລັບ win32, ເຊັ່ນ: 198.112.45.11:0, x.org:1, hydra:0.1)

# lazarusidestrconsts.dlgrunoenvironment
source: Environment
lo: ສະພາບແວດລ້ອມ

source: Local
lo: ພາຍໃນເຄື່ອງ

source: System variables
lo: ຕົວປ່ຽນລະບົບ

source: Use display
lo: ໃຊ້ຈໍສະແດງຜົນ

source: Run Parameters
lo: ພາຣາມິເຕີການຣັນ

source: Run uses the debugger (disable for release-mode)
lo: ຣັນໂດຍໃຊ້ debugger (ປິດສຳລັບ release-mode)

source: Save current desktop
lo: ບັນທຶກເດັສທັອບປັດຈຸບັນ

source: Save current desktop as
lo: ບັນທຶກເດັສທັອບປັດຈຸບັນເປັນ

source: Save active desktop as ...
lo: ບັນທຶກເດັສທັອບທີ່ໃຊ້ຢູ່ເປັນ ...

source: Save active desktop as
lo: ບັນທຶກເດັສທັອບທີ່ໃຊ້ຢູ່ເປັນ

source: Saved line
lo: ແຖວທີ່ບັນທຶກແລ້ວ

source: Save editor info for closed files
lo: ບັນທຶກຂໍ້ມູນຕົວແກ້ໄຂສຳລັບໄຟລ໌ທີ່ປິດ

source: The files are available in the "Open Recent" history list.
lo: ໄຟລ໌ຈະມີຢູ່ໃນລາຍການປະຫວັດ "Open Recent".

source: Save editor info only for project files
lo: ບັນທຶກຂໍ້ມູນຕົວແກ້ໄຂສະເພາະໄຟລ໌ໂປຣເຈັກ

source: Only files that belong to this project.
lo: ສະເພາະໄຟລ໌ທີ່ຢູ່ໃນໂປຣເຈັກນີ້.

source: Save in
lo: ບັນທຶກໃນ

source: Force 1024 columns minimum for horizontal scroll range
lo: ບັງຄັບຂອບເຂດສະກໍລແນວນອນຂັ້ນຕ່ຳ 1024 ຖັນ

source: Do not add any permanent space to horizontal scroll range
lo: ບໍ່ຕ້ອງເພີ່ມພື້ນທີ່ຖາວອນໃດໆໃສ່ຂອບເຂດສະກໍລແນວນອນ

source: Always add one page to horizontal scroll range
lo: ເພີ່ມໜຶ່ງໜ້າໃສ່ຂອບເຂດສະກໍລແນວນອນສະເໝີ

source: Scroll by one less
lo: ເລື່ອນລົງໜ້ອຍກວ່າໜຶ່ງ

source: Scrolling
lo: ການເລື່ອນ

# lazarusidestrconsts.dlgscrollhint
source: Show scroll hint
lo: ສະແດງຄຳແນະນຳການເລື່ອນ

source: Scroll past end of file
lo: ເລື່ອນກາຍທ້າຍໄຟລ໌

source: Allow Caret to move past the end of line
lo: ອະນຸຍາດໃຫ້ເຄີເຊີຍ້າຍກາຍທ້າຍແຖວ

source: Search directory "%s" not found.
lo: ບໍ່ພົບໄດເຣັກທໍຣີຄົ້ນຫາ "%s".

source: Search terminated by user.
lo: ການຄົ້ນຫາຖືກຍກເລີກໂດຍຜູ້ໃຊ້.

source: Searching ...
lo: ກຳລັງຄົ້ນຫາ ...

source: Paths
lo: ທີ່ຢູ່ໄຟລ໌ (Paths)

source: Search scope
lo: ຂອບເຂດການຄົ້ນຫາ

source: Select all child controls together with their parent.
lo: ເລືອກຕົວຄວບຄຸມລູກທັງໝົດພ້ອມກັບຕົວແມ່.

source: Do not scroll on Select-All / Paragraph or To-Brace
lo: ຢ່າເລື່ອນເມື່ອເລືອກທັງໝົດ / ຫຍໍ້ໜ້າ ຫຼື ໄປຫາວົງເລັບ

source: &Selected text
lo: &ຂໍ້ຄວາມທີ່ເລືອກ

# lazarusidestrconsts.dlgsetactivedesktopbtncaption
source: Set active
lo: ຕັ້ງເປັນ active

# lazarusidestrconsts.dlgsetactivedesktopbtnhint
source: Set active
lo: ຕັ້ງເປັນ active

source: Set all elements to default
lo: ຕັ້ງທຸກອົງປະກອບເປັນຄ່າເລີ່ມຕົ້ນ

source: Set element to default
lo: ຕັ້ງອົງປະກອບເປັນຄ່າເລີ່ມຕົ້ນ

source: Set property Variable
lo: ຕົວປ່ຽນ Set property

source: The parameter name for the default setter procedure.
lo: ຊື່ພາຣາມິເຕີສຳລັບຂັ້ນຕອນ setter ເລີ່ມຕົ້ນ.

source: is prefix
lo: ແມ່ນ prefix

source: If checked, the "Set property Variable" is a prefix. Otherwise it is a fixed name.
lo: ຖ້າເລືອກ, "ຕົວປ່ຽນ Set property" ຈະເປັນ prefix. ຖ້າບໍ່ດັ່ງນັ້ນມັນຈະເປັນຊື່ຄົງທີ່.

source: use const
lo: ໃຊ້ const

source: If checked, the setter parameter is marked with "const".
lo: ຖ້າເລືອກ, ພາຣາມິເຕີ setter ຈະຖືກໝາຍດ້ວຍ "const".

source: Show all units
lo: ສະແດງ unit ທັງໝົດ

source: Show captions of nonvisual components
lo: ສະແດງຫົວຂໍ້ຂອງ component ທີ່ບໍ່ສະແດງຜົນ

source: Show compiled procedures
lo: ສະແດງ procedure ທີ່ compile ແລ້ວ

# lazarusidestrconsts.dlgshowcompilinglinenumbers
source: Show line numbers
lo: ສະແດງເລກແຖວ

source: Show conditionals
lo: ສະແດງ conditionals

source: Show debug info
lo: ສະແດງຂໍ້ມູນ debug

source: Show designer hints
lo: ສະແດງຄຳແນະນຳ designer

source: Hint shows control's position or size while moving or resizing it.
lo: ຄຳແນະນຳສະແດງຕຳແໜ່ງ ຫຼື ຂະໜາດຂອງຕົວຄວບຄຸມຂະນະທີ່ຍ້າຍ ຫຼື ປັບຂະໜາດ.

source: Show everything
lo: ສະແດງທຸກຢ່າງ

source: Show executable info (Win32 only)
lo: ສະແດງຂໍ້ມູນ executable (Win32 ເທົ່ານັ້ນ)

source: Show file name in caption
lo: ສະແດງຊື່ໄຟລ໌ໃນຫົວຂໍ້

source: Show general info
lo: ສະແດງຂໍ້ມູນທົ່ວໄປ

source: Show gutter hints
lo: ສະແດງຄຳແນະນຳ gutter

# lazarusidestrconsts.dlgshowhint
source: Show hints
lo: ສະແດງຄຳແນະນຳ

source: Showing Windows
lo: ການສະແດງໜ້າຕ່າງ

# lazarusidestrconsts.dlgshowlinenumbers
source: Show line numbers
lo: ສະແດງເລກແຖວ

source: Show Messages Icons
lo: ສະແດງໄອຄອນຂໍ້ຄວາມ

source: Show notes
lo: ສະແດງບັນທຶກ

source: Show tried files
lo: ສະແດງໄຟລ໌ທີ່ລອງແລ້ວ

source: Show used files
lo: ສະແດງໄຟລ໌ທີ່ໃຊ້

source: Show warnings
lo: ສະແດງຄຳເຕືອນ

source: Show single button in TaskBar
lo: ສະແດງປຸ່ມດຽວໃນ TaskBar

source: Skip forward class declarations
lo: ຂ້າມ forward class declaration

source: Slash //
lo: ທັບ //

source: Smart tabs
lo: ແຖບອັດສະລິຍະ

source: Symbol behind (.pp~)
lo: ສັນຍາລັກທາງຫຼັງ (.pp~)

source: Counter (.pp;1)
lo: ຕົວນັບ (.pp;1)

source: Symbol in front (.~pp)
lo: ສັນຍາລັກທາງໜ້າ (.~pp)

source: Snap to Guide Lines
lo: ດູດເຂົ້າຫາເສັ້ນນຳທາງ

source: When a control is close to being aligned with another control, it snaps to the aligned position.
lo: ເມື່ອຕົວຄວບຄຸມຢູ່ໃກ້ກັບການຈັດແຖວຂອງຕົວຄວບຄຸມອື່ນ, ມັນຈະດູດເຂົ້າຫາຕຳແໜ່ງທີ່ຈັດແຖວ.

source: Multiline tabs
lo: ແຖບຫຼາຍແຖວ

# lazarusidestrconsts.dlgspacenotcosmos
source: Space
lo: ຍະຫວ່າງ

source: Hints for main speed buttons (open, save, ...)
lo: ຄຳແນະນຳສຳລັບປຸ່ມດ່ວນຫຼັກ (ເປີດ, ບັນທຶກ, ...)

source: Label in the source are only colored if the colon ":" is placed immediately after the label.
lo: Label ໃນຊອດໂຄ້ດຈະຖືກໃສ່ສີກໍຕໍ່ເມື່ອຈໍ້າສອງເມັດ ":" ຖືກວາງໄວ້ຫຼັງ Label ທັນທີ.

source: "Member" color is applied to any identifier behind a dot ".".
lo: ສີ "Member" ຖືກໃຊ້ກັບຕົວລະບຸໃດໆທີ່ຢູ່ຫຼັງຈໍ້າ ".".

source: Origin
lo: ຈຸດກຳເນີດ

source: Stack size
lo: ຂະໜາດ Stack

source: Stop after number of errors:
lo: ຢຸດຫຼັງຈາກຈຳນວນຂໍ້ຜິດພາດ:

source: Append text to close string
lo: ຕໍ່ຂໍ້ຄວາມເພື່ອປິດ string

source: Prefix string on new line
lo: ນຳໜ້າ string ໃນແຖວໃໝ່

source: Align second line (after first break) with the position of the lowest matching group in the pattern, or the match position of the pattern itself.
lo: ຈັດແຖວທີສອງ (ຫຼັງຈາກການຕັດຄັ້ງທຳອິດ) ໃຫ້ກົງກັບຕຳແໜ່ງຂອງກຸ່ມທີ່ກົງກັນຕ່ຳສຸດໃນ pattern, ຫຼື ຕຳແໜ່ງທີ່ກົງກັນຂອງ pattern ເອງ.

source: Align second line (reg-ex):
lo: ຈັດແຖວທີສອງ (reg-ex):

source: Max indent for second line if based on reg-ex:
lo: ຫຍໍ້ໜ້າສູງສຸດສຳລັບແຖວທີສອງຖ້າອີງໃສ່ reg-ex:

source: Extend strings on linebreak
lo: ຂະຫຍາຍ strings ເມື່ອມີການຕັດແຖວ

source: SubProperties
lo: ຄຸນສົມບັດຍ່ອຍ

source: Syntax options
lo: ຕົວເລືອກ Syntax

source: Tab indents blocks
lo: Tab ຫຍໍ້ໜ້າບລັອກ

source: Show tab numbers in notebook
lo: ສະແດງໝາຍເລກແຖບໃນ notebook

source: Tabs to spaces
lo: Tabs ເປັນຍະຫວ່າງ

# lazarusidestrconsts.dlgtabwidths
source: Tab widths
lo: ຄວາມກວ້າງ Tab

source: Target CPU family
lo: ຕະກູນ CPU ເປົ້າໝາຍ

# lazarusidestrconsts.dlgtargetos
source: Target OS
lo: OS ເປົ້າໝາຍ

source: Target platform
lo: ແພລັດຟອມເປົ້າໝາຍ

source: Target processor
lo: ໂປຣເຊດເຊີເປົ້າໝາຍ

source: Target-specific options
lo: ຕົວເລືອກສະເພາະເປົ້າໝາຍ

source: Directory for building test projects
lo: ໄດເຣັກທໍຣີສຳລັບສ້າງໂປຣເຈັກທົດສອບ

source: Text Style
lo: ຮູບແບບຂໍ້ຄວາມ

# lazarusidestrconsts.dlgtexttofind
source: Search s&tring
lo: ຄົ້ນຫາ&ຂໍ້ຄວາມ

source: The element uses (and edits) the schemes:
lo: ອົງປະກອບໃຊ້ (ແລະ ແກ້ໄຂ) scheme:

# lazarusidestrconsts.dlgtoggledebugdesktopbtncaption
source: Toggle as debug desktop
lo: ສະລັບເປັນ debug desktop

# lazarusidestrconsts.dlgtoggledebugdesktopbtnhint
source: Toggle as debug desktop
lo: ສະລັບເປັນ debug desktop

source: Current Class/Proc Hint
lo: ຄຳແນະນຳ Class/Proc ປັດຈຸບັນ

source: Trim spaces style
lo: ຮູບແບບການຕັດຍະຫວ່າງ

source: Caret or Edit
lo: ເຄີເຊີ ຫຼື ແກ້ໄຂ

source: Line Edited
lo: ແຖວທີ່ຖືກແກ້ໄຂ

source: Leave line
lo: ອອກຈາກແຖວ

source: Position Only
lo: ຕຳແໜ່ງເທົ່ານັ້ນ

source: Trim trailing spaces
lo: ຕັດຍະຫວ່າງທ້າຍແຖວ

source: Undo after save
lo: ຍົກເລີກຫຼັງຈາກບັນທຶກ

source: Undo / Redo
lo: ຍົກເລີກ / ເຮັດຄືນ

source: Undo limit
lo: ຂີດຈຳກັດການຍົກເລີກ

# lazarusidestrconsts.dlgunitdeprefresh
source: Refresh
lo: ຣີເຟຣຊ

source: Unit output directory (-FU):
lo: ໄດເຣັກທໍຣີຜົນລັພ Unit (-FU):

source: Unsaved line
lo: ແຖວທີ່ຍັງບໍ່ໄດ້ບັນທຶກ

source: Code Folding
lo: ການຫຍໍ້ໂຄ້ດ

source: Set Columns/Rows
lo: ຕັ້ງຄ່າ ຖັນ/ແຖວ

source: Set Left/Top
lo: ຕັ້ງຄ່າ ຊ້າຍ/ເທິງ

source: Set Width/Height
lo: ຕັ້ງຄ່າ ກວ້າງ/ສູງ

source: Use additional compiler config file
lo: ໃຊ້ໄຟລ໌ຕັ້ງຄ່າ compiler ເພີ່ມເຕີມ

source: Divider Drawing
lo: ການແຕ້ມເສັ້ນແບ່ງ

source: Use standard compiler config file (fpc.cfg)
lo: ໃຊ້ໄຟລ໌ຕັ້ງຄ່າ compiler ມາດຕະຖານ (fpc.cfg)

source: Use Highlight
lo: ໃຊ້ການໄຮໄລ້

source: Icons in code completion box
lo: ໄອຄອນໃນກ່ອງເຕີມໂຄ້ດ

source: Use launching application
lo: ໃຊ້ແອັບພລິເຄຊັນ launching

source: IME handled by System
lo: IME ຈັດການໂດຍລະບົບ

source: Failed to load user-scheme file %s
lo: ບໍ່ສາມາດໂຫຼດໄຟລ໌ user-scheme %s ໄດ້

source: selected language
lo: ພາສາທີ່ເລືອກ

source: Use syntax highlight
lo: ໃຊ້ syntax highlight

source: Use tab history when closing tabs
lo: ໃຊ້ປະຫວັດແຖບເມື່ອປິດແຖບ

source: Add unit to Uses section
lo: ເພີ່ມ unit ໃສ່ສ່ວນ Uses

# lazarusidestrconsts.dlgvaluecolor
source: Value
lo: ຄ່າ

source: Verbosity during compilation:
lo: ຄວາມລະອຽດລະຫວ່າງການ compile:

source: Visible gutter
lo: Gutter ທີ່ເບິ່ງເຫັນໄດ້

source: Visible right margin
lo: ຂອບຂວາທີ່ເບິ່ງເຫັນໄດ້

source: &Whole words only
lo: &ຄຳເຕັມເທົ່ານັ້ນ

source: Width:
lo: ຄວາມກວ້າງ:

# lazarusidestrconsts.dlgwindow
source: Window
lo: ໜ້າຕ່າງ

source: Windows GUI application
lo: ແອັບພລິເຄຊັນ Windows GUI

source: Exceptions
lo: ຂໍ້ຍົກເວັ້ນ

# lazarusidestrconsts.dlgwordspolicies
source: Words
lo: ຄຳສັບ

# lazarusidestrconsts.dlgwrdpreview
source: Preview
lo: ຕົວຢ່າງ

source: Write FPC logo
lo: ຂຽນໂລໂກ້ FPC

source: (Ignoring project settings below)
lo: (ບໍ່ສົນໃຈການຕັ້ງຄ່າໂປຣເຈັກຂ້າງລຸ່ມ)

source: Store converter config in session
lo: ບັນທຶກການຕັ້ງຄ່າ converter ໃນ session

source: Store display formats config in session
lo: ບັນທຶກການຕັ້ງຄ່າຮູບແບບການສະແດງຜົນໃນ session

source: Store formatter config in session
lo: ບັນທຶກການຕັ້ງຄ່າ formatter ໃນ session

source: Store project debugger configs in session
lo: ບັນທຶກການຕັ້ງຄ່າ debugger ຂອງໂປຣເຈັກໃນ session

source: The "Debugger Backend" selection from the dropdown (list of IDE debugger backends) is always stored in the session. The project specific backends (below) are by default stored in the LPI.
lo: ການເລືອກ "Debugger Backend" ຈາກ dropdown (ລາຍການຂອງ IDE debugger backend) ຈະຖືກບັນທຶກໄວ້ໃນ session ສະເໝີ. backend ສະເພາະຂອງໂປຣເຈັກ (ຂ້າງລຸ່ມ) ໂດຍປົກກະຕິຈະຖືກບັນທຶກໄວ້ໃນ LPI.

source: This only affects the display formats below. The settings which formats to use are always stored in the session.
lo: ອັນນີ້ມີຜົນສະເພາະຮູບແບບການສະແດງຜົນຂ້າງລຸ່ມເທົ່ານັ້ນ. ການຕັ້ງຄ່າວ່າຈະໃຊ້ຮູບແບບໃດຈະຖືກບັນທຶກໄວ້ໃນ session ສະເໝີ.

source: This only affects the list of converters below. The settings which list to use are always stored in the session.
lo: ອັນນີ້ມີຜົນສະເພາະລາຍການ converter ຂ້າງລຸ່ມເທົ່ານັ້ນ. ການຕັ້ງຄ່າວ່າຈະໃຊ້ລາຍການໃດຈະຖືກບັນທຶກໄວ້ໃນ session ສະເໝີ.

source: This only affects the list of formatters below. The settings which list to use are always stored in the session.
lo: ອັນນີ້ມີຜົນສະເພາະລາຍການ formatter ຂ້າງລຸ່ມເທົ່ານັ້ນ. ການຕັ້ງຄ່າວ່າຈະໃຊ້ລາຍການໃດຈະຖືກບັນທຶກໄວ້ໃນ session ສະເໝີ.

source: Use the IDEs-global display formats
lo: ໃຊ້ຮູບແບບການສະແດງຜົນ IDE-Global

source: Use the projects display formats
lo: ໃຊ້ຮູບແບບການສະແດງຜົນຂອງໂປຣເຈັກ

source: Use the IDE-Global list of converters
lo: ໃຊ້ລາຍການ converter ຂອງ IDE-Global

source: Use the IDE-Global list of formatters
lo: ໃຊ້ລາຍການ formatter ຂອງ IDE-Global

source: Use the project list of converters
lo: ໃຊ້ລາຍການ converter ຂອງໂປຣເຈັກ

source: Use the project list of formatters
lo: ໃຊ້ລາຍການ formatter ຂອງໂປຣເຈັກ

source: Using IDE default debugger settings
lo: ກຳລັງໃຊ້ການຕັ້ງຄ່າ debugger ເລີ່ມຕົ້ນຂອງ IDE

source: Using selected IDE debugger settings
lo: ກຳລັງໃຊ້ການຕັ້ງຄ່າ debugger ຂອງ IDE ທີ່ເລືອກ

source: Multiselected components must be of a single form.
lo: ອົງປະກອບທີ່ເລືອກຫຼາຍອັນຕ້ອງມາຈາກຟອມດຽວກັນ.

source: Align ...
lo: ຈັດລຽງ ...

source: Delete Selection
lo: ລຶບສິ່ງທີ່ເລືອກ

source: Mirror Horizontal
lo: ກັບດ້ານແນວນອນ

source: Mirror Vertical
lo: ກັບດ້ານແນວຕັ້ງ

source: Back One
lo: ຖອຍຫຼັງໜຶ່ງ

source: Forward One
lo: ໄປໜ້າໜຶ່ງ

source: Move to Back
lo: ຍ້າຍໄປທາງຫຼັງສຸດ

source: Move to Front
lo: ຍ້າຍໄປທາງໜ້າສຸດ

source: Reset ...
lo: ຣີເຊັດ ...

source: Save Form as XML
lo: ບັນທຶກຟອມເປັນ XML

source: Scale ...
lo: ປັບຂະໜາດ ...

source: Scale
lo: ປັບຂະໜາດ

# lazarusidestrconsts.fdmselectall
source: Select All
lo: ເລືອກທັງໝົດ

source: Size ...
lo: ຂະໜາດ ...

source: Size
lo: ຂະໜາດ

source: Option: Snap to grid
lo: ຕົວເລືອກ: ດູດເຂົ້າຫາເສັ້ນຕາຕະລາງ

source: Option: Snap to guide lines
lo: ຕົວເລືອກ: ດູດເຂົ້າຫາເສັ້ນນຳທາງ

source: On Both Sides
lo: ທັງສອງຂ້າງ

source: Change path
lo: ປ່ຽນທີ່ຢູ່

source: Error: The backend is not configured.
lo: ຂໍ້ຜິດພາດ: Backend ຍັງບໍ່ໄດ້ຖືກຕັ້ງຄ່າ.

source: (The configured backend's package is not installed.)
lo: (ແພັກເກັດຂອງ backend ທີ່ຕັ້ງຄ່າໄວ້ຍັງບໍ່ໄດ້ຕິດຕັ້ງ.)

source: Error: Your current config uses a backend that is not supported on your OS/Arch.
lo: ຂໍ້ຜິດພາດ: ການຕັ້ງຄ່າປັດຈຸບັນຂອງທ່ານໃຊ້ backend ທີ່ບໍ່ຮອງຮັບໃນ OS/Arch ຂອງທ່ານ.

source: Hint: The backend type is OK, but not the recommended type.
lo: ຄຳແນະນຳ: ປະເພດ backend ໂອເຄ, ແຕ່ບໍ່ແມ່ນປະເພດທີ່ແນະນຳ.

source: Create a new recommended backend
lo: ສ້າງ backend ທີ່ແນະນຳໃໝ່

# lazarusidestrconsts.initdlgdebugcurrent
source: Current
lo: ປັດຈຸບັນ

source: The selected backend uses the external executable:
lo: Backend ທີ່ເລືອກໃຊ້ executable ພາຍນອກ:

source: The selected backend requires an external executable: "%s"
lo: Backend ທີ່ເລືອກຕ້ອງການ executable ພາຍນອກ: "%s"

source: Default for your OS/Arch is: "%s".
lo: ຄ່າເລີ່ມຕົ້ນສຳລັບ OS/Arch ຂອງທ່ານແມ່ນ: "%s".

# lazarusidestrconsts.initdlgdebugignore
source: Ignore
lo: ບໍ່ສົນໃຈ

source: Keep backend
lo: ເກັບ backend ໄວ້

# lazarusidestrconsts.initdlgdebugnew
source: New
lo: ໃໝ່

source: Error: External executable is a directory, not a file.
lo: ຂໍ້ຜິດພາດ: Executable ພາຍນອກແມ່ນໄດເຣັກທໍຣີ, ບໍ່ແມ່ນໄຟລ໌.

source: Error: External executable not found.
lo: ຂໍ້ຜິດພາດ: ບໍ່ພົບ executable ພາຍນອກ.

source: Error: External file is not executable.
lo: ຂໍ້ຜິດພາດ: ໄຟລ໌ພາຍນອກບໍ່ສາມາດຣັນໄດ້.

source: Error: No default for external executable found.
lo: ຂໍ້ຜິດພາດ: ບໍ່ພົບຄ່າເລີ່ມຕົ້ນສຳລັບ executable ພາຍນອກ.

source: Error: No external executable specified.
lo: ຂໍ້ຜິດພາດ: ບໍ່ໄດ້ລະບຸ executable ພາຍນອກ.

source: A backend provides OS and architecture specific implementations for the debugger.%0:sDefault for your OS/Arch is: "%1:s".%0:s%0:sOther backends are provided for special tasks (e.g. cross debugging on some platforms) or as generic alternatives.%0:sThe debugger can have different features, depending on the backend.%0:s%0:sSome backends require an external exe (such as gdb or lldb). This exe may be part of your OS (Linux/Mac), or be provided by the Lazarus installer (Windows).%0:s%0:sIf you have just upgraded your installation, you may have to rebuild the IDE before your previously configured backend can be used (if you used a 3rd-party or optional backend). In that case you may choose "Ignore".
lo: Backend ໃຫ້ການຮອງຮັບສະເພາະ OS ແລະ architecture ສຳລັບ debugger.%0:sຄ່າເລີ່ມຕົ້ນສຳລັບ OS/Arch ຂອງທ່ານແມ່ນ: "%1:s".%0:s%0:sBackend ອື່ນໆມີໃຫ້ສຳລັບວຽກງານພິເສດ (ເຊັ່ນ: cross debugging ໃນບາງແພລັດຟອມ) ຫຼື ເປັນທາງເລືອກທົ່ວໄປ.%0:sDebugger ສາມາດມີຄຸນສົມບັດທີ່ແຕກຕ່າງກັນ, ຂຶ້ນກັບ backend.%0:s%0:sບາງ backend ຕ້ອງການ exe ພາຍນອກ (ເຊັ່ນ gdb ຫຼື lldb). exe ນີ້ອາດຈະເປັນສ່ວນໜຶ່ງຂອງ OS ຂອງທ່ານ (Linux/Mac), ຫຼື ຖືກສະໜອງໃຫ້ໂດຍຕົວຕິດຕັ້ງ Lazarus (Windows).%0:s%0:sຖ້າທ່ານຫາກໍ່ອັບເກຣດການຕິດຕັ້ງ, ທ່ານອາດຕ້ອງ rebuild IDE ກ່ອນທີ່ backend ທີ່ຕັ້ງຄ່າໄວ້ກ່ອນໜ້ານີ້ຈະສາມາດໃຊ້ງານໄດ້ (ຖ້າທ່ານໃຊ້ 3rd-party ຫຼື backend ທາງເລືອກ). ໃນກໍລະນີນັ້ນທ່ານສາມາດເລືອກ "ບໍ່ສົນໃຈ" ໄດ້.

source: Select an existing backend
lo: ເລືອກ backend ທີ່ມີຢູ່

source: Note: There are more backend configurations available, but their packages (LPK) are not installed. You may want to rebuild the IDE with the packages installed. After the rebuild, the debugger backend can be changed in the menu: Tools -> Options.
lo: ໝາຍເຫດ: ມີການຕັ້ງຄ່າ backend ເພີ່ມເຕີມ, ແຕ່ແພັກເກັດ (LPK) ຂອງພວກມັນຍັງບໍ່ໄດ້ຕິດຕັ້ງ. ທ່ານອາດຕ້ອງ rebuild IDE ດ້ວຍແພັກເກັດທີ່ຕິດຕັ້ງແລ້ວ. ຫຼັງຈາກ rebuild, debugger backend ສາມາດປ່ຽນໄດ້ໃນເມນູ: Tools -> Options.

source: If you decide to rebuild the IDE first and install missing packages, then select "Ignore" for now.%0:sAfter the rebuild, the debugger backend can be changed in the menu: Tools -> Options.
lo: ຖ້າທ່ານຕັດສິນໃຈ rebuild IDE ກ່ອນ ແລະ ຕິດຕັ້ງແພັກເກັດທີ່ຂາດຫາຍ, ໃຫ້ເລືອກ "ບໍ່ສົນໃຈ" ໄປກ່ອນ.%0:sຫຼັງຈາກ rebuild, debugger backend ສາມາດປ່ຽນໄດ້ໃນເມນູ: Tools -> Options.

source: There may be packages (LPK) missing from your IDE installation. You may need to rebuild the IDE and install them, before making changes to the setup.
lo: ອາດຈະມີແພັກເກັດ (LPK) ຂາດຫາຍໄປຈາກການຕິດຕັ້ງ IDE ຂອງທ່ານ. ທ່ານອາດຕ້ອງ rebuild IDE ແລະ ຕິດຕັ້ງພວກມັນ, ກ່ອນທີ່ຈະປ່ຽນການຕັ້ງຄ່າ.

source: There is a backend of recommended type in the list of existing debuggers. You may pick this instead of creating a new backend.
lo: ມີ backend ປະເພດທີ່ແນະນຳໃນລາຍການຂອງ debugger ທີ່ມີຢູ່. ທ່ານສາມາດເລືອກອັນນີ້ແທນທີ່ຈະສ້າງ backend ໃໝ່.
