Repository: fpc/Lazarus
Catalog: languages/lazaruside.*.po
Languages: lo

source: Unable to find file "%s".%sIf it belongs to your project, check search path in%sProject -> Compiler Options -> Search Paths -> Other Unit Files. If this file belongs to a package, check the appropriate package compiler options. If this file belongs to Lazarus, make sure compiling clean. If the file belongs to FPC then check fpc.cfg. If unsure, check Project -> CompilerOptions -> Test
lo: ບໍ່ພົບໄຟລ໌ "%s".%sຖ້າມັນເປັນຂອງໂປຣເຈັກຂອງທ່ານ, ໃຫ້ກວດເບິ່ງເສັ້ນທາງຄົ້ນຫາໃນ%sProject -> Compiler Options -> Search Paths -> Other Unit Files. ຖ້າໄຟລ໌ນີ້ເປັນຂອງແພັກເກັດ, ໃຫ້ກວດເບິ່ງຕົວເລືອກ compiler ຂອງແພັກເກັດທີ່ກ່ຽວຂ້ອງ. ຖ້າໄຟລ໌ນີ້ເປັນຂອງ Lazarus, ໃຫ້ແນ່ໃຈວ່າໄດ້ compile ແບບ clean. ຖ້າໄຟລ໌ເປັນຂອງ FPC ໃຫ້ກວດເບິ່ງ fpc.cfg. ຖ້າບໍ່ແນ່ໃຈ, ໃຫ້ກວດເບິ່ງ Project -> CompilerOptions -> Test

source: Unable to find %s in LFM Stream.
lo: ບໍ່ພົບ %s ໃນ LFM Stream.

source: Unable to find method.
lo: ບໍ່ພົບ method.

source: Unable to find Pascal unit (.pas, .pp) for .lfm file%s"%s"
lo: ບໍ່ພົບ Pascal unit (.pas, .pp) ສຳລັບໄຟລ໌ .lfm %s"%s"

source: Unable to find the component class "%s".%sIt is not registered via RegisterClass and no lfm was found.%sIt is needed by unit:%s%s
lo: ບໍ່ພົບ component class "%s".%sມັນບໍ່ໄດ້ລົງທະບຽນຜ່ານ RegisterClass ແລະ ບໍ່ພົບ lfm.%sມັນຈຳເປັນສຳລັບ unit:%s%s

source: Unable to gather editor changes.
lo: ບໍ່ສາມາດຮວບຮວມການປ່ຽນແປງຂອງຕົວແກ້ໄຂ.

source: Unable to get source for designer.
lo: ບໍ່ສາມາດເອົາ source ສຳລັບ designer ໄດ້.

source: unable to load file %s: %s
lo: ບໍ່ສາມາດໂຫຼດໄຟລ໌ %s: %s

source: Unable to load package "%s"
lo: ບໍ່ສາມາດໂຫຼດແພັກເກັດ "%s"

source: Unable to load the component class "%s" because it depends on itself.
lo: ບໍ່ສາມາດໂຫຼດ component class "%s" ໄດ້ ເນື່ອງຈາກມັນຂຶ້ນກັບຕົວມັນເອງ.

source: Unable to open "%s"
lo: ບໍ່ສາມາດເປີດ "%s"

source: Unable to open ancestor component
lo: ບໍ່ສາມາດເປີດ component ບັນພະບຸລຸດໄດ້

source: Unable to open designer.%sThe class %s does not descend from a designable class like TForm or TDataModule.
lo: ບໍ່ສາມາດເປີດ designer ໄດ້.%sຄລາສ %s ບໍ່ໄດ້ສືບທອດມາຈາກ designable class ເຊັ່ນ TForm ຫຼື TDataModule.

source: Unable to read %s
lo: ບໍ່ສາມາດອ່ານ %s

source: unable to read process ExitStatus
lo: ບໍ່ສາມາດອ່ານ process ExitStatus

source: Unable to remove old backup file "%s"!
lo: ບໍ່ສາມາດລຶບໄຟລ໌ສຳຮອງເກົ່າ "%s" ໄດ້!

source: Unable to remove project scaled from source.%s%s
lo: ບໍ່ສາມາດລຶບ project scaled ອອກຈາກ source ໄດ້.%s%s

source: Unable to remove project title from source.%s%s
lo: ບໍ່ສາມາດລຶບຫົວຂໍ້ໂປຣເຈັກອອກຈາກ source ໄດ້.%s%s

source: Unable to rename ambiguous file "%s"%sto "%s"
lo: ບໍ່ສາມາດປ່ຽນຊື່ໄຟລ໌ທີ່ກຳກວມ "%s"%sເປັນ "%s"

source: Unable to rename form in source.
lo: ບໍ່ສາມາດປ່ຽນຊື່ form ໃນ source ໄດ້.

source: Unable to rename method. Please fix the error shown in the message window.
lo: ບໍ່ສາມາດປ່ຽນຊື່ method ໄດ້. ກະລຸນາແກ້ໄຂຂໍ້ຜິດພາດທີ່ສະແດງໃນປ່ອງຢ້ຽມຂໍ້ຄວາມ.

source: Unable to rename variable in source.
lo: ບໍ່ສາມາດປ່ຽນຊື່ຕົວປ່ຽນໃນ source ໄດ້.

source: Unable to run
lo: ບໍ່ສາມາດແລ່ນໄດ້

source: Unable to run "%s"
lo: ບໍ່ສາມາດແລ່ນ "%s" ໄດ້

source: Unable to set AnchorSide Control
lo: ບໍ່ສາມາດຕັ້ງຄ່າ AnchorSide Control ໄດ້

source: Unable to show method.
lo: ບໍ່ສາມາດສະແດງ method ໄດ້.

source: Unable to stream selected components
lo: ບໍ່ສາມາດ stream components ທີ່ເລືອກໄດ້

source: Unable to stream selected components.
lo: ບໍ່ສາມາດ stream components ທີ່ເລືອກໄດ້.

source: Unable to stream %s:T%s.
lo: ບໍ່ສາມາດ stream %s:T%s.

source: Unable to transform binary component stream of %s:T%s into text.
lo: ບໍ່ສາມາດແປງ binary component stream ຂອງ %s:T%s ເປັນຂໍ້ຄວາມໄດ້.

source: Unable to update CreateForm statement in project source
lo: ບໍ່ສາມາດອັບເດດຄຳສັ່ງ CreateForm ໃນ project source ໄດ້

source: Uncheck All
lo: ຍົກເລີກການເລືອກທັງໝົດ

# lazarusidestrconsts.lisundo
source: Undo
lo: ກັບຄືນ

source: Uninstall %s
lo: ຖອນການຕິດຕັ້ງ %s

source: Uninstall failed
lo: ການຖອນການຕິດຕັ້ງລົ້ມເຫຼວ

source: Uninstall impossible
lo: ບໍ່ສາມາດຖອນການຕິດຕັ້ງໄດ້

source: Uninstall selection
lo: ຖອນການຕິດຕັ້ງສິ່ງທີ່ເລືອກ

source: Uninstall them too
lo: ຖອນການຕິດຕັ້ງພວກມັນຄືກັນ

source: Some packages were not uninstalled because they are needed by the IDE itself.
lo: ບາງແພັກເກັດບໍ່ໄດ້ຖືກຖອນການຕິດຕັ້ງ ເນື່ອງຈາກ IDE ຕ້ອງການພວກມັນ.

source: Unit "%s" has changed. Save?
lo: Unit "%s" ມີການປ່ຽນແປງ. ບັນທຶກບໍ່?

source: Unit identifier exists
lo: ຕົວລະບຸ Unit ມີຢູ່ແລ້ວ

source: %s unit %s in package %s
lo: %s unit %s ໃນແພັກເກັດ %s

source: Unit "%s" must be saved before it can be inherited from. Save now?
lo: Unit "%s" ຕ້ອງຖືກບັນທຶກກ່ອນທີ່ຈະສາມາດສືບທອດໄດ້. ບັນທຶກດຽວນີ້ບໍ່?

source: Unitname already in project
lo: ຊື່ Unit ມີຢູ່ໃນໂປຣເຈັກແລ້ວ

source: Unit name begins with ...
lo: ຊື່ Unit ເລີ່ມຕົ້ນດ້ວຍ ...

source: Unit name contains ...
lo: ຊື່ Unit ປະກອບມີ ...

source: unit %s not found
lo: ບໍ່ພົບ unit %s

source: unit %s not found at new position "%s"
lo: ບໍ່ພົບ unit %s ທີ່ຕຳແໜ່ງໃໝ່ "%s"

source: A unit not found in file %s
lo: ບໍ່ພົບ unit ໃນໄຟລ໌ %s

source: Unit Output directory
lo: ໄດເຣັກທໍຣີ Unit Output

source: unit path
lo: ເສັ້ນທາງ unit

source: Unit paths
lo: ເສັ້ນທາງ unit

source: unit %s requires package %s
lo: unit %s ຕ້ອງການແພັກເກັດ %s

source: Units not found in file %s
lo: ບໍ່ພົບ Units ໃນໄຟລ໌ %s

source: Unused units of %s
lo: Units ທີ່ບໍ່ໄດ້ໃຊ້ຂອງ %s

source: Unusual compiler file name. Usually it starts with fpc, ppc or ppcross.
lo: ຊື່ໄຟລ໌ compiler ຜິດປົກກະຕິ. ໂດຍທົ່ວໄປມັນເລີ່ມຕົ້ນດ້ວຍ fpc, ppc ຫຼື ppcross.

source: Unusual pas2js compiler file name. Usually it starts with pas2js.
lo: ຊື່ໄຟລ໌ compiler pas2js ຜິດປົກກະຕິ. ໂດຍທົ່ວໄປມັນເລີ່ມຕົ້ນດ້ວຍ pas2js.

# lazarusidestrconsts.lisup
source: Up
lo: ຂຶ້ນ

source: Update Application.CreateForm statements in main unit
lo: ອັບເດດຄຳສັ່ງ Application.CreateForm ໃນ unit ຫຼັກ

source: Update Application.Scaled statement in main unit
lo: ອັບເດດຄຳສັ່ງ Application.Scaled ໃນ unit ຫຼັກ

source: Update Application.Title statement in main unit
lo: ອັບເດດຄຳສັ່ງ Application.Title ໃນ unit ຫຼັກ

source: Update info
lo: ອັບເດດຂໍ້ມູນ

source: Update other procedure signatures when only letter case has changed
lo: ອັບເດດລາຍເຊັນ procedure ອື່ນໆ ເມື່ອມີການປ່ຽນແປງພຽງແຕ່ຕົວພິມເທົ່ານັ້ນ

source: Update references?
lo: ອັບເດດການອ້າງອີງບໍ່?

source: Upgrade
lo: ອັບເກຣດ

source: Upgrade configuration
lo: ອັບເກຣດການຕັ້ງຄ່າ

source: uppercase string
lo: ຂໍ້ຄວາມຕົວພິມໃຫຍ່

source: Uppercase string given as parameter.
lo: ຂໍ້ຄວາມຕົວພິມໃຫຍ່ທີ່ໃຫ້ເປັນພາຣາມິເຕີ.

source: URL on wiki (the base url is %s)
lo: URL ໃນ wiki (URL ພື້ນຖານແມ່ນ %s)

source: Usage message (-h option)
lo: ຂໍ້ຄວາມວິທີໃຊ້ (ຕົວເລືອກ -h)

source: Use
lo: ໃຊ້

# lazarusidestrconsts.lisuseansistrings
source: Use Ansistrings
lo: ໃຊ້ Ansistrings

source: Use "%s" anyway
lo: ໃຊ້ "%s" ຕໍ່ໄປ

source: Use CheckBox for Boolean values
lo: ໃຊ້ CheckBox ສຳລັບຄ່າ Boolean

source: Use comments in custom options
lo: ໃຊ້ຄຳເຫັນໃນຕົວເລືອກກຳນົດເອງ

source: used by %s
lo: ຖືກໃຊ້ໂດຍ %s

source: Use design time packages
lo: ໃຊ້ design time packages

source: Used for auto-created forms.
lo: ໃຊ້ສຳລັບຟອມທີ່ສ້າງອັດຕະໂນມັດ.

source: Use filter to include extra files
lo: ໃຊ້ຕົວຕອງເພື່ອຮວມໄຟລ໌ພິເສດ

source: Use identifier
lo: ໃຊ້ຕົວລະບຸ

source: Use identifier %s in %s at %s
lo: ໃຊ້ຕົວລະບຸ %s ໃນ %s ທີ່ %s

source: Use "%s" instead
lo: ໃຊ້ "%s" ແທນ

source: Launching application
lo: ການເປີດແອັບພລິເຄຊັນ

source: Use package %s in package %s
lo: ໃຊ້ແພັກເກັດ %s ໃນແພັກເກັດ %s

source: Use package in package
lo: ໃຊ້ແພັກເກັດໃນແພັກເກັດ

source: Use package %s in project
lo: ໃຊ້ແພັກເກັດ %s ໃນໂປຣເຈັກ

source: Use package in project
lo: ໃຊ້ແພັກເກັດໃນໂປຣເຈັກ

source: Add to list "%s"
lo: ເພີ່ມເຂົ້າໃນລາຍການ "%s"

# lazarusidestrconsts.lisuserdefinedmarkupkeygroup
source: User defined text markup
lo: ການກຳນົດຮູບແບບຂໍ້ຄວາມໂດຍຜູ້ໃຊ້

source: Remove from list "%s"
lo: ລຶບອອກຈາກລາຍການ "%s"

source: Toggle on list "%s"
lo: ເປີດ/ປິດ ໃນລາຍການ "%s"

source: User's home directory
lo: ໄດເຣັກທໍຣີຫຼັກຂອງຜູ້ໃຊ້

# lazarusidestrconsts.lisuseunit
source: Add Unit to Uses Section
lo: ເພີ່ມ Unit ເຂົ້າໃນສ່ວນ Uses

source: Use unit %s in unit %s
lo: ໃຊ້ unit %s ໃນ unit %s

source: UTF-8 with BOM
lo: UTF-8 ພ້ອມ BOM

# lazarusidestrconsts.lisvalue
source: Value
lo: ຄ່າ

source: Value%s
lo: ຄ່າ%s

source: Value:
lo: ຄ່າ:

source: Values
lo: ຄ່າຕ່າງໆ

source: Values that are changed from the default are stored in .lfm file and are shown differently in Object Inspector.
lo: ຄ່າທີ່ມີການປ່ຽນແປງຈາກຄ່າເລີ່ມຕົ້ນຈະຖືກເກັບໄວ້ໃນໄຟລ໌ .lfm ແລະ ສະແດງຜົນແຕກຕ່າງກັນໃນ Object Inspector.

# lazarusidestrconsts.lisvariable
source: Variable
lo: ຕົວປ່ຽນ

# lazarusidestrconsts.lisverbose
source: Verbose
lo: ລະອຽດ

source: Verify method calls
lo: ກວດສອບການຮ້ອງ method

source: Version
lo: ເວີຊັນ

source: Version mismatch
lo: ເວີຊັນບໍ່ກົງກັນ

source: Vertical
lo: ແນວຕັ້ງ

source: Copy version information to clipboard
lo: ສຳເນົາຂໍ້ມູນເວີຊັນໄປຍັງ clipboard

source: Very Verbose
lo: ລະອຽດຫຼາຍ

source: View Source (.lfm)
lo: ເບິ່ງຊອດໂຄ້ດ (.lfm)

source: Warning:
lo: ຄຳເຕືອນ:

source: , Warnings: %s
lo: , ຄຳເຕືອນ: %s

source: %sWarning: This is the main unit. The new main unit will be %s.pas.
lo: %sຄຳເຕືອນ: ນີ້ແມ່ນ unit ຫຼັກ. unit ຫຼັກໃໝ່ຈະແມ່ນ %s.pas.

source: Welcome to Lazarus IDE %s
lo: ຍິນດີຕ້ອນຮັບສູ່ Lazarus IDE %s

source: Welcome to Lazarus %s%sThere is already a configuration from version %s in%s%s
lo: ຍິນດີຕ້ອນຮັບສູ່ Lazarus %s%sມີການຕັ້ງຄ່າຈາກເວີຊັນ %s ຢູ່ແລ້ວໃນ %s%s

source: What needs building
lo: ສິ່ງທີ່ຕ້ອງການ build

source: When a unit is renamed, update references
lo: ເມື່ອ unit ຖືກປ່ຽນຊື່, ໃຫ້ອັບເດດການອ້າງອີງ

source: When enabled the current options are saved to the template which is used when creating new projects
lo: ເມື່ອເປີດໃຊ້ງານ ຕົວເລືອກປັດຈຸບັນຈະຖືກບັນທຶກໄວ້ໃນ template ເຊິ່ງຈະຖືກໃຊ້ເມື່ອສ້າງໂປຣເຈັກໃໝ່

source: When there is only one possible completion item use it immediately, without showing the completion box
lo: ເມື່ອມີລາຍການເຕີມເຕັມທີ່ເປັນໄປໄດ້ພຽງອັນດຽວ ໃຫ້ໃຊ້ມັນທັນທີ ໂດຍບໍ່ຕ້ອງສະແດງກ່ອງເຕີມເຕັມ

source: When the source editor cursor moves, show the current node in the code explorer
lo: ເມື່ອເຄີເຊີໃນຕົວແກ້ໄຂຊອດໂຄ້ດເຄື່ອນທີ່, ໃຫ້ສະແດງ node ປັດຈຸບັນໃນ code explorer

source: Window menu shows designed form's name instead of caption
lo: ເມນູໜ້າຕ່າງສະແດງຊື່ຂອງຟອມທີ່ອອກແບບແທນທີ່ຈະເປັນ caption

source: Useful especially if the caption is left empty.
lo: ມີປະໂຫຍດໂດຍສະເພາະຖ້າ caption ຖືກປະໄວ້ວ່າງເປົ່າ.

source: Window stays on top
lo: ໜ້າຕ່າງຢູ່ເທິງສຸດສະເໝີ

source: , with includes
lo: , ພ້ອມກັບ includes

source: Without a proper compiler the code browsing and compiling will be disappointing.
lo: ຫາກບໍ່ມີ compiler ທີ່ເໝາະສົມ ການຊອກເບິ່ງໂຄ້ດ ແລະ ການ compile ຈະບໍ່ໄດ້ດັ່ງໃຈ.

source: Without a proper debugger, debugging will be disappointing.
lo: ຫາກບໍ່ມີ debugger ທີ່ເໝາະສົມ, ການ debug ຈະບໍ່ໄດ້ດັ່ງໃຈ.

source: Without a proper Lazarus directory you will get a lot of warnings.
lo: ຫາກບໍ່ມີໄດເຣັກທໍຣີ Lazarus ທີ່ຖືກຕ້ອງ ເຈົ້າຈະໄດ້ຮັບຄຳເຕືອນຈຳນວນຫຼາຍ.

source: Without a proper "make" executable the compiling of the IDE is not possible.
lo: ຫາກບໍ່ມີໄຟລ໌ "make" ທີ່ໃຊ້ງານໄດ້ ການ compile IDE ຈະເປັນໄປບໍ່ໄດ້.

source: Without the proper FPC sources code browsing and completion will be very limited.
lo: ຫາກບໍ່ມີຊອດໂຄ້ດ FPC ທີ່ຖືກຕ້ອງ ການຊອກເບິ່ງໂຄ້ດ ແລະ ການເຕີມເຕັມຈະຖືກຈຳກັດຫຼາຍ.

source: With required packages
lo: ພ້ອມກັບແພັກເກັດທີ່ຕ້ອງການ

source: Word at cursor in current editor
lo: ຄຳສັບທີ່ຢູ່ບ່ອນເຄີເຊີໃນຕົວແກ້ໄຂປັດຈຸບັນ

source: Working directory for building
lo: ໄດເຣັກທໍຣີເຮັດວຽກສຳລັບການ build

source: Working directory for run
lo: ໄດເຣັກທໍຣີເຮັດວຽກສຳລັບການ run

source: Write config instead of command line parameters
lo: ຂຽນ config ແທນ parameter ຂອງ command line

source: Writing the package info file failed.
lo: ການຂຽນໄຟລ໌ຂໍ້ມູນແພັກເກັດລົ້ມເຫຼວ.

source: Writing the project info file failed.
lo: ການຂຽນໄຟລ໌ຂໍ້ມູນໂປຣເຈັກລົ້ມເຫຼວ.

source: Write what package files are searched and found.
lo: ຂຽນວ່າໄຟລ໌ແພັກເກັດໃດທີ່ຖືກຄົ້ນຫາ ແລະ ພົບເຫັນ.

source: wrong version in %s: %s
lo: ເວີຊັນຜິດພາດໃນ %s: %s

source: You can disable this for individual forms via the package editor
lo: ເຈົ້າສາມາດປິດການໃຊ້ງານສິ່ງນີ້ສຳລັບຟອມສະເພາະຜ່ານຕົວແກ້ໄຂແພັກເກັດ

source: You can disable this for individual forms via the popup menu in the project inspector
lo: ເຈົ້າສາມາດປິດການໃຊ້ງານສິ່ງນີ້ສຳລັບຟອມສະເພາະຜ່ານເມນູ popup ໃນ project inspector

source: You can download FPC and the FPC sources from http://sourceforge.net/projects/lazarus/?source=directory
lo: ເຈົ້າສາມາດດາວໂຫຼດ FPC ແລະ ຊອດໂຄ້ດ FPC ຈາກ http://sourceforge.net/projects/lazarus/?source=directory

source: You cannot build Lazarus while debugging or compiling.
lo: ເຈົ້າບໍ່ສາມາດ build Lazarus ໃນຂະນະທີ່ກຳລັງ debug ຫຼື compile ຢູ່.

source: You cannot change the build mode while compiling.
lo: ເຈົ້າບໍ່ສາມາດປ່ຽນໂໝດ build ໃນຂະນະທີ່ກຳລັງ compile ຢູ່.

source: You can select items by simply pressing underscored letters
lo: ເຈົ້າສາມາດເລືອກລາຍການໄດ້ງ່າຍໆໂດຍການກົດຕົວອັກສອນທີ່ມີຂີດກ້ອງ

# lazarusidestrconsts.lis_all_
source: <All>
lo: <ທັງໝົດ>

# lazarusidestrconsts.locwndsrceditor
source: Source Editor
lo: ຕົວແກ້ໄຂຊອດໂຄ້ດ

source: Delete selected
lo: ລຶບທີ່ເລືອກ

source: invalid
lo: ບໍ່ຖືກຕ້ອງ

source: lpk file invalid (%s)
lo: ໄຟລ໌ lpk ບໍ່ຖືກຕ້ອງ (%s)

source: lpk file valid (%s)
lo: ໄຟລ໌ lpk ຖືກຕ້ອງ (%s)

source: Unable to delete file "%s"
lo: ບໍ່ສາມາດລຶບໄຟລ໌ "%s"

source: valid
lo: ຖືກຕ້ອງ

source: Rescan lpl files
lo: ສະແກນໄຟລ໌ lpl ຄືນໃໝ່

source: Add horizontal spacing between columns
lo: ເພີ່ມໄລຍະຫ່າງແນວນອນລະຫວ່າງຖັນ

source: Add vertical spacing around nodes
lo: ເພີ່ມໄລຍະຫ່າງແນວຕັ້ງອ້ອມຮອບ node

source: Extra spacing (x/y)
lo: ໄລຍະຫ່າງເພີ່ມເຕີມ (x/y)

source: Names above node
lo: ຊື່ຢູ່ເໜືອ node

source: Absolute limit for height of levels
lo: ຂີດຈຳກັດທີ່ແນ່ນອນສຳລັບຄວາມສູງຂອງລະດັບ

source: Crossings
lo: ຈຸດຕັດ

source: Edge len
lo: ຄວາມຍາວຂອບ

source: Edges
lo: ຂອບ

source: Info
lo: ຂໍ້ມູນ

# lazarusidestrconsts.lvlgraphoptlevels
source: Levels
lo: ລະດັບ

source: Limit height of Levels
lo: ຈຳກັດຄວາມສູງຂອງລະດັບ

source: Limit relative to node-count for height of levels.%0sLimit = min(3, val*sqrt(NodeCount))
lo: ຈຳກັດໂດຍສົມທຽບກັບຈຳນວນ node ສຳລັບຄວາມສູງຂອງລະດັບ.%0sLimit = min(3, val*sqrt(NodeCount))

source: Splitpoints
lo: ຈຸດແຍກ

source: Reduce backedges
lo: ຫຼຸດຂອບທີ່ຍ້ອນກັບ

source: Calculate layout from high-edge
lo: ຄຳນວນໂຄງຮ່າງຈາກຂອບສູງ

source: Curved
lo: ໂຄ້ງ

source: Edges shape
lo: ຮູບຮ່າງຂອບ

source: Edges split mode
lo: ໂໝດແຍກຂອບ

source: Minimize edges len
lo: ຫຍໍ້ຄວາມຍາວຂອບໃຫ້ສັ້ນສຸດ

source: Straight
lo: ຊື່

source: Merge at highest
lo: ລວມກັນຢູ່ຈຸດສູງສຸດ

source: Merge at source
lo: ລວມກັນຢູ່ຕົ້ນທາງ

source: Merge at target
lo: ລວມກັນຢູ່ປາຍທາງ

# lazarusidestrconsts.lvlgraphsplitnone
source: None
lo: ບໍ່ມີ

source: Separate
lo: ແຍກກັນ

source: Straighten graph
lo: ຈັດກຣາບໃຫ້ຊື່

source: Changes
lo: ການປ່ຽນແປງ

source: Folding
lo: ການພັບ

source: Marks
lo: ເຄື່ອງໝາຍ

source: No current line color
lo: ບໍ່ມີສີແຖວປັດຈຸບັນ

source: Separator
lo: ຕົວແຍກ

source: Use current line color (gutter: other)
lo: ໃຊ້ສີແຖວປັດຈຸບັນ (gutter: ອື່ນໆ)

source: Use current line number color (gutter: number)
lo: ໃຊ້ສີເລກແຖວປັດຈຸບັນ (gutter: ຕົວເລກ)

source: Add package unit to uses section
lo: ເພີ່ມ unit ຂອງແພັກເກັດໃສ່ໃນສ່ວນ uses

source: Add Inverse
lo: ເພີ່ມ Inverse

source: Add new term
lo: ເພີ່ມຄຳສັບໃໝ່

source: Attributes
lo: ຄຸນລັກສະນະ

source: Automatically increase build number
lo: ເພີ່ມໝາຍເລກ build ໂດຍອັດຕະໂນມັດ

source: Increased every time the project is compiled.
lo: ເພີ່ມຂຶ້ນທຸກຄັ້ງທີ່ໂປຣເຈັກຖືກ compile.

source: Character set:
lo: ຊຸດຕົວອັກສອນ:

source: Close all pages
lo: ປິດໜ້າທັງໝົດ

source: Close current page (Ctrl+F4)∥(Ctrl+W)
lo: ປິດໜ້າປັດຈຸບັນ (Ctrl+F4)∥(Ctrl+W)

source: Close page(s) on the left
lo: ປິດໜ້າທາງຊ້າຍ

source: Close other page(s)
lo: ປິດໜ້າອື່ນໆ

source: Close page(s) on the right
lo: ປິດໜ້າທາງຂວາ

source: Conditional defines
lo: ການກຳນົດແບບມີເງື່ອນໄຂ (Conditional defines)

source: Create new define
lo: ສ້າງ define ໃໝ່

source: Enable i18n
lo: ເປີດໃຊ້ i18n

source: Filter the lines in list with a string (Ctrl+F)
lo: ກັ່ນຕອງແຖວໃນລາຍການດ້ວຍຂໍ້ຄວາມ (Ctrl+F)

source: Found but not listed here:
lo: ພົບແຕ່ບໍ່ໄດ້ສະແດງຢູ່ນີ້:

source: Excluded
lo: ຖືກຍົກເວັ້ນ

source: Force update PO files on next build
lo: ບັງຄັບອັບເດດໄຟລ໌ PO ໃນການ build ຄັ້ງຕໍ່ໄປ

source: Identifiers:
lo: ຕົວລະບຸ (Identifiers):

source: i18n Options
lo: ຕົວເລືອກ i18n

source: Originals:
lo: ຕົ້ນສະບັບ:

source: Version info is stored if the executable format supports it.
lo: ຂໍ້ມູນເວີຊັນຈະຖືກເກັບໄວ້ຫາກຮູບແບບ executable ຮອງຮັບມັນ.

source: Include version info in executable
lo: ລວມຂໍ້ມູນເວີຊັນໃນ executable

source: Language options
lo: ຕົວເລືອກພາສາ

source: Language selection:
lo: ການເລືອກພາສາ:

source: &Major version:
lo: ເວີຊັນ &Major:

source: Mi&nor version:
lo: ເວີຊັນ Mi&nor:

source: New search with same criteria (Ctrl+N)
lo: ຄົ້ນຫາໃໝ່ດ້ວຍເງື່ອນໄຂດຽວກັນ (Ctrl+N)

source: Other info
lo: ຂໍ້ມູນອື່ນໆ

source: PO Output Directory:
lo: ໄດເຣັກທໍຣີ Output PO:

source: Refresh the search (F5)
lo: ໂຫຼດການຄົ້ນຫາຄືນໃໝ່ (F5)

source: Resource
lo: ຊັບພະຍາກອນ (Resource)

source: Delete all resources?
lo: ລຶບ resources ທັງໝົດບໍ່?

# lazarusidestrconsts.rsresourcefilename
source: File name
lo: ຊື່ໄຟລ໌

# lazarusidestrconsts.rsresourcetype
source: Type
lo: ປະເພດ

source: Select an inherited entry
lo: ເລືອກລາຍການທີ່ສືບທອດມາ

source: Absolute path
lo: ທີ່ຢູ່ເຕັມ (Absolute path)

# lazarusidestrconsts.rsshowfilename
source: File name
lo: ຊື່ໄຟລ໌

source: Path display mode (Ctrl+P)
lo: ໂໝດສະແດງທີ່ຢູ່ (Ctrl+P)

source: Relative path
lo: ທີ່ຢູ່ທຽບຖານ (Relative path)

source: Version numbering
lo: ການນັບເລກເວີຊັນ

source: Show options
lo: ສະແດງຕົວເລືອກ

source: Clipboard
lo: ຄລິບບອດ

source: Text column selection
lo: ການເລືອກຖັນຂໍ້ຄວາມ

source: Cursor moving
lo: ການຍ້າຍເຄີເຊີ

source: Text editing
lo: ການແກ້ໄຂຂໍ້ຄວາມ

source: File menu
lo: ເມນູໄຟລ໌

source: Text folding
lo: ການພັບຂໍ້ຄວາມ

# lazarusidestrconsts.srkmcathelpmenu
source: Help menu
lo: ເມນູຊ່ວຍເຫຼືອ

source: Line wrapping
lo: ການຕັດແຖວ

# lazarusidestrconsts.srkmcatmacrorecording
source: Macros
lo: ແມັກໂຄຣ

source: Text bookmarks
lo: ບຸກມາກຂໍ້ຄວາມ

source: Multi caret
lo: ຫຼາຍ Caret

source: Package menu
lo: ເມນູແພັກເກັດ

source: Project menu
lo: ເມນູໂປຣເຈັກ

source: Run menu
lo: ເມນູ Run

source: Text search and replace
lo: ການຄົ້ນຫາ ແລະ ແທນທີ່ຂໍ້ຄວາມ

source: Text selection
lo: ການເລືອກຂໍ້ຄວາມ

source: Syncron Editing
lo: ການແກ້ໄຂແບບ Syncron

source: Syncron Editing (not in Cell)
lo: ການແກ້ໄຂແບບ Syncron (ບໍ່ແມ່ນໃນເຊວ)

source: Syncron Editing (while selecting)
lo: ການແກ້ໄຂແບບ Syncron (ຂະນະເລືອກ)

source: Template Editing
lo: ການແກ້ໄຂ Template

source: Template Editing (not in Cell)
lo: ການແກ້ໄຂ Template (ບໍ່ແມ່ນໃນເຊວ)

source: Tools menu
lo: ເມນູເຄື່ອງມື

source: View menu
lo: ເມນູມຸມມອງ

# lazarusidestrconsts.srkmcommand
source: Command:
lo: ຄຳສັ່ງ:

source: Conflict
lo: ຂໍ້ຂັດແຍ່ງ

source: abort build
lo: ຍົກເລີກການ build

source: add address breakpoint
lo: ເພີ່ມ address breakpoint

source: add source breakpoint
lo: ເພີ່ມ source breakpoint

source: add data/watchpoint
lo: ເພີ່ມ data/watchpoint

source: Add Jump Point
lo: ເພີ່ມຈຸດກະໂດດ

source: add watch
lo: ເພີ່ມ watch

source: Attach to program
lo: ແນບກັບໂປຣແກຣມ

source: Code template completion
lo: ການເຕີມເຕັມແມ່ແບບໂຄ້ດ

source: Copy Block
lo: ສຳເນົາບລັອກ

source: Delete Block
lo: ລຶບບລັອກ

source: Goto Block begin
lo: ໄປທີ່ຈຸດເລີ່ມຕົ້ນບລັອກ

source: Goto Block end
lo: ໄປທີ່ຈຸດສິ້ນສຸດບລັອກ

source: Hide Block
lo: ເຊື່ອງບລັອກ

source: Indent line/block
lo: ຫຍໍ້ໜ້າ ແຖວ/ບລັອກ

source: Indent line/block (move columns)
lo: ຫຍໍ້ໜ້າ ແຖວ/ບລັອກ (ຍ້າຍຖັນ)

source: Move Block
lo: ຍ້າຍບລັອກ

source: Set block begin
lo: ກຳນົດຈຸດເລີ່ມຕົ້ນບລັອກ

source: Set block end
lo: ກຳນົດຈຸດສິ້ນສຸດບລັອກ

source: Show Block
lo: ສະແດງບລັອກ

source: Toggle block
lo: ເປີດ/ປິດ ບລັອກ

source: Unindent line/block
lo: ຍ້າຍອອກ ແຖວ/ບລັອກ

source: Unindent line/block (move columns)
lo: ຍ້າຍອອກ ແຖວ/ບລັອກ (ຍ້າຍຖັນ)

source: show breakpoint properties
lo: ສະແດງຄຸນສົມບັດ breakpoint

source: build program/project
lo: build ໂປຣແກຣມ/ໂປຣເຈັກ

source: build file
lo: build ໄຟລ໌

source: build many modes
lo: build ຫຼາຍໂໝດ

source: Char
lo: ຕົວອັກສອນ

source: clean up and build
lo: ອະນາໄມ ແລະ build

source: Delete whole text
lo: ລຶບຂໍ້ຄວາມທັງໝົດ

source: Clear all Bookmarks
lo: ລ້າງ Bookmarks ທັງໝົດ

source: Clear Bookmarks for current file
lo: ລ້າງ Bookmarks ສຳລັບໄຟລ໌ປັດຈຸບັນ

source: Column Select Down
lo: ເລືອກຖັນລົງລຸ່ມ

source: Column Select to absolute end
lo: ເລືອກຖັນຈົນສຸດທ້າຍ

source: Column Select to absolute beginning
lo: ເລືອກຖັນຈົນເລີ່ມຕົ້ນ

source: Column Select Left
lo: ເລືອກຖັນໄປທາງຊ້າຍ

source: Column Select Line End
lo: ເລືອກຖັນຈົນສຸດແຖວ

source: Column Select Line Start
lo: ເລືອກຖັນຈົນເລີ່ມຕົ້ນແຖວ

source: Column Select to text start in line
lo: ເລືອກຖັນໄປຍັງຈຸດເລີ່ມຕົ້ນຂໍ້ຄວາມໃນແຖວ

source: Column Select Page Bottom
lo: ເລືອກຖັນລົງທ້າຍໜ້າ

source: Column Select Page Down
lo: ເລືອກຖັນລົງໜຶ່ງໜ້າ

source: Column Select Page Top
lo: ເລືອກຖັນຂຶ້ນຕົ້ນໜ້າ

source: Column Select Page Up
lo: ເລືອກຖັນຂຶ້ນໜຶ່ງໜ້າ

source: Column Select Right
lo: ເລືອກຖັນໄປທາງຂວາ

source: Column Select Up
lo: ເລືອກຖັນຂຶ້ນເທິງ

source: Column Select Word Left
lo: ເລືອກຖັນຄຳສັບທາງຊ້າຍ

source: Column Select Word Right
lo: ເລືອກຖັນຄຳສັບທາງຂວາ

source: Move column-block left (delete before columns)
lo: ຍ້າຍບລັອກຖັນໄປທາງຊ້າຍ (ລຶບກ່ອນຖັນ)

source: Move column-block right (delete after columns)
lo: ຍ້າຍບລັອກຖັນໄປທາງຂວາ (ລຶບຫຼັງຖັນ)

source: Shift column-block left (delete in columns)
lo: ເລື່ອນບລັອກຖັນໄປທາງຊ້າຍ (ລຶບໃນຖັນ)

source: Shift column-block right (delete in columns)
lo: ເລື່ອນບລັອກຖັນໄປທາງຂວາ (ລຶບໃນຖັນ)

source: Column selection mode
lo: ໂໝດການເລືອກຖັນ

source: compile program/project
lo: compile ໂປຣແກຣມ/ໂປຣເຈັກ

source: config build file
lo: ກຳນົດຄ່າໄຟລ໌ build

# lazarusidestrconsts.srkmeccopy
source: Copy
lo: ສຳເນົາ

source: Copy to clipboard (append)
lo: ສຳເນົາໄປ clipboard (ຕໍ່ທ້າຍ)

source: Copy current line to clipboard (append)
lo: ສຳເນົາແຖວປັດຈຸບັນໄປ clipboard (ຕໍ່ທ້າຍ)

source: Copy current line to clipboard
lo: ສຳເນົາແຖວປັດຈຸບັນໄປ clipboard

source: Copy editor to new window
lo: ສຳເນົາຕົວແກ້ໄຂໄປຍັງໜ້າຕ່າງໃໝ່

source: Copy editor to next free window
lo: ສຳເນົາຕົວແກ້ໄຂໄປຍັງໜ້າຕ່າງວ່າງຖັດໄປ

source: Copy editor to prior free window
lo: ສຳເນົາຕົວແກ້ໄຂໄປຍັງໜ້າຕ່າງວ່າງກ່ອນໜ້າ

# lazarusidestrconsts.srkmeccut
source: Cut
lo: ຕັດ

source: Cut to clipboard (append)
lo: ຕັດໄປ clipboard (ຕໍ່ທ້າຍ)

source: Cut current line to clipboard (append)
lo: ຕັດແຖວປັດຈຸບັນໄປ clipboard (ຕໍ່ທ້າຍ)

source: Cut current line to clipboard
lo: ຕັດແຖວປັດຈຸບັນໄປ clipboard

source: Delete to beginning of line
lo: ລຶບໄປຫາຈຸດເລີ່ມຕົ້ນຂອງແຖວ

source: Delete char at cursor
lo: ລຶບຕົວອັກສອນທີ່ເຄີເຊີ

source: Delete to end of line
lo: ລຶບໄປຫາຈຸດສິ້ນສຸດຂອງແຖວ

source: Delete Last Char
lo: ລຶບຕົວອັກສອນສຸດທ້າຍ

source: Delete to start of word
lo: ລຶບໄປຫາຈຸດເລີ່ມຕົ້ນຂອງຄຳ

source: Delete current line (keep caret at BOL)
lo: ລຶບແຖວປັດຈຸບັນ (ຮັກສາ caret ໄວ້ທີ່ BOL)

source: Delete current line (restore caret x-pos)
lo: ລຶບແຖວປັດຈຸບັນ (ຄືນຄ່າຕຳແໜ່ງ x ຂອງ caret)

source: Delete to end of word
lo: ລຶບໄປຫາຈຸດສິ້ນສຸດຂອງຄຳ

source: Detach from program
lo: ແຍກອອກຈາກໂປຣແກຣມ

source: Move cursor down
lo: ຍ້າຍເຄີເຊີລົງ

source: Duplicate line (or lines in selection)
lo: ສຳເນົາແຖວຊ້ຳ (ຫຼື ແຖວທີ່ເລືອກ)

source: Duplicate selection
lo: ສຳເນົາສ່ວນທີ່ເລືອກຊ້ຳ

source: Move cursor to absolute end
lo: ຍ້າຍເຄີເຊີໄປຈຸດສິ້ນສຸດ

source: Move cursor to absolute beginning
lo: ຍ້າຍເຄີເຊີໄປຈຸດເລີ່ມຕົ້ນ

source: Empty Methods ...
lo: Methods ວ່າງເປົ່າ ...

source: IDE options
lo: ຕົວເລືອກ IDE

source: evaluate/modify
lo: ປະເມີນ/ແກ້ໄຂ

# lazarusidestrconsts.srkmecextractproc
source: Extract Procedure
lo: ແຍກ Procedure ອອກມາ

source: External tool %d
lo: ເຄື່ອງມືພາຍນອກ %d

source: External tools settings
lo: ການຕັ້ງຄ່າເຄື່ອງມືພາຍນອກ

source: Find Text
lo: ຄົ້ນຫາຂໍ້ຄວາມ

source: Find block other end
lo: ຄົ້ນຫາປາຍອີກດ້ານຂອງບລັອກ
