Repository: fpc/Lazarus
Catalog: languages/lazaruside.*.po
Languages: lo

source: multiple compiler configs found:
lo: ພົບການຕັ້ງຄ່າຄອມໄພເລີຫຼາຍອັນ:

source: no fpc.cfg found
lo: ບໍ່ພົບ fpc.cfg

source: non ASCII
lo: ບໍ່ແມ່ນ ASCII

source: ppu exists twice: %s, %s
lo: ppu ມີຊ້ຳກັນສອງບ່ອນ: %s, %s

source: There is a .ppu file older than the compiler itself:%s%s
lo: ມີຟາຍລ໌ .ppu ທີ່ເກົ່າກວ່າຕົວຄອມໄພເລີເອງ:%s%s

source: The RTL unit %s was not found.%sThis typically means your %s has wrong unit paths. Or your installation is broken.
lo: ບໍ່ພົບຢູນິດ RTL %s.%sໂດຍທົ່ວໄປໝາຍຄວາມວ່າ %s ຂອງເຈົ້າມີ path ຢູນິດທີ່ຜິດ. ຫຼື ການຕິດຕັ້ງຂອງເຈົ້າເສຍຫາຍ.

source: There are several Free Pascal Compilers in your path.%s%s%sMaybe you forgot to delete an old compiler?
lo: ມີ Free Pascal Compilers ຫຼາຍອັນຢູ່ໃນ path ຂອງເຈົ້າ.%s%s%sບາງທີເຈົ້າອາດຈະລືມ ລຶບຄອມໄພເລີເກົ່າອອກ?

# lazarusidestrconsts.lisccoskip
source: Skip
lo: ຂ້າມ

source: special characters
lo: ຕົວອັກສອນພິເສດ

source: All tests succeeded.
lo: ການທົດສອບທັງໝົດສຳເລັດ.

source: Unable to create Test File
lo: ບໍ່ສາມາດສ້າງຟາຍລ໌ທົດສອບ

source: Unable to create Test Pascal file "%s".
lo: ບໍ່ສາມາດສ້າງຟາຍລ໌ Pascal ທົດສອບ "%s".

source: unusual characters
lo: ຕົວອັກສອນຜິດປົກກະຕິ

# lazarusidestrconsts.lisccowarningcaption
source: Warning
lo: ຄຳເຕືອນ

source: WARNING:
lo: ຄຳເຕືອນ:

source: wrong path delimiter
lo: ຕົວຂັ້ນ path ຜິດ

source: Categories
lo: ໝວດໝູ່

source: Complexity
lo: ຄວາມຊັບຊ້ອນ

source: Constants
lo: ຄ່າຄົງທີ່

source: Empty blocks
lo: ບຼັອກຫວ່າງເປົ່າ

source: Empty class sections
lo: ສ່ວນຄລາສຫວ່າງເປົ່າ

source: Empty constructs
lo: ໂຄງສ້າງຫວ່າງເປົ່າ

source: Empty procedures
lo: ໂປຣຊີເຈີຫວ່າງເປົ່າ

source: (filter)
lo: (ຕົວຄັດຕອງ)

source: Follow cursor
lo: ຕາມເຄີເຊີ

source: Is a root control
lo: ເປັນ control ຮາກຖານ

source: Parameters count treated as "many"
lo: ຈຳນວນພາຣາມິເຕີທີ່ຖືວ່າ "ຫຼາຍ"

source: Long procedures
lo: ໂປຣຊີເຈີຍາວ

source: Line count of procedure treated as "long"
lo: ຈຳນວນແຖວຂອງໂປຣຊີເຈີທີ່ຖືວ່າ "ຍາວ"

source: Many nested procedures
lo: ໂປຣຊີເຈີຊ້ອນກັນຫຼາຍ

source: Many parameters
lo: ພາຣາມິເຕີຫຼາຍ

source: Show Categories
lo: ສະແດງໝວດໝູ່

source: Show Source Nodes
lo: ສະແດງໂນດຊອດໂຄດ

source: Nested procedures count treated as "many"
lo: ຈຳນວນໂປຣຊີເຈີຊ້ອນກັນທີ່ຖືວ່າ "ຫຼາຍ"

source: Center a lost window
lo: ຈັດປ່ອງຢ້ຽມທີ່ຫາຍໄປໃຫ້ຢູ່ເຄິ່ງກາງ

source: Center control horizontally relative to the given sibling. BorderSpacing is ignored.
lo: ຈັດ control ທາງນອນທຽບກັບ sibling ທີ່ກຳນົດ. BorderSpacing ຈະຖືກຂ້າມໄປ.

source: Center control vertically relative to the given sibling. BorderSpacing is ignored.
lo: ຈັດ control ທາງຕັ້ງທຽບກັບ sibling ທີ່ກຳນົດ. BorderSpacing ຈະຖືກຂ້າມໄປ.

source: Center Form
lo: ຈັດຟອມຢູ່ເຄິ່ງກາງ

source: Center in window
lo: ຈັດເຄິ່ງກາງໃນປ່ອງຢ້ຽມ

source: Centers
lo: ຈັດກາງ

source: Preferred exhibition mode
lo: ໂໝດການສະແດງຜົນທີ່ຕ້ອງການ

# lazarusidestrconsts.lisceomodecategory
source: Category
lo: ໝວດໝູ່

# lazarusidestrconsts.lisceomodesource
source: Source
lo: ຊອດໂຄດ

source: Never, only manually
lo: ບໍ່ເຄີຍ, ດ້ວຍມືເທົ່ານັ້ນ

source: Only used in category mode
lo: ໃຊ້ໃນໂໝດໝວດໝູ່ເທົ່ານັ້ນ

source: On idle
lo: ເມື່ອຫວ່າງ

source: Refresh automatically
lo: ຣີເຟຣຊອັດຕະໂນມັດ

# lazarusidestrconsts.lisceothergroup
source: Other
lo: ອື່ນໆ

source: Update
lo: ອັບເດດ

source: When switching file in source editor
lo: ເມື່ອສະລັບຟາຍລ໌ໃນຕົວແກ້ໄຂຊອດໂຄດ

source: Procedures
lo: ໂປຣຊີເຈີ

# lazarusidestrconsts.lisceproperties
source: Properties
lo: ຄຸນສົມບັດ

source: Published properties without default
lo: ຄຸນສົມບັດ Published ທີ່ບໍ່ມີຄ່າເລີ່ມຕົ້ນ

source: Show observations about
lo: ສະແດງຂໍ້ສັງເກດກ່ຽວກັບ

# lazarusidestrconsts.liscestylegroup
source: Style
lo: ຮູບແບບ

source: Surrounding
lo: ອ້ອມຮອບ

source: Types
lo: ປະເພດ

source: Unnamed constants
lo: ຄ່າຄົງທີ່ບໍ່ມີຊື່

source: Unsorted members
lo: ສະມາຊິກທີ່ບໍ່ໄດ້ຈັດລຽງ

source: Unsorted visibility
lo: ການເບິ່ງເຫັນທີ່ບໍ່ໄດ້ຈັດລຽງ

source: Variables
lo: ຕົວປ່ຽນ

source: Wrong indentation
lo: ການຫຍໍ້ໜ້າຜິດ

source: An exception occurred during deletion of%s"%s:%s"%s%s
lo: ເກີດຂໍ້ຍົກເວັ້ນຂຶ້ນລະຫວ່າງການລຶບ%s"%s:%s"%s%s

source: Do not know how to copy this form editing selection
lo: ບໍ່ຮູ້ວິທີສຳເນົາການເລືອກແກ້ໄຂຟອມນີ້

source: Do not know how to cut this form editing selection
lo: ບໍ່ຮູ້ວິທີຕັດການເລືອກແກ້ໄຂຟອມນີ້

source: Do not know how to delete this form editing selection
lo: ບໍ່ຮູ້ວິທີລຶບການເລືອກແກ້ໄຂຟອມນີ້

source: Error creating component
lo: ເກີດຂໍ້ຜິດພາດໃນການສ້າງອົງປະກອບ

source: Error creating component: %s%s%s
lo: ເກີດຂໍ້ຜິດພາດໃນການສ້າງອົງປະກອບ: %s%s%s

source: Error destroying component
lo: ເກີດຂໍ້ຜິດພາດໃນການທຳລາຍອົງປະກອບ

source: Error destroying component of type %s of unit %s:%s%s
lo: ເກີດຂໍ້ຜິດພາດໃນການທຳລາຍອົງປະກອບປະເພດ %s ຂອງຢູນິດ %s:%s%s

source: Error destroying mediator
lo: ເກີດຂໍ້ຜິດພາດໃນການທຳລາຍ mediator

source: Error destroying mediator %s of unit %s:%s%s
lo: ເກີດຂໍ້ຜິດພາດໃນການທຳລາຍ mediator %s ຂອງຢູນິດ %s:%s%s

source: In file %s
lo: ໃນຟາຍລ໌ %s

source: Invalid component owner
lo: ເຈົ້າຂອງອົງປະກອບບໍ່ຖືກຕ້ອງ

source: TCustomFormEditor.CreateNonFormForm already exists
lo: TCustomFormEditor.CreateNonFormForm ມີຢູ່ແລ້ວ

source: TCustomFormEditor.CreateNonFormForm Unknown type %s
lo: TCustomFormEditor.CreateNonFormForm ບໍ່ຮູ້ຈັກປະເພດ %s

source: TCustomFormEditor.DeleteComponent Where is the TCustomNonFormDesignerForm? %s
lo: TCustomFormEditor.DeleteComponent TCustomNonFormDesignerForm ຢູ່ໃສ? %s

source: TCustomFormEditor.RegisterDesignerMediator already registered: %s
lo: TCustomFormEditor.RegisterDesignerMediator ລົງທະບຽນແລ້ວ: %s

source: The component editor of class "%s"has created the error:%s"%s"
lo: ຕົວແກ້ໄຂອົງປະກອບຂອງຄລາສ "%s" ໄດ້ສ້າງຂໍ້ຜິດພາດ:%s"%s"

source: The component of type %s failed to set its owner to %s:%s
lo: ອົງປະກອບປະເພດ %s ລົ້ມເຫຼວໃນການຕັ້ງເຈົ້າຂອງເປັນ %s:%s

source: Unable to clear the form editing selection%s%s
lo: ບໍ່ສາມາດລຶບລ້າງການເລືອກແກ້ໄຂຟອມໄດ້%s%s

# lazarusidestrconsts.lischange
source: Change
lo: ປ່ຽນ

source: Change build mode
lo: ປ່ຽນໂໝດການສ້າງ

source: Change Class
lo: ປ່ຽນຄລາສ

source: Changed %s coord of %s from "%d" to "%d" inside %s.
lo: ປ່ຽນພິກັດ %s ຂອງ %s ຈາກ "%d" ເປັນ "%d" ພາຍໃນ %s.

source: Change Encoding
lo: ປ່ຽນການເຂົ້າລະຫັດ

source: Change file
lo: ປ່ຽນຟາຍລ໌

source: Change Parent
lo: ປ່ຽນ Parent

source: Changes were not saved
lo: ການປ່ຽນແປງບໍ່ໄດ້ຖືກບັນທຶກ

source: Change to Unix /
lo: ປ່ຽນເປັນ Unix /

source: Change to Windows \
lo: ປ່ຽນເປັນ Windows \

source: Check All
lo: ເລືອກທັງໝົດ

source: Please make sure that the path to the compiler in the IDE options is correct.
lo: ກະລຸນາກວດສອບໃຫ້ແນ່ໃຈວ່າ path ໄປຫາຄອມໄພເລີໃນຕົວເລືອກ IDE ນັ້ນຖືກຕ້ອງ.

# lazarusidestrconsts.lischeckfordiskfilechangesviacontent
source: Check for disk file changes via content rather than timestamp
lo: ກວດສອບການປ່ຽນແປງຟາຍລ໌ໃນດິດຜ່ານເນື້ອຫາແທນທີ່ຈະເປັນເວລາ (timestamp)

source: . Check if package %s creates %s.ppu, check nothing deletes this file and check that no two packages have access to the unit source.
lo: . ກວດສອບວ່າແພັກເກດ %s ສ້າງ %s.ppu ຫຼື ບໍ່, ກວດສອບວ່າບໍ່ມີຫຍັງລຶບຟາຍລ໌ນີ້ ແລະ ກວດສອບວ່າບໍ່ມີສອງແພັກເກດເຂົ້າເຖິງຊອດໂຄດຂອງຢູນິດ.

# lazarusidestrconsts.lischeckifpackageisinthedependencies
source: . Check if package %s is in the dependencies
lo: . ກວດສອບວ່າແພັກເກດ %s ຢູ່ໃນ dependencies ຫຼື ບໍ່

source: Check if the next token in source is an "end" and if not return "LineEnding + end; + LineEnding".
lo: ກວດສອບວ່າ token ຕໍ່ໄປໃນຊອດໂຄດແມ່ນ "end" ຫຼື ບໍ່ ແລະ ຖ້າບໍ່ແມ່ນ ໃຫ້ສົ່ງຄ່າ "LineEnding + end; + LineEnding".

source: Check options
lo: ຕົວເລືອກການກວດສອບ

# lazarusidestrconsts.lischecksearchpathpackagetryacleanrebuildcheckimpleme
source: . Check search path of package %s, try a clean rebuild, check implementation uses sections.
lo: . ກວດສອບ path ຄົ້ນຫາຂອງແພັກເກດ %s, ລອງ clean rebuild, ກວດສອບພາກສ່ວນ implementation uses.

source: Check the next token in source and add a semicolon if needed.
lo: ກວດສອບ token ຕໍ່ໄປໃນຊອດໂຄດ ແລະ ເພີ່ມ semicolon ຖ້າຈຳເປັນ.

source: %s Check the target (OS, CPU, LCL widget type). Maybe you have to recompile the package for this target or set another target for the project.
lo: %s ກວດສອບເປົ້າໝາຍ (OS, CPU, LCL widget type). ບາງທີເຈົ້າອາດຈະຕ້ອງ recompile ແພັກເກດສຳລັບເປົ້າໝາຍນີ້ ຫຼື ຕັ້ງເປົ້າໝາຍອື່ນສຳລັບໂຄງການ.

source: Check/uncheck all
lo: ເລືອກ/ບໍ່ເລືອກທັງໝົດ

# lazarusidestrconsts.lischooseadifferentname
source: Choose a different name
lo: ເລືອກຊື່ອື່ນ

# lazarusidestrconsts.lischooseadifferentname2
source: Choose a different name
lo: ເລືອກຊື່ອື່ນ

source: Choose a file with CodeTools templates
lo: ເລືອກຟາຍລ໌ທີ່ມີແມ່ແບບ CodeTools

source: Choose a FPDoc link
lo: ເລືອກລິ້ງ FPDoc

source: Choose a key ...
lo: ເລືອກ key ...

source: Choose a name for the component
lo: ເລືອກຊື່ສຳລັບອົງປະກອບ

source: Choose an example file
lo: ເລືອກຟາຍລ໌ຕົວຢ່າງ

source: Choose an FPC message file
lo: ເລືອກຟາຍລ໌ຂໍ້ຄວາມ FPC

source: Choose a Pascal file for indentation examples
lo: ເລືອກຟາຍລ໌ Pascal ສຳລັບຕົວຢ່າງການຫຍໍ້ໜ້າ

source: Choose compiler executable (%s)
lo: ເລືອກໄຟລ໌ຄອມໄພເລີທີ່ປະຕິບັດການໄດ້ (%s)

source: Choose compiler messages file
lo: ເລືອກຟາຍລ໌ຂໍ້ຄວາມຄອມໄພເລີ

source: Choose debugger executable
lo: ເລືອກໄຟລ໌ດີບັກເກີທີ່ປະຕິບັດການໄດ້

source: Choose Delphi package (*.dpk)
lo: ເລືອກແພັກເກດ Delphi (*.dpk)

source: Choose Delphi project (*.dpr)
lo: ເລືອກໂຄງການ Delphi (*.dpr)

source: Choose Delphi unit (*.pas)
lo: ເລືອກຢູນິດ Delphi (*.pas)

source: Choose directory
lo: ເລືອກໄດເຣັກທໍຣີ

source: Choose an executable
lo: ເລືອກໄຟລ໌ທີ່ປະຕິບັດການໄດ້

source: Choose FPC source directory
lo: ເລືອກໄດເຣັກທໍຣີຊອດໂຄດ FPC

source: Choose the fppkg configuration file
lo: ເລືອກຟາຍລ໌ການຕັ້ງຄ່າ fppkg

source: Choose Lazarus Directory
lo: ເລືອກໄດເຣັກທໍຣີ Lazarus

source: Choose "make" executable
lo: ເລືອກໄຟລ໌ "make" ທີ່ປະຕິບັດການໄດ້

source: Choose name and text
lo: ເລືອກຊື່ ແລະ ຂໍ້ຄວາມ

source: Choose one of these items to create a new File
lo: ເລືອກໜຶ່ງໃນລາຍການເຫຼົ່ານີ້ເພື່ອສ້າງຟາຍລ໌ໃໝ່

source: Choose one of these items to create a new Package
lo: ເລືອກໜຶ່ງໃນລາຍການເຫຼົ່ານີ້ເພື່ອສ້າງແພັກເກດໃໝ່

source: Choose one of these items to create a new Project
lo: ເລືອກໜຶ່ງໃນລາຍການເຫຼົ່ານີ້ເພື່ອສ້າງໂຄງການໃໝ່

source: Choose one of these items to inherit from an existing one
lo: ເລືອກໜຶ່ງໃນລາຍການເຫຼົ່ານີ້ເພື່ອສືບທອດຈາກອັນທີ່ມີຢູ່

source: Choose program source (*.pp,*.pas,*.lpr)
lo: ເລືອກຊອດໂຄດໂປຣແກຣມ (*.pp,*.pas,*.lpr)

source: Choose structure to enclose selection
lo: ເລືອກໂຄງສ້າງເພື່ອປິດລ້ອມສ່ວນທີ່ເລືອກ

source: Choose the directory for tests
lo: ເລືອກໄດເຣັກທໍຣີສຳລັບການທົດສອບ

source: Circular dependency detected
lo: ກວດພົບການເພິ່ງພາອາໄສແບບວົງມົນ (Circular dependency)

source: &Class
lo: &ຄລາສ

source: Class Completion
lo: ການເຕີມເຕັມຄລາສ

source: Classes and properties exist. Values were not checked.
lo: ຄລາສ ແລະ ຄຸນສົມບັດມີຢູ່ແລ້ວ. ຄ່າບໍ່ໄດ້ຖືກກວດສອບ.

source: Class "%s" is not a registered component class.%sUnable to paste.
lo: ຄລາສ "%s" ບໍ່ແມ່ນຄລາສອົງປະກອບທີ່ລົງທະບຽນ.%sບໍ່ສາມາດວາງໄດ້.

source: Class not found
lo: ບໍ່ພົບຄລາສ

source: Class %s not found at %s(%s,%s)
lo: ບໍ່ພົບຄລາສ %s ທີ່ %s(%s,%s)

source: Class "%s" of method "%s" not found.
lo: ບໍ່ພົບຄລາສ "%s" ຂອງ method "%s".

source: Clean
lo: ລ້າງ

source: Clean Directory
lo: ລ້າງໄດເຣັກທໍຣີ

source: Clean sub directories
lo: ລ້າງໄດເຣັກທໍຣີຍ່ອຍ

source: Keep all text files
lo: ເກັບຮັກສາຟາຍລ໌ຂໍ້ຄວາມທັງໝົດ

source: Keep files matching filter
lo: ເກັບຮັກສາຟາຍລ໌ທີ່ກົງກັບຕົວຄັດຕອງ

source: Remove files matching filter
lo: ລຶບຟາຍລ໌ທີ່ກົງກັບຕົວຄັດຕອງ

source: Simple Syntax (e.g. * instead of .*)
lo: Syntax ແບບງ່າຍ (ເຊັ່ນ: * ແທນ .*)

source: &Clean all
lo: &ລ້າງທັງໝົດ

source: Clean Lazarus Source
lo: ລ້າງຊອດໂຄດ Lazarus

source: Switch to "automatic" mode after building
lo: ປ່ຽນເປັນໂໝດ "ອັດຕະໂນມັດ" ຫຼັງຈາກສ້າງ

# lazarusidestrconsts.liscleanupandbuild
source: Clean up and build
lo: ລ້າງ ແລະ ສ້າງ

source: Clean up and build project
lo: ລ້າງ ແລະ ສ້າງໂຄງການ

source: Clean up + lazbuild
lo: ລ້າງ + lazbuild

source: Clean up mode
lo: ໂໝດການລ້າງ

source: Clean up package "%s".
lo: ລ້າງແພັກເກດ "%s".

source: Clean up unit path?
lo: ລ້າງ path ຂອງຢູນິດບໍ່?

# lazarusidestrconsts.lisclear
source: Clear
lo: ລຶບລ້າງ

source: Clear Directory?
lo: ລຶບລ້າງໄດເຣັກທໍຣີບໍ່?

source: Clear filter
lo: ລຶບຕົວຄັດຕອງ

source: Clear the filter for options
lo: ລຶບຕົວຄັດຕອງສຳລັບຕົວເລືອກ

source: Click here to browse the file
lo: ຄິກບ່ອນນີ້ເພື່ອເບິ່ງຟາຍລ໌

source: Click to see the choices
lo: ຄິກເພື່ອເບິ່ງຕົວເລືອກ

source: Click to Select Palette Page
lo: ຄິກເພື່ອເລືອກໜ້າພາເລັດ

source: Clone
lo: ໂຄລນ

# lazarusidestrconsts.lisclose
source: Close
lo: ປິດ

source: Close All Checked
lo: ປິດທີ່ເລືອກທັງໝົດ

source: Close files
lo: ປິດຟາຍລ໌

# lazarusidestrconsts.lisclosealltabshide
source: Hide window
lo: ເຊື່ອງປ່ອງຢ້ຽມ

source: Closing a Source Editor Window. Do you want close all files or hide the window?
lo: ກຳລັງປິດປ່ອງຢ້ຽມແກ້ໄຂຊອດໂຄດ. ເຈົ້າຕ້ອງການປິດຟາຍລ໌ທັງໝົດ ຫຼື ເຊື່ອງປ່ອງຢ້ຽມ?

source: Close Source Editor Window
lo: ປິດປ່ອງຢ້ຽມແກ້ໄຂຊອດໂຄດ

source: LCL Interface specific options:
lo: ຕົວເລືອກສະເພາະຂອງ LCL Interface:

source: Parameter
lo: ພາຣາມິເຕີ

# lazarusidestrconsts.liscmplstcomponents
source: Components
lo: ອົງປະກອບ

source: Inheritance
lo: ການສືບທອດ

source: List
lo: ລາຍການ

source: Palette
lo: ພາເລັດ

source: Pages
lo: ໜ້າ

source: Palette is &visible
lo: ສະແດງພາເລັດ

source: &Restore defaults
lo: &ຄືນຄ່າເລີ່ມຕົ້ນ

source: Ambiguous additional compiler config file
lo: ຟາຍລ໌ການຕັ້ງຄ່າຄອມໄພເລີເພີ່ມເຕີມບໍ່ຈະແຈ້ງ

source: Call on:
lo: ເອີ້ນໃຊ້ທີ່:

source: %s%sClick OK if you definitely want to do that.
lo: %s%sຄິກ OK ຖ້າເຈົ້າຕ້ອງການເຮັດສິ່ງນັ້ນແທ້ໆ.

# lazarusidestrconsts.liscocommand
source: Command:
lo: ຄຳສັ່ງ:

source: Code
lo: ໂຄດ

# lazarusidestrconsts.liscodebrowser
source: Code Browser
lo: ຕົວທ່ອງໂຄດ

source: Code creation options
lo: ຕົວເລືອກການສ້າງໂຄດ

source: Class section
lo: ສ່ວນຄລາສ

# lazarusidestrconsts.liscodecreationdialoglocation
source: Location
lo: ຕຳແໜ່ງ

source: Code generation options
lo: ຕົວເລືອກການສ້າງໂຄດ

source: Add path
lo: ເພີ່ມ path

# lazarusidestrconsts.liscodehelpbrowseexamplebutton
source: Browse
lo: ເບິ່ງ

source: Confirm replace
lo: ຢືນຢັນການແທນທີ່

source: Create help item
lo: ສ້າງລາຍການຊ່ວຍເຫຼືອ

source: Remove path
lo: ລຶບ path

# lazarusidestrconsts.liscodehelpdescrtag
source: Description
lo: ຄຳອະທິບາຍ

# lazarusidestrconsts.liscodehelperrorstag
source: Errors
lo: ຂໍ້ຜິດພາດ

source: Example
lo: ຕົວຢ່າງ

source: FPDoc settings
lo: ການຕັ້ງຄ່າ FPDoc

source: Insert bold formatting tag
lo: ແຊກແທັກຮູບແບບຕົວໜາ

source: Insert code formatting tag
lo: ແຊກແທັກຮູບແບບໂຄດ

source: Insert italic formatting tag
lo: ແຊກແທັກຮູບແບບຕົວອ່ຽງ

source: Insert remark formatting tag
lo: ແຊກແທັກຮູບແບບໝາຍເຫດ

source: Insert underline formatting tag
lo: ແຊກແທັກຮູບແບບຂີດກ້ອງ

source: Insert var formatting tag
lo: ແຊກແທັກຮູບແບບ var

# lazarusidestrconsts.liscodehelpinherited
source: Inherited
lo: ສືບທອດ

source: Insert a link ...
lo: ແຊກລິ້ງ ...

source: Insert paragraph formatting tag
lo: ແຊກແທັກຮູບແບບຫຍໍ້ໜ້າ

# lazarusidestrconsts.liscodehelpmainformcaption
source: FPDoc Editor
lo: ຕົວແກ້ໄຂ FPDoc

source: (no inherited description found)
lo: (ບໍ່ພົບຄຳອະທິບາຍທີ່ສືບທອດມາ)

source: <NONE>
lo: <ບໍ່ມີ>

source: See also
lo: ເບິ່ງເພີ່ມເຕີມ

source: Short description of
lo: ຄຳອະທິບາຍສັ້ນຂອງ

source: Short
lo: ສັ້ນ

# lazarusidestrconsts.liscodeobignoreconstinfuncs
source: Ignore constants in next functions
lo: ບໍ່ສົນໃຈຄ່າຄົງທີ່ໃນຟັງຊັນຕໍ່ໄປ

# lazarusidestrconsts.liscodeobscharconst
source: Search for unnamed char constants
lo: ຄົ້ນຫາຄ່າຄົງທີ່ char ທີ່ບໍ່ມີຊື່

source: Code Observer
lo: ຜູ້ສັງເກດໂຄດ

# lazarusidestrconsts.liscodeobsignoreeconstants
source: Ignore next unnamed constants
lo: ບໍ່ສົນໃຈຄ່າຄົງທີ່ບໍ່ມີຊື່ຖັດໄປ

# lazarusidestrconsts.liscodetempladd
source: Add template ...
lo: ເພີ່ມແມ່ແບບ ...

source: Add code template
lo: ເພີ່ມແມ່ແບບໂຄດ

source: Auto complete on
lo: Auto complete ເປີດຢູ່

source: Comment:
lo: ຄອມເມັ້ນ:

source: Edit code template
lo: ແກ້ໄຂແມ່ແບບໂຄດ

# lazarusidestrconsts.liscodetemplerror
source: Error
lo: ຂໍ້ຜິດພາດ

source: A token already exists.
lo: token ມີຢູ່ແລ້ວ.

source: The token cannot be empty.
lo: The token ບໍ່ສາມາດຫວ່າງເປົ່າໄດ້.

source: The token can only contain Latin letters, numbers and underscores, and cannot begin with a number.
lo: The token ສາມາດມີຕົວອັກສອນລາຕິນ, ຕົວເລກ ແລະ underscore ເທົ່ານັ້ນ, ແລະ ບໍ່ສາມາດເລີ່ມຕົ້ນ ດ້ວຍຕົວເລກ.

source: Action: %s
lo: ການກະທຳ: %s

source: Auto created nodes cannot be edited,%snor can they have non auto created child nodes.
lo: ໂນດທີ່ສ້າງອັດຕະໂນມັດບໍ່ສາມາດແກ້ໄຂໄດ້,%sແລະ ບໍ່ສາມາດມີ child nodes ທີ່ບໍ່ໄດ້ສ້າງອັດຕະໂນມັດ.

source: %s, auto generated
lo: %s, ສ້າງອັດຕະໂນມັດ

source: Auto generated nodes cannot be edited.
lo: ໂນດທີ່ສ້າງອັດຕະໂນມັດບໍ່ສາມາດແກ້ໄຂໄດ້.

source: Block
lo: ບຼັອກ

source: CodeTools Defines Editor
lo: ຕົວແກ້ໄຂ CodeTools Defines

source: Compiler path
lo: Path ຂອງຄອມໄພເລີ

source: Convert node
lo: ແປງໂນດ

source: Create Defines for %s Directory
lo: ສ້າງ Defines ສຳລັບໄດເຣັກທໍຣີ %s

source: Create Defines for Free Pascal Compiler
lo: ສ້າງ Defines ສຳລັບ Free Pascal Compiler

source: Create Defines for Free Pascal Git Sources
lo: ສ້າງ Defines ສຳລັບ Free Pascal Git Sources

source: Create Defines for %s Project
lo: ສ້າງ Defines ສຳລັບໂຄງການ %s

source: Create FPC Macros and paths for a fpc project directory
lo: ສ້າງ FPC Macros ແລະ paths ສຳລັບໄດເຣັກທໍຣີໂຄງການ fpc

source: Delete node
lo: ລຶບໂນດ

source: The %s main directory,%swhere Borland has installed all %s sources.%sFor example: C:/Programme/Borland/Delphi%s
lo: ໄດເຣັກທໍຣີຫຼັກ %s,%sບ່ອນທີ່ Borland ໄດ້ຕິດຕັ້ງຊອດໂຄດ %s ທັງໝົດ.%sຕົວຢ່າງ: C:/Programme/Borland/Delphi%s

source: The %s main directory,%swhere Borland has installed all %s sources,%swhich are used by this %s project.%sFor example: C:/Programme/Borland/Delphi%s
lo: ໄດເຣັກທໍຣີຫຼັກ %s,%sບ່ອນທີ່ Borland ໄດ້ຕິດຕັ້ງຊອດໂຄດ %s ທັງໝົດ,%sເຊິ່ງໃຊ້ ໂດຍໂຄງການ %s ນີ້.%sຕົວຢ່າງ: C:/Programme/Borland/Delphi%s

source: Description:
lo: ຄຳອະທິບາຍ:

source: %s directory
lo: ໄດເຣັກທໍຣີ %s

source: FPC Git source directory
lo: ໄດເຣັກທໍຣີຊອດໂຄດ FPC Git

source: Directory
lo: ໄດເຣັກທໍຣີ

source: Insert Delphi 5 Compiler Template
lo: ແຊກແມ່ແບບຄອມໄພເລີ Delphi 5

source: Insert Delphi 5 Directory Template
lo: ແຊກແມ່ແບບໄດເຣັກທໍຣີ Delphi 5

source: Insert Delphi 5 Project Template
lo: ແຊກແມ່ແບບໂຄງການ Delphi 5

source: Insert Delphi 6 Compiler Template
lo: ແຊກແມ່ແບບຄອມໄພເລີ Delphi 6

source: Insert Delphi 6 Directory Template
lo: ແຊກແມ່ແບບໄດເຣັກທໍຣີ Delphi 6

source: Insert Delphi 6 Project Template
lo: ແຊກແມ່ແບບໂຄງການ Delphi 6

source: Insert Delphi 7 Compiler Template
lo: ແຊກແມ່ແບບຄອມໄພເລີ Delphi 7

source: Insert Delphi 7 Directory Template
lo: ແຊກແມ່ແບບໄດເຣັກທໍຣີ Delphi 7

source: Insert Delphi 7 Project Template
lo: ແຊກແມ່ແບບໂຄງການ Delphi 7

source: Insert Free Pascal Compiler Template
lo: ແຊກແມ່ແບບ Free Pascal Compiler

source: Insert Free Pascal Project Template
lo: ແຊກແມ່ແບບໂຄງການ Free Pascal

source: Insert Free Pascal Git Source Template
lo: ແຊກແມ່ແບບຊອດໂຄດ Free Pascal Git

source: Insert Kylix 3 Compiler Template
lo: ແຊກແມ່ແບບຄອມໄພເລີ Kylix 3

source: Insert Kylix 3 Directory Template
lo: ແຊກແມ່ແບບໄດເຣັກທໍຣີ Kylix 3

source: Insert Kylix 3 Project Template
lo: ແຊກແມ່ແບບໂຄງການ Kylix 3

source: Insert node as child
lo: ແຊກໂນດເປັນ child

source: Insert node below
lo: ແຊກໂນດທາງລຸ່ມ

source: Insert Template
lo: ແຊກແມ່ແບບ

source: Invalid parent
lo: Parent ບໍ່ຖືກຕ້ອງ

source: Invalid parent node
lo: Parent node ບໍ່ຖືກຕ້ອງ

source: Invalid previous node
lo: Previous node ບໍ່ຖືກຕ້ອງ

source: The %s main directory,%swhere Borland has installed all %s sources.%sFor example: /home/user/kylix%s
lo: ໄດເຣັກທໍຣີຫຼັກ %s,%sບ່ອນທີ່ Borland ໄດ້ຕິດຕັ້ງຊອດໂຄດ %s ທັງໝົດ.%sຕົວຢ່າງ: /home/user/kylix%s

source: The %s main directory,%swhere Borland has installed all %s sources,%swhich are used by this %s project.%sFor example: /home/user/kylix%s
lo: ໄດເຣັກທໍຣີຫຼັກ %s,%sບ່ອນທີ່ Borland ໄດ້ຕິດຕັ້ງຊອດໂຄດ %s ທັງໝົດ,%sເຊິ່ງໃຊ້ ໂດຍໂຄງການ %s ນີ້.%sຕົວຢ່າງ: /home/user/kylix%s

source: Move node down
lo: ຍ້າຍໂນດລົງ

source: Move node one level down
lo: ຍ້າຍໂນດລົງໜຶ່ງລະດັບ

source: Move node one level up
lo: ຍ້າຍໂນດຂຶ້ນໜຶ່ງລະດັບ

source: Move node up
lo: ຍ້າຍໂນດຂຶ້ນ

# lazarusidestrconsts.liscodetoolsdefsname
source: Name:
lo: ຊື່:

source: NewNode
lo: ໂນດໃໝ່

source: Node is readonly
lo: ໂນດອ່ານໄດ້ຢ່າງດຽວ

source: none selected
lo: ບໍ່ໄດ້ເລືອກອັນໃດ

source: Parent node cannot contain child nodes.
lo: Parent node ບໍ່ສາມາດບັນຈຸ child nodes ໄດ້.

source: Previous node can not contain child nodes.
lo: Previous node ບໍ່ສາມາດບັນຈຸ child nodes ໄດ້.

# lazarusidestrconsts.liscodetoolsdefsprojectdirectory
source: Project directory
lo: ໄດເຣັກທໍຣີໂຄງການ

source: %s project directory
lo: ໄດເຣັກທໍຣີໂຄງການ %s

source: Selected Node:
lo: ໂນດທີ່ເລືອກ:

source: The Free Pascal Git source directory. Not required. This will improve find declaration and debugging.
lo: ໄດເຣັກທໍຣີຊອດໂຄດ Free Pascal Git. ບໍ່ຈຳເປັນ. ອັນນີ້ຈະຊ່ວຍປັບປຸງການຊອກຫາ declaration ແລະ ການດີບັກ.

source: The Free Pascal project directory.
lo: ໄດເຣັກທໍຣີໂຄງການ Free Pascal.

source: The Free Pascal Git source directory.
lo: ໄດເຣັກທໍຣີຊອດໂຄດ Free Pascal Git.

source: The path to the Free Pascal compiler.%s For example %s/usr/bin/%s -n%s or %s/usr/local/bin/fpc @/etc/fpc.cfg%s.
lo: The path ໄປຫາ Free Pascal compiler.%s ຕົວຢ່າງ %s/usr/bin/%s -n%s ຫຼື %s/usr/local/bin/fpc @/etc/fpc.cfg%s.

source: The path to the Free Pascal compiler for this project. Only required if you set the FPC Git source below. Used to autocreate macros.
lo: The path ໄປຫາ Free Pascal compiler ສຳລັບໂຄງການນີ້. ຈຳເປັນສະເພາະຖ້າເຈົ້າຕັ້ງ FPC Git source ດ້ານລຸ່ມ. ໃຊ້ເພື່ອສ້າງ macros ອັດຕະໂນມັດ.

source: The path to the Free Pascal compiler for this source.%sUsed to autocreate macros.
lo: The path ໄປຫາ Free Pascal compiler ສຳລັບຊອດໂຄດນີ້.%sໃຊ້ເພື່ອສ້າງ macros ອັດຕະໂນມັດ.

source: The %s project directory,%swhich contains the .dpr, dpk file.
lo: ໄດເຣັກທໍຣີໂຄງການ %s,%sເຊິ່ງບັນຈຸຟາຍລ໌ .dpr, dpk.

source: Undefine All
lo: Undefine ທັງໝົດ

source: Value as File Paths
lo: ຄ່າເປັນ File Paths

source: Value as Text
lo: ຄ່າເປັນຂໍ້ຄວາມ

source: %s:%svalue "%s" is invalid.
lo: %s:%sຄ່າ "%s" ບໍ່ຖືກຕ້ອງ.

source: Variable:
lo: ຕົວປ່ຽນ:

source: At
lo: ທີ່

source: Bracket
lo: ວົງເລັບ

source: Comma
lo: ຈຸດ (Comma)

# lazarusidestrconsts.liscodetoolsoptscomment
source: Comment
lo: ຄອມເມັ້ນ

source: Newline
lo: ແຖວໃໝ່

# lazarusidestrconsts.liscodetoolsoptsnone
source: None
lo: ບໍ່ມີ

source: Number
lo: ຕົວເລກ

source: Point
lo: ຈຸດ

# lazarusidestrconsts.liscodetoolsoptsspace
source: Space
lo: ຍະຫວ່າງ

source: Symbol
lo: ສັນຍາລັກ

source: Execute after
lo: ປະຕິບັດການຫຼັງຈາກ

source: Execute before
lo: ປະຕິບັດການກ່ອນ

source: Collapse
lo: ຫຍໍ້

source: Collapse All [Ctrl+Minus]
lo: ຫຍໍ້ທັງໝົດ [Ctrl+Minus]

source: Collapse All
lo: ຫຍໍ້ທັງໝົດ

source: Collapse all classes
lo: ຫຍໍ້ຄລາສທັງໝົດ

source: Collapse all packages
lo: ຫຍໍ້ແພັກເກດທັງໝົດ

source: Collapse all units
lo: ຫຍໍ້ຢູນິດທັງໝົດ

source: Combo Boxes
lo: ກ່ອງ Combo

# lazarusidestrconsts.liscommandlineparameters
source: Command line parameters
lo: ພາຣາມິເຕີ Command line

source: Command line parameters of program
lo: ພາຣາມິເຕີ Command line ຂອງໂປຣແກຣມ

# lazarusidestrconsts.liscompile
source: Compile
lo: ຄອມໄພລ໌

source: Compile and do not ask again
lo: ຄອມໄພລ໌ ແລະ ບໍ່ຕ້ອງຖາມອີກ

source: Compile the following modes
lo: ຄອມໄພລ໌ໂໝດຕໍ່ໄປນີ້

source: Compile normally
lo: ຄອມໄພລ໌ແບບປົກກະຕິ

source: Compile package twice and check if any unit was compiled again.
lo: ຄອມໄພລ໌ແພັກເກດສອງເທື່ອ ແລະ ກວດສອບວ່າມີຢູນິດໃດຖືກຄອມໄພລ໌ອີກຄັ້ງບໍ່.

source: Compiler
lo: ຄອມໄພເລີ

source: %s is missing.
lo: %s ຂາດຫາຍໄປ.

source: Compiler "%s" does not support target %s-%s
lo: ຄອມໄພເລີ "%s" ບໍ່ຮອງຮັບເປົ້າໝາຍ %s-%s

source: Compiler filename
lo: ຊື່ຟາຍລ໌ຄອມໄພເລີ

source: Compiler messages file not found:%s%s
lo: ບໍ່ພົບຟາຍລ໌ຂໍ້ຄວາມຄອມໄພເລີ:%s%s

source: NOTE: codetools config file not found - using defaults
lo: ໝາຍເຫດ: ບໍ່ພົບຟາຍລ໌ການຕັ້ງຄ່າ codetools - ໃຊ້ຄ່າເລີ່ມຕົ້ນ
