Repository: fpc/Lazarus
Catalog: languages/lazaruside.*.po
Languages: lo

source: View Registers
lo: ສະແດງ ຣີຈິດສເຕີ

source: Toggle view Search Results
lo: ເປີດ/ປິດ ການສະແດງ ຜົນການຄົ້ນຫາ

source: Toggle view Source Editor
lo: ເປີດ/ປິດ ການສະແດງ ຕົວແກ້ໄຂຊອດໂຄດ

# lazarusidestrconsts.liskmtoggleviewthreads
source: View Threads
lo: ສະແດງ Threads

source: View Watches
lo: ສະແດງ Watches

source: View jump history
lo: ສະແດງ ປະຫວັດການຂ້າມ

source: View project options
lo: ສະແດງ ຕົວເລືອກໂຄງການ

source: View Project Source
lo: ສະແດງ ຕົ້ນສະບັບໂຄງການ

source: View Unit Info
lo: ສະແດງ ຂໍ້ມູນຢູນິດ

source: Last opened
lo: ເປີດລ່າສຸດ

source: Launching application invalid
lo: ການເປີດແອັບພລິເຄຊັນບໍ່ຖືກຕ້ອງ

source: Launching target command line
lo: ກຳລັງເປີດຄຳສັ່ງເປົ້າໝາຍ

source: Lazarus Default
lo: ຄ່າເລີ່ມຕົ້ນ Lazarus

source: Lazarus directory
lo: ໄດເຣັກທໍຣີ Lazarus

source: Lazarus sources. This path is relative to primary config directory (%s).
lo: ແຫຼ່ງຂໍ້ມູນ Lazarus. ເສັ້ນທາງນີ້ກ່ຽວຂ້ອງກັບໄດເຣັກທໍຣີການຕັ້ງຄ່າຫຼັກ (%s).

source: Directory to be used as a basedirectory.
lo: ໄດເຣັກທໍຣີທີ່ຈະໃຊ້ເປັນໄດເຣັກທໍຣີພື້ນຖານ.

source: Lazarus IDE v%s
lo: Lazarus IDE ເວີຊັນ %s

source: Lazarus language ID (e.g. en, de, br, fi)
lo: ລະຫັດພາສາ Lazarus (ເຊັ່ນ: en, de, br, fi)

source: Lazarus language name (e.g. english, deutsch)
lo: ຊື່ພາສາ Lazarus (ເຊັ່ນ: english, deutsch)

source: lazarus [options] <project-filename>
lo: lazarus [options] <ຊື່ໄຟລ໌ໂຄງການ>

source: Choose output directory of the IDE executable
lo: ເລືອກໄດເຣັກທໍຣີຜົນລັບຂອງ IDE executable

source: Are you sure you want to delete this build profile?
lo: ເຈົ້າແນ່ໃຈບໍ່ວ່າຕ້ອງການລຶບໂປຣໄຟລ໌ການສ້າງນີ້?

source: Build &Many
lo: ສ້າງ &ຫຼາຍອັນ

source: Common Settings
lo: ການຕັ້ງຄ່າທົ່ວໄປ

source: Confirm before build
lo: ຢືນຢັນກ່ອນສ້າງ

source: Confirm deletion
lo: ຢືນຢັນການລຶບ

source: Debug IDE
lo: ດີບັກ IDE

source: Defines without -d
lo: Defines ໂດຍບໍ່ມີ -d

# lazarusidestrconsts.lislazbuildeditdefines
source: Edit Defines
lo: ແກ້ໄຂ Defines

source: Edit list of defines which can be used by any profile
lo: ແກ້ໄຂລາຍຊື່ Defines ທີ່ສາມາດໃຊ້ໄດ້ກັບທຸກໂປຣໄຟລ໌

# lazarusidestrconsts.lislazbuilderrorwritingfile
source: Error writing file
lo: ເກີດຂໍ້ຜິດພາດໃນການຂຽນໄຟລ໌

source: %s%s%s%slazbuild is non interactive, aborting now.
lo: %s%s%s%slazbuild ບໍ່ສາມາດໂຕ້ຕອບໄດ້, ກຳລັງຍົກເລີກດຽວນີ້.

source: Manage Build Profiles
lo: ຈັດການໂປຣໄຟລ໌ການສ້າງ

source: Manage profiles
lo: ຈັດການໂປຣໄຟລ໌

source: Name of the active profile
lo: ຊື່ຂອງໂປຣໄຟລ໌ທີ່ໃຊ້ງານຢູ່

source: Add New Profile
lo: ເພີ່ມໂປຣໄຟລ໌ໃໝ່

source: Current build options will be associated with:
lo: ຕົວເລືອກການສ້າງປັດຈຸບັນຈະຖືກເຊື່ອມໂຍງກັບ:

source: Normal IDE
lo: IDE ປົກກະຕິ

source: Optimized IDE
lo: IDE ທີ່ປັບແຕ່ງແລ້ວ

source: &Options:
lo: &ຕົວເລືອກ:

source: Options passed to compiler
lo: ຕົວເລືອກທີ່ສົ່ງໄປຍັງຄອມໄພເລີ

source: lazbuild [options] <project/package filename or package name>
lo: lazbuild [options] <ຊື່ໄຟລ໌ໂຄງການ/ແພັກເກັດ ຫຼື ຊື່ແພັກເກັດ>

source: &Profile to build
lo: &ໂປຣໄຟລ໌ທີ່ຈະສ້າງ

source: Rename Profile
lo: ປ່ຽນຊື່ໂປຣໄຟລ໌

source: New name for profile:
lo: ຊື່ໃໝ່ສຳລັບໂປຣໄຟລ໌:

source: &Restart after building IDE
lo: &ເລີ່ມຕົ້ນໃໝ່ຫຼັງຈາກສ້າງ IDE

# lazarusidestrconsts.lislazbuildrestartlazarusautomatically
source: Restart Lazarus automatically after building the IDE (has no effect when building other parts)
lo: ເລີ່ມຕົ້ນ Lazarus ໃໝ່ໂດຍອັດຕະໂນມັດຫຼັງຈາກສ້າງ IDE (ບໍ່ມີຜົນເມື່ອສ້າງສ່ວນອື່ນໆ)

source: Select profiles to build
lo: ເລືອກໂປຣໄຟລ໌ທີ່ຈະສ້າງ

# lazarusidestrconsts.lislazbuildshowconfirmationdialogwhenbuilding
source: Show confirmation dialog when building directly from Tools menu
lo: ສະແດງກ່ອງໂຕ້ຕອບຢືນຢັນເມື່ອສ້າງໂດຍກົງຈາກເມນູເຄື່ອງມື

source: Show options and defines for command line
lo: ສະແດງຕົວເລືອກ ແລະ defines ສຳລັບ command line

source: Target CPU:
lo: CPU ເປົ້າໝາຍ:

source: Target directory:
lo: ໄດເຣັກທໍຣີເປົ້າໝາຍ:

source: Target OS:
lo: OS ເປົ້າໝາຍ:

source: Unable to write file "%s":%s
lo: ບໍ່ສາມາດຂຽນໄຟລ໌ "%s":%s

# lazarusidestrconsts.lislazbuildupdaterevinc
source: Update revision.inc
lo: ອັບເດດ revision.inc

source: Update revision info in "About Lazarus" dialog
lo: ອັບເດດຂໍ້ມູນ revision ໃນກ່ອງໂຕ້ຕອບ "ກ່ຽວກັບ Lazarus"

# lazarusidestrconsts.lislazcleanupbuildall
source: Clean Up + Build all
lo: ລ້າງຂໍ້ມູນ + ສ້າງທັງໝົດ

source: Lazarus Version (e.g. 1.2.4)
lo: ເວີຊັນ Lazarus (ເຊັ່ນ: 1.2.4)

source: LCL &widget type
lo: ປະເພດ &widget LCL

source: Add link to inherited
lo: ເພີ່ມລິ້ງໄປຫາ inherited

source: Copy from inherited
lo: ສຳເນົາຈາກ inherited

source: %s does not have any valid FPDoc path.%sUnable to create the fpdoc file for %s
lo: %s ບໍ່ມີ path FPDoc ທີ່ຖືກຕ້ອງ.%sບໍ່ສາມາດສ້າງໄຟລ໌ fpdoc ສຳລັບ %s

source: Move entries to inherited
lo: ຍ້າຍລາຍການໄປຫາ inherited

source: No valid FPDoc path
lo: ບໍ່ມີ path FPDoc ທີ່ຖືກຕ້ອງ

source: The unit %s is not owned be any package or project.%sPlease add the unit to a package or project.%sUnable to create the fpdoc file.
lo: ຢູນິດ %s ບໍ່ໄດ້ຢູ່ໃນແພັກເກັດ ຫຼື ໂຄງການໃດໆ.%sກະລຸນາເພີ່ມຢູນິດໃສ່ແພັກເກັດ ຫຼື ໂຄງການ.%sບໍ່ສາມາດສ້າງໄຟລ໌ fpdoc ໄດ້.

# lazarusidestrconsts.lisleft
source: Left
lo: ຊ້າຍ

source: Left borderspace. This value is added to base borderspace and used for the space left to the control.
lo: ຂອບເຂດຊ້າຍ. ຄ່ານີ້ຈະຖືກເພີ່ມໃສ່ຂອບເຂດພື້ນຖານ ແລະ ໃຊ້ສຳລັບພື້ນທີ່ເບື້ອງຊ້າຍຂອງ control.

source: Left anchoring
lo: ການຍຶດດ້ານຊ້າຍ

# lazarusidestrconsts.lisleftgutter
source: Left
lo: ຊ້າຍ

source: This is the sibling control to which the left side is anchored. Leave empty for anchoring to parent in Delphi style (BorderSpacing and ReferenceSide do not matter).
lo: ນີ້ແມ່ນ sibling control ທີ່ດ້ານຊ້າຍຖືກຍຶດໄວ້. ປະວ່າງໄວ້ສຳລັບການຍຶດກັບ parent ໃນຮູບແບບ Delphi (BorderSpacing ແລະ ReferenceSide ບໍ່ມີຜົນ).

source: Left sides
lo: ດ້ານຊ້າຍ

source: Left space equally
lo: ຈັດໄລຍະຫ່າງຊ້າຍເທົ່າກັນ

# lazarusidestrconsts.lisless
source: Less
lo: ໜ້ອຍກວ່າ

# lazarusidestrconsts.lislevels
source: Levels
lo: ລະດັບ

source: LFM file
lo: ໄຟລ໌ LFM

source: The LFM file contains unknown properties/classes which do not exist in the LCL. They can be replaced or removed.
lo: ໄຟລ໌ LFM ມີ properties/classes ທີ່ບໍ່ຮູ້ຈັກ ເຊິ່ງບໍ່ມີຢູ່ໃນ LCL. ສາມາດປ່ຽນແທນ ຫຼື ລຶບອອກໄດ້.

source: LFM file corrupt
lo: ໄຟລ໌ LFM ເສຍຫາຍ

source: LFM is ok
lo: LFM ປົກກະຕິ

source: <description> Copyright (C) <year> <name of author> <contact> This library is free software; you can redistribute it and/or modify it under the terms of the GNU Library General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Library General Public License for more details. You should have received a copy of the GNU Library General Public License along with this library; if not, write to the Free Software Foundation, Inc., 51 Franklin Street - Fifth Floor, Boston, MA 02110-1335, USA.
lo: <description> ລິຂະສິດ (C) <ປີ> <ຊື່ຜູ້ຂຽນ> <ຕິດຕໍ່> Library ນີ້ແມ່ນຊອບແວເສລີ; ທ່ານສາມາດແຈກຢາຍມັນຄືນ ແລະ/ຫຼື ແກ້ໄຂມັນພາຍໃຕ້ເງື່ອນໄຂຂອງ GNU Library General Public License ຕາມທີ່ເຜີຍແຜ່ໂດຍ Free Software Foundation; ເວີຊັນ 2 ຂອງໃບອະນຸຍາດ, ຫຼື (ຕາມທາງເລືອກຂອງທ່ານ) ເວີຊັນໃດໜຶ່ງຕໍ່ມາ. ໂປຣແກຣມນີ້ຖືກແຈກຢາຍດ້ວຍຄວາມຫວັງວ່າມັນຈະເປັນປະໂຫຍດ, ແຕ່ບໍ່ມີການຮັບປະກັນໃດໆ; ເຖິງແມ່ນວ່າຈະເປັນການຮັບປະກັນໂດຍທາງອ້ອມຂອງ MERCHANTABILITY ຫຼື FITNESS FOR A PARTICULAR PURPOSE. ເບິ່ງ GNU Library General Public License ສຳລັບລາຍລະອຽດເພີ່ມເຕີມ. ທ່ານຄວນໄດ້ຮັບສຳເນົາຂອງ GNU Library General Public License ພ້ອມກັບ library ນີ້; ຖ້າບໍ່, ໃຫ້ຂຽນຫາ Free Software Foundation, Inc., 51 Franklin Street - Fifth Floor, Boston, MA 02110-1335, USA.

source: library path
lo: ເສັ້ນທາງ library

source: A Free Pascal shared library (.dll under Windows, .so under Linux, .dylib under macOS).
lo: Free Pascal shared library (.dll ໃນ Windows, .so ໃນ Linux, .dylib ໃນ macOS).

source: Link:
lo: ລິ້ງ:

source: linker options
lo: ຕົວເລືອກ linker

source: Link target
lo: ເປົ້າໝາຍລິ້ງ

source: list of all case values
lo: ລາຍຊື່ຄ່າ case ທັງໝົດ

source: Loading %s failed.
lo: ການໂຫຼດ %s ລົ້ມເຫຼວ.

source: Load macro from
lo: ໂຫຼດ macro ຈາກ

source: &Local
lo: &ທ້ອງຖິ່ນ (Local)

source: lowercase string
lo: ຂໍ້ຄວາມຕົວພິມນ້ອຍ

source: Lowercase string given as parameter.
lo: ຂໍ້ຄວາມຕົວພິມນ້ອຍທີ່ໃຫ້ມາເປັນ parameter.

source: Maximize compatibility of project files (LPI and LPS)
lo: ເພີ່ມຄວາມເຂົ້າກັນໄດ້ຂອງໄຟລ໌ໂຄງການໃຫ້ສູງສຸດ (LPI ແລະ LPS)

source: Check this if you want to open your project in legacy (2.0 and older) Lazarus versions.
lo: ໝາຍຕິກບ່ອນນີ້ຖ້າເຈົ້າຕ້ອງການເປີດໂຄງການໃນ Lazarus ເວີຊັນເກົ່າ (2.0 ແລະ ຕ່ຳກວ່າ).

source: Maximize compatibility of package file (LPK)
lo: ເພີ່ມຄວາມເຂົ້າກັນໄດ້ຂອງໄຟລ໌ແພັກເກັດໃຫ້ສູງສຸດ (LPK)

source: Check this if you want to open your package in legacy (2.0 and older) Lazarus versions.
lo: ໝາຍຕິກບ່ອນນີ້ຖ້າເຈົ້າຕ້ອງການເປີດແພັກເກັດໃນ Lazarus ເວີຊັນເກົ່າ (2.0 ແລະ ຕ່ຳກວ່າ).

source: lpk has vanished on disk. Using as alternative%s
lo: lpk ຫາຍໄປຈາກດິດ. ການໃຊ້ທາງເລືອກ %s

source: lpk is missing
lo: lpk ຂາດຫາຍໄປ

source: Lazarus resources (.lrs) include files
lo: ໄຟລ໌ Lazarus resources (.lrs) include

source: Preferences...
lo: ການຕັ້ງຄ່າ...

source: Macro %s
lo: ແມັກໂຄຣ %s

source: Enter data
lo: ປ້ອນຂໍ້ມູນ

source: Enter run parameters
lo: ປ້ອນ parameters ການແລ່ນ

source: Main unit has Uses section containing all units of project
lo: ຢູນິດຫຼັກມີສ່ວນ Uses ທີ່ບັນຈຸທຸກຢູນິດຂອງໂຄງການ

source: Main unit is Pascal source
lo: ຢູນິດຫຼັກແມ່ນຊອດໂຄດ Pascal

source: Assume Pascal even if it does not end with .pas/.pp suffix.
lo: ສົມມຸດວ່າເປັນ Pascal ເຖິງແມ່ນວ່າມັນຈະບໍ່ລົງທ້າຍດ້ວຍ .pas/.pp ກໍຕາມ.

source: Major changes detected
lo: ກວດພົບການປ່ຽນແປງທີ່ສຳຄັນ

# lazarusidestrconsts.lismakecurrent
source: Current
lo: ປັດຈຸບັນ

source: Make Executable
lo: ສ້າງ Executable

source: Make not found
lo: ບໍ່ພົບ Make

source: Make ResourceString
lo: ສ້າງ ResourceString

source: Append to section
lo: ຕື່ມໃສ່ສ່ວນທ້າຍ

source: The resourcestring "%s" already exists.%sPlease choose another name.%sUse Ignore to add it anyway.
lo: Resourcestring "%s" ມີຢູ່ແລ້ວ.%sກະລຸນາເລືອກຊື່ອື່ນ.%sໃຊ້ "ບໍ່ສົນໃຈ" ເພື່ອເພີ່ມມັນລົງໄປ.

source: Conversion Options
lo: ຕົວເລືອກການແປງ

source: Custom identifier
lo: ຕົວລະບຸທີ່ກຳນົດເອງ

# lazarusidestrconsts.lismakeresstrdialogidentifier
source: Identifier
lo: ຕົວລະບຸ

source: Identifier length:
lo: ຄວາມຍາວຕົວລະບຸ:

source: Identifier prefix:
lo: ຄຳນຳໜ້າຕົວລະບຸ:

source: Insert alphabetically
lo: ແຊກຕາມລຳດັບຕົວອັກສອນ

source: Insert context sensitive
lo: ແຊກຕາມບໍລິບົດ

source: Invalid Resourcestring section
lo: ສ່ວນ Resourcestring ບໍ່ຖືກຕ້ອງ

source: Please choose a resourcestring section from the list.
lo: ກະລຸນາເລືອກສ່ວນ resourcestring ຈາກລາຍການ.

source: Resourcestring already exists
lo: Resourcestring ມີຢູ່ແລ້ວ

source: Resourcestring section:
lo: ສ່ວນ Resourcestring:

source: Source preview
lo: ຕົວຢ່າງຊອດໂຄດ

source: String constant in source
lo: ຄ່າຄົງທີ່ String ໃນຊອດໂຄດ

source: Strings with same value:
lo: Strings ທີ່ມີຄ່າດຽວກັນ:

source: Make sure all ppu files of a package are in its output directory.
lo: ໃຫ້ແນ່ໃຈວ່າໄຟລ໌ ppu ທັງໝົດຂອງແພັກເກັດຢູ່ໃນໄດເຣັກທໍຣີ output ຂອງມັນ.

source: Manage Source Editors ...
lo: ຈັດການຕົວແກ້ໄຂຊອດໂຄດ...

source: Maximum number of threads for compiling in parallel. Default is 0 which guesses the number of cores in the system.
lo: ຈຳນວນ threads ສູງສຸດສຳລັບການຄອມໄພລ໌ແບບຂະໜານ. ຄ່າເລີ່ມຕົ້ນແມ່ນ 0 ເຊິ່ງຈະຄາດເດົາຈຳນວນ cores ໃນລະບົບ.

source: Maximum parallel processes, 0 means default (%s)
lo: ຂະບວນການຂະໜານສູງສຸດ, 0 ໝາຍເຖິງຄ່າເລີ່ມຕົ້ນ (%s)

source: %s Maybe you have to recompile the package.
lo: %s ບາງທີເຈົ້າອາດຈະຕ້ອງ recompile ແພັກເກັດ.

source: Abort Build
lo: ຍົກເລີກການສ້າງ

source: About FPC
lo: ກ່ຽວກັບ FPC

source: Add &Breakpoint
lo: ເພີ່ມ &ຈຸດຢຸດ (Breakpoint)

source: Add Active File to Package ...
lo: ເພີ່ມໄຟລ໌ທີ່ໃຊ້ງານຢູ່ໃສ່ແພັກເກັດ...

source: Add Jump Point to History
lo: ເພີ່ມຈຸດຂ້າມໃສ່ປະຫວັດ

source: Add Editor File to Project
lo: ເພີ່ມໄຟລ໌ຕົວແກ້ໄຂໃສ່ໂຄງການ

source: Add &Watch ...
lo: ເພີ່ມ &Watch...

source: Break Lines in Selection
lo: ຕັດແຖວໃນສ່ວນທີ່ເລືອກ

source: Build File
lo: ສ້າງໄຟລ໌

source: Build Lazarus with Current Profile
lo: ສ້າງ Lazarus ດ້ວຍໂປຣໄຟລ໌ປັດຈຸບັນ

source: Build Lazarus with Profile: %s
lo: ສ້າງ Lazarus ດ້ວຍໂປຣໄຟລ໌: %s

source: Check LFM File in Editor
lo: ກວດສອບໄຟລ໌ LFM ໃນຕົວແກ້ໄຂ

source: Clean Directory ...
lo: ລ້າງໄດເຣັກທໍຣີ...

source: Clean up and Build ...
lo: ລ້າງຂໍ້ມູນ ແລະ ສ້າງ...

source: &Close Editor File
lo: &ປິດໄຟລ໌ຕົວແກ້ໄຂ

source: Close Project
lo: ປິດໂຄງການ

source: CodeTools Defines Editor ...
lo: ຕົວແກ້ໄຂ CodeTools Defines...

source: Comment Selection
lo: ຄອມເມັ້ນສ່ວນທີ່ເລືອກ

source: Compare files ...
lo: ປຽບທຽບໄຟລ໌...

source: Compile many Modes ...
lo: ຄອມໄພລ໌ຫຼາຍໂໝດ...

# lazarusidestrconsts.lismenucompletecode
source: Complete Code
lo: ເຕີມເຕັມໂຄ້ດ

source: Complete Code (with dialog)
lo: ເຕີມເຕັມໂຄ້ດ (ດ້ວຍ dialog)

source: Configure Build+Run File ...
lo: ກຳນົດຄ່າ ໄຟລ໌ Build+Run...

source: Configure Custom Components ...
lo: ກຳນົດຄ່າ ອົງປະກອບທີ່ກຳນົດເອງ...

source: Configure External Tools ...
lo: ກຳນົດຄ່າ ເຄື່ອງມືພາຍນອກ...

source: Configure "Build Lazarus" ...
lo: ກຳນົດຄ່າ "ສ້າງ Lazarus"...

source: Context sensitive Help
lo: ຄວາມຊ່ວຍເຫຼືອຕາມບໍລິບົດ

source: Convert Delphi Package to Lazarus Package ...
lo: ແປງແພັກເກັດ Delphi ເປັນແພັກເກັດ Lazarus...

source: Convert Delphi Project to Lazarus Project ...
lo: ແປງໂຄງການ Delphi ເປັນໂຄງການ Lazarus...

source: Convert Delphi Unit to Lazarus Unit ...
lo: ແປງຢູນິດ Delphi ເປັນຢູນິດ Lazarus...

source: Convert Binary DFM to LFM ...
lo: ແປງ Binary DFM ເປັນ LFM...

source: Convert Encoding of Projects/Packages ...
lo: ແປງການເຂົ້າລະຫັດຂອງ ໂຄງການ/ແພັກເກັດ...

source: Debug Windows
lo: ປ່ອງຢ້ຽມ ດີບັກ

source: Delphi Conversion
lo: ການແປງ Delphi

source: &Edit
lo: &ແກ້ໄຂ

source: Code Templates ...
lo: ແມ່ແບບໂຄ້ດ...

source: Edit context sensitive Help
lo: ແກ້ໄຂຄວາມຊ່ວຍເຫຼືອຕາມບໍລິບົດ

source: Install/Uninstall Packages ...
lo: ຕິດຕັ້ງ/ຖອນການຕິດຕັ້ງ ແພັກເກັດ...

source: Accelerator(&&) key "%s" needs changing
lo: ຄີ Accelerator(&&) "%s" ຈຳເປັນຕ້ອງປ່ຽນ

source: Add a new item above selected item
lo: ເພີ່ມລາຍການໃໝ່ເໜືອລາຍການທີ່ເລືອກ

source: Add a new item after selected item
lo: ເພີ່ມລາຍການໃໝ່ຫຼັງລາຍການທີ່ເລືອກ

source: Add a new item before selected item
lo: ເພີ່ມລາຍການໃໝ່ກ່ອນລາຍການທີ່ເລືອກ

source: Add a new item below selected item
lo: ເພີ່ມລາຍການໃໝ່ລຸ່ມລາຍການທີ່ເລືອກ

source: Add a submenu at the right of selected item
lo: ເພີ່ມເມນູຍ່ອຍຢູ່ທາງຂວາຂອງລາຍການທີ່ເລືອກ

source: Add a submenu below selected item
lo: ເພີ່ມເມນູຍ່ອຍລຸ່ມລາຍການທີ່ເລືອກ

source: &Add from template ...
lo: &ເພີ່ມຈາກແມ່ແບບ...

source: Add icon from %s
lo: ເພີ່ມໄອຄອນຈາກ %s

source: Add imagelist &icon
lo: ເພີ່ມ imagelist &icon

source: Add menu item
lo: ເພີ່ມລາຍການເມນູ

source: &Add new item above
lo: &ເພີ່ມລາຍການໃໝ່ດ້ານເທີງ

source: Add ne&w item after
lo: ເພີ່ມລາຍການໃ&ໝ່ຫຼັງຈາກ

source: &Add new item before
lo: &ເພີ່ມລາຍການໃໝ່ກ່ອນໜ້າ

source: Add ne&w item below
lo: ເພີ່ມລາຍການໃ&ໝ່ດ້ານລຸ່ມ

source: Add &OnClick handler
lo: ເພີ່ມ &OnClick handler

source: Add separator &after
lo: ເພີ່ມຕົວຂັ້ນ &ຫຼັງຈາກ

source: Add separator &before
lo: ເພີ່ມຕົວຂັ້ນ &ກ່ອນໜ້າ

source: Add submenu
lo: ເພີ່ມເມນູຍ່ອຍ

source: Add &submenu below
lo: ເພີ່ມ &ເມນູຍ່ອຍດ້ານລຸ່ມ

source: Add &submenu right
lo: ເພີ່ມ &ເມນູຍ່ອຍດ້ານຂວາ

source: A new menu template described as "%s" has been saved based on %s, with %d sub items
lo: ແມ່ແບບເມນູໃໝ່ທີ່ອະທິບາຍວ່າ "%s" ໄດ້ຖືກບັນທຶກໂດຍອີງໃສ່ %s, ພ້ອມກັບ %d ລາຍການຍ່ອຍ

source: &Edit,Basic edit menu,&Undo,Ctrl+Z,&Redo,,-,,Select &All,Ctrl+A,C&ut,Ctrl+X,C&opy,Ctrl+C,P&aste,Ctrl+V,Paste &Special,,-,,F&ind,,R&eplace,,&Go to ...,,
lo: &ແກ້ໄຂ,ເມນູແກ້ໄຂພື້ນຖານ,&ຍົກເລີກການທຳ,Ctrl+Z,&ເຮັດຊ້ຳ,,-,,ເລືອກ &ທັງໝົດ,Ctrl+A,ຕັ&ດ,Ctrl+X,ສຳ&ເນົາ,Ctrl+C,&ວາງ,Ctrl+V,ວາງແບບ &ພິເສດ,,-,,&ຄົ້ນຫາ,,ແ&ທນທີ່,,&ໄປທີ່ ...,,

source: &File,Basic file menu,&New,,&Open ...,,&Save,,Save &As,,-,,&Print,,P&rint Setup ...,,-,,E&xit,,
lo: &ໄຟລ໌,ເມນູໄຟລ໌ພື້ນຖານ,&ໃໝ່,,&ເປີດ ...,,&ບັນທຶກ,,ບັນທຶກ&ເປັນ,,-,,&ພິມ,,ຕັ້ງຄ່າການ&ພິມ ...,,-,,&ອອກ,,

source: &Help,Basic help menu,Help &Contents,F1,Help &Index,,&Online Help,,-,,&Licence Information,,&Check for Updates,,-,,&About,,
lo: &ຄວາມຊ່ວຍເຫຼືອ,ເມນູຄວາມຊ່ວຍເຫຼືອພື້ນຖານ,&ເນື້ອຫາຄວາມຊ່ວຍເຫຼືອ,F1,&ດັດຊະນີຄວາມຊ່ວຍເຫຼືອ,,ຄວາມຊ່ວຍເຫຼືອ&ອອນໄລນ໌,,-,,&ຂໍ້ມູນໃບອະນຸຍາດ,,&ກວດສອບການອັບເດດ,,-,,&ກ່ຽວກັບ,,

source: &Window,Basic window menu,&New Window,,&Tile,,&Cascade,,&Arrange all,,-,,&Hide,,&Show,,
lo: &ປ່ອງຢ້ຽມ,ເມນູປ່ອງຢ້ຽມພື້ນຖານ,ປ່ອງຢ້ຽມ&ໃໝ່,,&ລຽງຕໍ່ກັນ,,&ຊ້ອນກັນ,,&ຈັດລຽງທັງໝົດ,,-,,&ເຊື່ອງ,,&ສະແດງ,,

source: Caption
lo: ຄຳອະທິບາຍ (Caption)

source: Captioned items: %s
lo: ລາຍການທີ່ມີຄຳອະທິບາຍ: %s

source: Caption should not be blank
lo: ຄຳອະທິບາຍບໍ່ຄວນຫວ່າງເປົ່າ

source: Change conflicting accelerator "%s"
lo: ປ່ຽນ accelerator ທີ່ຂັດແຍ່ງກັນ "%s"

source: Change imagelist &icon
lo: ປ່ຽນ imagelist &icon

source: Change %s for %s
lo: ປ່ຽນ %s ສຳລັບ %s

source: Change shortcut conflict "%s"
lo: ປ່ຽນທາງລັດທີ່ຂັດແຍ່ງກັນ "%s"

source: Change the shortCut for %s
lo: ປ່ຽນທາງລັດສຳລັບ %s

source: Change the shortCutKey2 for %s
lo: ປ່ຽນ ShortCutKey2 ສຳລັບ %s

source: Choose template to delete
lo: ເລືອກແມ່ແບບທີ່ຈະລຶບ

source: Choose template to insert
lo: ເລືອກແມ່ແບບທີ່ຈະແຊກ

source: Click a non-greyed item to edit its shortcut or click header to sort by that column
lo: ຄິກທີ່ລາຍການທີ່ບໍ່ແມ່ນສີເທົາເພື່ອແກ້ໄຂທາງລັດ ຫຼື ຄິກທີ່ຫົວຂໍ້ເພື່ອຈັດລຽງຕາມຄໍລຳນັ້ນ

source: Component is unexpected kind
lo: ອົງປະກອບເປັນປະເພດທີ່ບໍ່ຄາດຄິດ

source: Component is unnamed
lo: ອົງປະກອບບໍ່ມີຊື່

source: <conflict resolution complete>
lo: <ການແກ້ໄຂຂໍ້ຂັດແຍ່ງສຳເລັດ>

source: Conflicts found initially: %d
lo: ຂໍ້ຂັດແຍ່ງທີ່ພົບໃນເບື້ອງຕົ້ນ: %d

source: Deepest nested menu level: %s
lo: ລະດັບເມນູທີ່ຊ້ອນກັນເລິກທີ່ສຸດ: %s

source: &Delete item
lo: &ລຶບລາຍການ

source: &Delete menu template ...
lo: &ລຶບແມ່ແບບເມນູ...

source: Delete saved menu template
lo: ລຶບແມ່ແບບເມນູທີ່ບັນທຶກໄວ້

source: Delete selected menu template
lo: ລຶບແມ່ແບບເມນູທີ່ເລືອກ

source: Delete this item and its subitems?
lo: ລຶບລາຍການນີ້ ແລະ ລາຍການຍ່ອຍຂອງມັນບໍ່?

source: Display preview as &Popup menu
lo: ສະແດງຕົວຢ່າງເປັນ &Popup menu

source: Edit &Caption
lo: ແກ້ໄຂ &ຄຳອະທິບາຍ (Caption)

source: Editing Caption of %s
lo: ກຳລັງແກ້ໄຂຄຳອະທິບາຍຂອງ %s

source: To resolve conflict edit %s.%s
lo: ເພື່ອແກ້ໄຂຂໍ້ຂັດແຍ່ງ ໃຫ້ແກ້ໄຂ %s.%s

source: Editing %s for %s
lo: ກຳລັງແກ້ໄຂ %s ສຳລັບ %s

source: Editing %s.%s - no menuitem selected
lo: ກຳລັງແກ້ໄຂ %s.%s - ບໍ່ມີລາຍການເມນູຖືກເລືອກ

source: Enter a menu &Description:
lo: ປ້ອນ &ຄຳອະທິບາຍເມນູ:

source: Enter a new ShortCut for %s
lo: ປ້ອນທາງລັດໃໝ່ສຳລັບ %s

source: Enter a new ShortCutKey2 for %s
lo: ປ້ອນ ShortCutKey2 ໃໝ່ສຳລັບ %s

source: Existing saved templates
lo: ແມ່ແບບທີ່ບັນທຶກໄວ້ທີ່ມີຢູ່

source: Further shortcut conflict
lo: ຂໍ້ຂັດແຍ່ງທາງລັດເພີ່ມເຕີມ

source: &Grab key
lo: &ຈັບຄີ

source: Values in use: %s
lo: ຄ່າທີ່ໃຊ້ຢູ່: %s

source: Inadequate Description
lo: ຄຳອະທິບາຍບໍ່ພຽງພໍ

source: Insert menu template into root of %s
lo: ແຊກແມ່ແບບເມນູໃສ່ຮາກ (root) ຂອງ %s

source: Insert selected menu template
lo: ແຊກແມ່ແບບເມນູທີ່ເລືອກ

source: is not assigned
lo: ບໍ່ໄດ້ຖືກມອບໝາຍ

source: Items with icon: %s
lo: ລາຍການທີ່ມີໄອຄອນ: %s

source: List shortcuts and &accelerators for %s ...
lo: ລາຍຊື່ທາງລັດ ແລະ &accelerators ສຳລັບ %s...

source: List shortcuts for %s ...
lo: ລາຍຊື່ທາງລັດສຳລັບ %s...

source: Menu Editor
lo: ຕົວແກ້ໄຂເມນູ

source: Menu Item actions
lo: ການກະທຳຂອງລາຍການເມນູ

source: Menuitem shortcut conflicts in %s
lo: ຂໍ້ຂັດແຍ່ງທາງລັດລາຍການເມນູໃນ %s

source: Mo&ve item down
lo: ຍ້າຍ&ລາຍການລົງ

source: &Move item left
lo: &ຍ້າຍລາຍການໄປຊ້າຍ

source: Mo&ve item right
lo: ຍ້າຍ&ລາຍການໄປຂວາ

source: &Move item up
lo: &ຍ້າຍລາຍການຂຶ້ນ

# lazarusidestrconsts.lismenueditormoveselecteditemdown
source: Move selected item down
lo: ຍ້າຍລາຍການທີ່ເລືອກລົງ

source: Move selected item to the left
lo: ຍ້າຍລາຍການທີ່ເລືອກໄປທາງຊ້າຍ

source: Move selected item to the right
lo: ຍ້າຍລາຍການທີ່ເລືອກໄປທາງຂວາ

# lazarusidestrconsts.lismenueditormoveselecteditemup
source: Move selected item up
lo: ຍ້າຍລາຍການທີ່ເລືອກຂຶ້ນ

source: (no menu selected)
lo: (ບໍ່ມີເມນູຖືກເລືອກ)

source: <none>
lo: <ບໍ່ມີ>

source: <none>,<none>
lo: <ບໍ່ມີ>,<ບໍ່ມີ>

source: <no shortcut conflicts>
lo: <ບໍ່ມີຂໍ້ຂັດແຍ່ງທາງລັດ>

source: No user-saved templates
lo: ບໍ່ມີແມ່ແບບທີ່ຜູ້ໃຊ້ບັນທຶກໄວ້

source: Pick an icon from %s
lo: ເລືອກໄອຄອນຈາກ %s

source: Popup assignments: %s
lo: ການມອບໝາຍ Popup: %s

source: Remaining conflicts: %s
lo: ຂໍ້ຂັດແຍ່ງທີ່ຍັງເຫຼືອ: %s

source: &Remove all separators
lo: &ລຶບຕົວຂັ້ນທັງໝົດ

source: Resolved conflicts: %s
lo: ຂໍ້ຂັດແຍ່ງທີ່ແກ້ໄຂແລ້ວ: %s

source: Resolve selected conflict
lo: ແກ້ໄຂຂໍ້ຂັດແຍ່ງທີ່ເລືອກ

source: &Resolve shortcut conflicts ...
lo: &ແກ້ໄຂຂໍ້ຂັດແຍ່ງທາງລັດ...

source: Saved templates
lo: ແມ່ແບບທີ່ບັນທຶກໄວ້

source: &Save menu as a template ...
lo: &ບັນທຶກເມນູເປັນແມ່ແບບ...

source: Save menu as template
lo: ບັນທຶກເມນູເປັນແມ່ແບບ

source: Save menu as template for future use
lo: ບັນທຶກເມນູເປັນແມ່ແບບສຳລັບການນຳໃຊ້ໃນອະນາຄົດ

source: Save menu shown as a new template
lo: ບັນທຶກເມນູທີ່ສະແດງເປັນແມ່ແບບໃໝ່

source: %s conflicts with %s
lo: %s ຂັດແຍ່ງກັບ %s

source: Se&parators
lo: ຕົວ&ຂັ້ນ

source: Shortcut items: %s
lo: ລາຍການທາງລັດ: %s

source: Shortcut not yet changed
lo: ທາງລັດຍັງບໍ່ທັນປ່ຽນ

source: Shortcuts
lo: ທາງລັດ

source: Shortc&uts
lo: ທາງ&ລັດ

source: Shortcuts and Accelerator keys
lo: ທາງລັດ ແລະ Accelerator keys

source: Shortcuts (%d)
lo: ທາງລັດ (%d)

source: Shortcuts (%d) and Accelerator keys (%d)
lo: ທາງລັດ (%d) ແລະ Accelerator keys (%d)

source: Shortcut,Source Property
lo: ທາງລັດ, Source Property

source: Shortcuts used in %s
lo: ທາງລັດທີ່ໃຊ້ໃນ %s

source: Shortcuts used in %s (%d)
lo: ທາງລັດທີ່ໃຊ້ໃນ %s (%d)

source: "%s" in %s
lo: "%s" ໃນ %s

source: "%s" is already in use in %s as a shortcut. Try a different shortcut.
lo: "%s" ຖືກນຳໃຊ້ແລ້ວໃນ %s ເປັນທາງລັດ. ລອງທາງລັດອື່ນ.

source: Please expand: "%s" is not a sufficient Description
lo: ກະລຸນາຂະຫຍາຍ: "%s" ບໍ່ແມ່ນຄຳອະທິບາຍທີ່ພຽງພໍ

source: %s: Shortcuts
lo: %s: ທາງລັດ

source: %s: Shortcuts and accelerator keys
lo: %s: ທາງລັດ ແລະ accelerator keys

source: Standard templates
lo: ແມ່ແບບມາດຕະຖານ

source: Template description:
lo: ຄຳອະທິບາຍແມ່ແບບ:

source: &Templates
lo: &ແມ່ແບບ

source: Template saved
lo: ບັນທຶກແມ່ແບບແລ້ວ

source: There are no user-saved menu templates. Only standard default templates are available.
lo: ບໍ່ມີແມ່ແບບເມນູທີ່ຜູ້ໃຊ້ບັນທຶກໄວ້. ມີພຽງແຕ່ແມ່ແບບມາດຕະຖານເທົ່ານັ້ນ.

source: TSCList.GetScanListCompName: invalid index %d for FScanList
lo: TSCList.GetScanListCompName: index %d ບໍ່ຖືກຕ້ອງສຳລັບ FScanList

source: You have to change the shortcut from %s to avoid a conflict
lo: ເຈົ້າຕ້ອງປ່ຽນທາງລັດຈາກ %s ເປັນເພື່ອຫຼີກເວັ້ນຂໍ້ຂັດແຍ່ງ

source: You must enter text for the Caption
lo: ເຈົ້າຕ້ອງປ້ອນຂໍ້ຄວາມສຳລັບຄຳອະທິບາຍ (Caption)

source: Enclose in $IFDEF ...
lo: ຫຸ້ມດ້ວຍ $IFDEF ...

source: Enclose Selection ...
lo: ຫຸ້ມສ່ວນທີ່ເລືອກ...

source: E&valuate/Modify ...
lo: ປະ&ເມີນ/ແກ້ໄຂ...

source: Extract Procedure ...
lo: ແຍກ Procedure...

source: &File
lo: &ໄຟລ໌

# lazarusidestrconsts.lismenufind
source: Find
lo: ຄົ້ນຫາ

source: &Find ...
lo: &ຄົ້ນຫາ...

source: Find Other End of Code Block
lo: ຄົ້ນຫາຈຸດຈົບອື່ນຂອງບຣັອກໂຄ້ດ

source: Find Start of Code Block
lo: ຄົ້ນຫາຈຸດເລີ່ມຕົ້ນຂອງບຣັອກໂຄ້ດ

source: Find Declaration at Cursor
lo: ຄົ້ນຫາການປະກາດທີ່ຕົວກະພິບ

source: Find Identifier References ...
lo: ຄົ້ນຫາການອ້າງອີງຕົວລະບຸ...

source: Find &in Files ...
lo: ຄົ້ນຫາ&ໃນໄຟລ໌...

source: Find &Next
lo: ຄົ້ນຫາ&ຕໍ່ໄປ

source: Find &Previous
lo: ຄົ້ນຫາ&ກ່ອນໜ້າ

source: Find References Of Used Unit
lo: ຄົ້ນຫາການອ້າງອີງຂອງຢູນິດທີ່ໃຊ້

source: Options ...
lo: ຕົວເລືອກ...

source: Goto Include Directive
lo: ໄປທີ່ Include Directive

source: Goto Line ...
lo: ໄປທີ່ແຖວ...
