Repository: fpc/Lazarus
Catalog: languages/lazaruside.*.po
Languages: lo

source: Save changes to project %s?
lo: ບັນທຶກການປ່ຽນແປງໃສ່ໂຄງການ %s ບໍ່?

source: Save current editor file
lo: ບັນທຶກໄຟລ໌ບັນນາທິການປັດຈຸບັນ

source: Saved with IDE settings
lo: ບັນທຶກພ້ອມກັບການຕັ້ງຄ່າ IDE

source: Saved with project session
lo: ບັນທຶກພ້ອມກັບ session ໂຄງການ

source: Save file "%s"%sbefore closing form "%s"?
lo: ບັນທຶກໄຟລ໌ "%s"%sກ່ອນປິດຟອມ "%s" ບໍ່?

source: Save macro as
lo: ບັນທຶກ macro ເປັນ

source: Save messages
lo: ບັນທຶກຂໍ້ຄວາມ

source: Save project %s (*%s)
lo: ບັນທຶກໂຄງການ %s (*%s)

source: Save session changes to project %s?
lo: ບັນທຶກການປ່ຽນແປງ session ໃສ່ໂຄງການ %s ບໍ່?

# lazarusidestrconsts.lissavesessionfoldstate
source: Save fold info
lo: ບັນທຶກຂໍ້ມູນການພັບ

source: Code editor supports folding (temporarily hiding) blocks of code.
lo: Code editor ຮອງຮັບການພັບ (ເຊື່ອງຊົ່ວຄາວ) ບລັອກຂອງໂຄດ.

# lazarusidestrconsts.lissavesessionjumphistory
source: Save jump history
lo: ບັນທຶກປະຫວັດການຂ້າມ

source: Ctrl-Click on an identifier in code editor is stored in jump history.
lo: Ctrl-Click ໃສ່ identifier ໃນ code editor ຖືກເກັບໄວ້ໃນ jump history.

source: &Save Settings
lo: &ບັນທຶກການຕັ້ງຄ່າ

source: Save Shown Messages to File ...
lo: ບັນທຶກຂໍ້ຄວາມທີ່ສະແດງລົງໄຟລ໌ ...

source: Save
lo: ບັນທຶກ

source: Saving file "%s" as "%s" looses characters at line %s, column %s.
lo: ການບັນທຶກໄຟລ໌ "%s" ເປັນ "%s" ສູນເສຍຕົວອັກສອນທີ່ແຖວ %s, ຖັນ %s.

source: Scaling factor:
lo: ປັດໃຈຂະຫຍາຍ:

source: Scan files in parent directory
lo: ສະແກນໄຟລ໌ໃນໂຟນເດີແມ່

source: Search for source files in sibling directories (parent directory and its children)
lo: ຄົ້ນຫາ source files ໃນ sibling directories (ໂຟນເດີແມ່ ແລະ ລູກຂອງມັນ)

source: Scanning
lo: ກຳລັງສະແກນ

source: %s. Scanning ...
lo: %s. ກຳລັງສະແກນ ...

source: Scanning parent directory
lo: ກຳລັງສະແກນໂຟນເດີແມ່

source: Search paths
lo: ເສັ້ນທາງຄົ້ນຫາ

source: Search Unit "%s"
lo: ຄົ້ນຫາ Unit "%s"

source: Secondary config directory where Lazarus searches for config template files. Default is "%s".
lo: ໂຟນເດີການຕັ້ງຄ່າສຳຮອງທີ່ Lazarus ຄົ້ນຫາໄຟລ໌ config template. ຄ່າເລີ່ມຕົ້ນແມ່ນ "%s".

source: Secondary config path
lo: ເສັ້ນທາງການຕັ້ງຄ່າສຳຮອງ

source: &Second test
lo: ການທົດສອບຄັ້ງທີ&ສອງ

source: See messages.
lo: ເບິ່ງຂໍ້ຄວາມ.

source: %sSee Project -> Project Inspector
lo: %sເບິ່ງ Project -> Project Inspector

source: Select a help item:
lo: ເລືອກຫົວຂໍ້ຊ່ວຍເຫຼືອ:

source: Select a node
lo: ເລືອກ node

source: Select another LCL widgetset (macro LCLWidgetType)
lo: ເລືອກ LCL widgetset ອື່ນ (macro LCLWidgetType)

source: Select build mode
lo: ເລືອກ build mode

source: Select Delphi form files (*.dfm|*.fmx)
lo: ເລືອກໄຟລ໌ຟອມ Delphi (*.dfm|*.fmx)

# lazarusidestrconsts.lisselected
source: Selected
lo: ຖືກເລືອກ

source: Selected addition:
lo: ສ່ວນເພີ່ມທີ່ເລືອກ:

source: Selected and child controls
lo: ຖືກເລືອກ ແລະ controls ລູກ

source: (selected bottom neighbour)
lo: (ເພື່ອນບ້ານດ້ານລຸ່ມທີ່ຖືກເລືອກ)

source: Selected Command's Mapping
lo: ການຈັບຄູ່ຄຳສັ່ງທີ່ເລືອກ

source: selected for installation
lo: ຖືກເລືອກສຳລັບການຕິດຕັ້ງ

source: selected for uninstallation
lo: ຖືກເລືອກສຳລັບການຖອນການຕິດຕັ້ງ

source: (selected left neighbour)
lo: (ເພື່ອນບ້ານດ້ານຊ້າຍທີ່ຖືກເລືອກ)

source: Selected message in messages window:
lo: ຂໍ້ຄວາມທີ່ເລືອກໃນໜ້າຕ່າງຂໍ້ຄວາມ:

source: Selected %d modes were successfully compiled.
lo: %d ໂໝດທີ່ເລືອກຖືກ compile ສຳເລັດແລ້ວ.

source: (selected right neighbour)
lo: (ເພື່ອນບ້ານດ້ານຂວາທີ່ຖືກເລືອກ)

source: (selected top neighbour)
lo: (ເພື່ອນບ້ານດ້ານເທິງທີ່ຖືກເລືອກ)

source: Select the file
lo: ເລືອກໄຟລ໌

source: Select the path where FPC is installed
lo: ເລືອກເສັ້ນທາງທີ່ຕິດຕັ້ງ FPC

source: Select FPC source directory
lo: ເລືອກໂຟນເດີຊອດໂຄດ FPC

source: Select Frame
lo: ເລືອກ Frame

source: Selection exceeds string constant
lo: ການເລືອກເກີນ string constant

source: Selection tool
lo: ເຄື່ອງມືການເລືອກ

source: Select Lazarus source directory
lo: ເລືອກໂຟນເດີຊອດໂຄດ Lazarus

source: Select path to %s
lo: ເລືອກເສັ້ນທາງໄປຫາ %s

source: Select target directory
lo: ເລືອກໂຟນເດີປາຍທາງ

source: Set all colors:
lo: ກຳນົດສີທັງໝົດ:

source: Set default
lo: ກຳນົດຄ່າເລີ່ມຕົ້ນ

source: Set this to translate the compiler messages to another language (i.e. not English). For example: German: $(FPCSrcDir)/compiler/msg/errordu.msg.
lo: ຕັ້ງຄ່ານີ້ເພື່ອແປຂໍ້ຄວາມ compiler ເປັນພາສາອື່ນ (ຄືບໍ່ແມ່ນພາສາອັງກິດ). ຕົວຢ່າງ: ເຢຍລະມັນ: $(FPCSrcDir)/compiler/msg/errordu.msg.

source: (Set up default indentation)
lo: (ຕັ້ງຄ່າການຫຍໍ້ໜ້າເລີ່ມຕົ້ນ)

source: Short:
lo: ສັ້ນ:

source: Short form of $TargetCPU(Param)-$TargetOS(Param)-$SubTarget(Param). Subtarget is omitted if empty.
lo: ຮູບແບບສັ້ນຂອງ $TargetCPU(Param)-$TargetOS(Param)-$SubTarget(Param). Subtarget ຖືກລະເວັ້ນຖ້າຫວ່າງ.

source: Short, no path
lo: ສັ້ນ, ບໍ່ມີເສັ້ນທາງ

source: Should the component "%s" be auto created when the application starts?
lo: ຄວນສ້າງ component "%s" ອັດຕະໂນມັດເມື່ອແອັບພລິເຄຊັນເລີ່ມຕົ້ນບໍ່?

source: Show
lo: ສະແດງ

source: Show abstract methods of "%s"
lo: ສະແດງ abstract methods ຂອງ "%s"

source: Show component tree
lo: ສະແດງ component tree

source: Show console
lo: ສະແດງ console

source: Show declaration hints
lo: ສະແດງຄຳແນະນຳການປະກາດ

source: Show differences between modes ...
lo: ສະແດງຄວາມແຕກຕ່າງລະຫວ່າງໂໝດ ...

source: Show empty units/packages
lo: ສະແດງ Unit/ແພັກເກັດ ທີ່ຫວ່າງເປົ່າ

source: Show FPC message "lines compiled"
lo: ສະແດງຂໍ້ຄວາມ FPC "lines compiled"

source: Show Glyphs for
lo: ສະແດງ Glyphs ສຳລັບ

source: Show gutter
lo: ສະແດງ gutter

source: Show help
lo: ສະແດງວິທີໃຊ້

# lazarusidestrconsts.lisshowhintsinobjectinspector
source: Show hints
lo: ສະແດງ hints

source: Show identifiers
lo: ສະແດງ identifiers

source: Show information box
lo: ສະແດງກ່ອງຂໍ້ມູນ

source: Show Message Type ID
lo: ສະແດງ ID ຊະນິດຂໍ້ຄວາມ

source: Show multiple lines
lo: ສະແດງຫຼາຍແຖວ

source: Show only modified
lo: ສະແດງສະເພາະທີ່ມີການແກ້ໄຂ

source: Show only one button in the taskbar for the whole IDE instead of one per window. Some Linux Window Managers like Cinnamon do not support this and always show one button per window.
lo: ສະແດງພຽງປຸ່ມດຽວໃນ taskbar ສຳລັບ IDE ທັງໝົດ ແທນທີ່ຈະເປັນໜຶ່ງປຸ່ມຕໍ່ໜ້າຕ່າງ. Linux Window Managers ບາງຕົວເຊັ່ນ Cinnamon ບໍ່ຮອງຮັບສິ່ງນີ້ ແລະ ຈະສະແດງໜຶ່ງ ປຸ່ມຕໍ່ໜ້າຕ່າງສະເໝີ.

source: Show output
lo: ສະແດງຜົນລັບ

source: Show overview gutter
lo: ສະແດງ overview gutter

source: Show packages
lo: ສະແດງແພັກເກັດ

source: Show position of source editor
lo: ສະແດງຕຳແໜ່ງຂອງຕົວແກ້ໄຂຊອດໂຄດ

source: Show property filter
lo: ສະແດງຕົວກອງຄຸນສົມບັດ

source: Show recently used identifiers at top
lo: ສະແດງ identifiers ທີ່ໃຊ້ຫຼ້າສຸດຢູ່ດ້ານເທິງ

source: Show relative paths
lo: ສະແດງເສັ້ນທາງແບບ relative

source: Shows all controls in tree hierarchy.
lo: ສະແດງ controls ທັງໝົດໃນລຳດັບຊັ້ນຕົ້ນໄມ້.

source: A box at the bottom shows description for the selected property.
lo: ກ່ອງຢູ່ດ້ານລຸ່ມສະແດງຄຳອະທິບາຍສຳລັບຄຸນສົມບັດທີ່ເລືອກ.

source: Show setup dialog for most important settings.
lo: ສະແດງກ່ອງໂຕ້ຕອບການຕັ້ງຄ່າສຳລັບການຕັ້ງຄ່າທີ່ສຳຄັນທີ່ສຸດ.

source: Show special characters
lo: ສະແດງຕົວອັກສອນພິເສດ

source: Show statusbar
lo: ສະແດງແຖບສະຖານະ

source: Show units
lo: ສະແດງ units

source: Show units with initialization/finalization sections
lo: ສະແດງ units ທີ່ມີສ່ວນ initialization/finalization

source: These units may initialize global data used by the program/application. Remove with care.
lo: Units ເຫຼົ່ານີ້ອາດຈະ initialize global data ທີ່ໃຊ້ໂດຍໂປຣແກຣມ/ແອັບພລິເຄຊັນ. ເອົາອອກດ້ວຍ ຄວາມລະມັດລະວັງ.

source: Show unused units ...
lo: ສະແດງ units ທີ່ບໍ່ໄດ້ໃຊ້ ...

source: Show value hints while debugging
lo: ສະແດງ hints ຄ່າໃນຂະນະ debugging

source: Show version and exit.
lo: ສະແດງເວີຊັນແລ້ວອອກ.

source: Shrink to smallest
lo: ຫຍໍ້ໃຫ້ນ້ອຍທີ່ສຸດ

source: Simple Program
lo: ໂປຣແກຣມງ່າຍດາຍ

source: A most simple Free Pascal command line program.
lo: ໂປຣແກຣມ Free Pascal command line ທີ່ງ່າຍດາຍທີ່ສຸດ.

source: Simple syntax
lo: ໄວຍາກອນງ່າຍດາຍ

source: Skip errors
lo: ຂ້າມຂໍ້ຜິດພາດ

source: Skip file
lo: ຂ້າມໄຟລ໌

source: Skip file and continue loading
lo: ຂ້າມໄຟລ໌ແລະສືບຕໍ່ໂຫຼດ

source: Skip loading last project.
lo: ຂ້າມການໂຫຼດໂຄງການຫຼ້າສຸດ.

source: Skip selected checks at startup. Valid options are:
lo: ຂ້າມການກວດສອບທີ່ເລືອກຕອນເລີ່ມຕົ້ນ. ຕົວເລືອກທີ່ໃຊ້ໄດ້ແມ່ນ:

source: Slower but more accurate.
lo: ຊ້າກວ່າແຕ່ຖືກຕ້ອງກວ່າ.

source: Smaller rather than faster
lo: ນ້ອຍກວ່າ ແທນທີ່ຈະ ໄວກວ່າ

source: Matches
lo: ກົງກັນ

source: Sorry, this type is not yet implemented
lo: ຂໍອະໄພ, ຊະນິດນີ້ຍັງບໍ່ທັນໄດ້ຖືກປະຕິບັດ

source: History items limit
lo: ຈຳກັດລາຍການປະຫວັດ

source: Sorting
lo: ການລຽງລຳດັບ

source: Alphabetic
lo: ຕາມຕົວອັກສອນ

source: Definition (Scoped)
lo: ການນິຍາມ (Scoped)

# lazarusidestrconsts.lissortorderscopedalphabetic
source: Alphabetic (Scoped)
lo: ຕາມຕົວອັກສອນ (Scoped)

source: Order by
lo: ລຽງຕາມ

source: Ascending
lo: ຈາກໜ້ອຍຫາຫຼາຍ

source: Descending
lo: ຈາກຫຼາຍຫາໜ້ອຍ

source: Ignore Space
lo: ເມິນເສີຍຍະຫວ່າງ

source: Lines
lo: ແຖວ

# lazarusidestrconsts.lissortseloptions
source: Options
lo: ຕົວເລືອກ

source: Paragraphs
lo: ຫຍໍ້ໜ້າ

# lazarusidestrconsts.lissortselpreview
source: Preview
lo: ຕົວຢ່າງ

source: Accept
lo: ຍອມຮັບ

source: Sort selection
lo: ລຽງລຳດັບສ່ວນທີ່ເລືອກ

# lazarusidestrconsts.lissortselwords
source: Words
lo: ຄໍາສັບ

source: Source "%s"%sand Destination "%s"%sdirectories are the same. Please select another directory.
lo: ໂຟນເດີຕົ້ນທາງ "%s"%sແລະ ປາຍທາງ "%s"%sແມ່ນອັນດຽວກັນ. ກະລຸນາເລືອກໂຟນເດີອື່ນ.

source: Source directory "%s" does not exist.
lo: ໂຟນເດີຕົ້ນທາງ "%s" ບໍ່ມີຢູ່.

source: Source Editor Window Manager
lo: ຕົວຈັດການໜ້າຕ່າງແກ້ໄຂຊອດໂຄດ

source: Source modified
lo: ຕົ້ນສະບັບຖືກແກ້ໄຂ

source: Source of page "%s" has changed. Save?
lo: ຕົ້ນສະບັບຂອງໜ້າ "%s" ມີການປ່ຽນແປງ. ບັນທຶກບໍ່?

source: Sources of pages have changed. Save page "%s"? (%d more)
lo: ຕົ້ນສະບັບຂອງໜ້າຕ່າງໆມີການປ່ຽນແປງ. ບັນທຶກໜ້າ "%s" ບໍ່? (ຍັງອີກ %d)

source: Source paths
lo: ເສັ້ນທາງໄຟລ໌ຕົ້ນສະບັບ

source: Space equally
lo: ໄລຍະຫ່າງເທົ່າກັນ

source: Src OS
lo: OS ຕົ້ນທາງ

source: Searching
lo: ກຳລັງຄົ້ນຫາ

source: Search text
lo: ຂໍ້ຄວາມຄົ້ນຫາ

source: Start Conversion
lo: ເລີ່ມການແປງໄຟລ໌

source: Start IDE
lo: ເລີ່ມຕົ້ນ IDE

source: Start with a new project
lo: ເລີ່ມຕົ້ນດ້ວຍໂປຣເຈັກໃໝ່

source: Statusbar shows the property's name and the class where it is published.
lo: ແຖບສະຖານະສະແດງຊື່ຄຸນສົມບັດ ແລະ ຄລາສທີ່ມັນຖືກປະກາດ.

# lazarusidestrconsts.lisstop
source: Stop
lo: ຢຸດ

source: Stop current debugging and rebuild project?
lo: ຢຸດການດີບັກປະຈຸບັນ ແລະ ສ້າງໂປຣເຈັກຄືນໃໝ່ບໍ່?

source: Stop Debugging?
lo: ຢຸດການດີບັກບໍ່?

source: Stop debugging?
lo: ຢຸດການດີບັກບໍ່?

source: Stop on exception
lo: ຢຸດເມື່ອເກີດ Exception

source: Stop the debugging?
lo: ຢຸດການດີບັກບໍ່?

source: Store path delimiters \ and / as
lo: ບັນທຶກຕົວຂັ້ນເສັ້ນທາງ \ ແລະ / ເປັນ

source: Streaming error
lo: ເກີດຂໍ້ຜິດພາດໃນການສະຕຣີມ

source: Sub Procedure
lo: ໂປຣຊີເຈີຍ່ອຍ

source: Sub Procedure on same level
lo: ໂປຣຊີເຈີຍ່ອຍໃນລະດັບດຽວກັນ

source: Subtarget
lo: ເປົ້າໝາຍຍ່ອຍ

source: Success
lo: ສຳເລັດ

source: Successfully exported to "%s".
lo: ສົ່ງອອກໄປຍັງ "%s" ສຳເລັດແລ້ວ.

source: Successfully exported %d BuildModes to "%s".
lo: ສົ່ງອອກ BuildModes %d ອັນ ໄປຍັງ "%s" ສຳເລັດແລ້ວ.

source: Successfully exported compiler options to "%s".
lo: ສົ່ງອອກຕົວເລືອກຄອມໄພເລີໄປຍັງ "%s" ສຳເລັດແລ້ວ.

source: Successfully imported from "%s".
lo: ນຳເຂົ້າຈາກ "%s" ສຳເລັດແລ້ວ.

source: Successfully imported %d BuildModes from "%s".
lo: ນຳເຂົ້າ BuildModes %d ອັນ ຈາກ "%s" ສຳເລັດແລ້ວ.

source: Successfully imported compiler options from "%s".
lo: ນຳເຂົ້າຕົວເລືອກຄອມໄພເລີຈາກ "%s" ສຳເລັດແລ້ວ.

source: Suggest default name of new file in lowercase
lo: ແນະນຳຊື່ເລີ່ມຕົ້ນຂອງໄຟລ໌ໃໝ່ເປັນຕົວພິມນ້ອຍ

source: Suspicious include path
lo: ເສັ້ນທາງ include ທີ່ໜ້າສົງໄສ

source: Suspicious unit path
lo: ເສັ້ນທາງ unit ທີ່ໜ້າສົງໄສ

source: Invalid variable name
lo: ຊື່ຕົວປ່ຽນບໍ່ຖືກຕ້ອງ

source: "%s" is not a valid identifier.
lo: "%s" ບໍ່ແມ່ນຊື່ລະບຸ (identifier) ທີ່ຖືກຕ້ອງ.

source: Override system variable
lo: ຂຽນທັບຕົວປ່ຽນຂອງລະບົບ

source: Switch Filter Settings
lo: ສະລັບການຕັ້ງຄ່າຕົວຕອງ

source: Switch to Favorites tab after asking for component name.
lo: ປ່ຽນໄປແຖບ Favorites ຫຼັງຈາກຖາມຊື່ component.

source: Syntax mode
lo: ໂໝດໄວຍາກອນ

source: system.ppu not found. Check your fpc.cfg.
lo: ບໍ່ພົບ system.ppu. ກວດເບິ່ງ fpc.cfg ຂອງທ່ານ.

source: Tab
lo: ແຖບ

source: Sort tab orders of all child controls of "%s" by their positions?
lo: ລຽງລໍາດັບແຖບຂອງ controls ລູກທັງໝົດຂອງ "%s" ຕາມຕຳແໜ່ງຂອງພວກມັນບໍ່?

source: Move the selected control down in tab order
lo: ຍ້າຍ control ທີ່ເລືອກລົງໃນລຳດັບແຖບ

source: Tab Order of %s
lo: ລຳດັບແຖບຂອງ %s

source: Calculate tab order recursively for child controls
lo: ຄິດໄລ່ລຳດັບແຖບແບບ recursive ສຳລັບ control ລູກ

source: recursively
lo: ແບບ recursive

source: Calculate tab order for controls by their X- and Y- positions
lo: ຄິດໄລ່ລຳດັບແຖບສຳລັບ control ຕາມຕຳແໜ່ງ X ແລະ Y ຂອງພວກມັນ

source: Move the selected control up in tab order
lo: ຍ້າຍ control ທີ່ເລືອກຂຶ້ນໃນລຳດັບແຖບ

source: Tabs for %s
lo: ແຖບສຳລັບ %s

source: Target:
lo: ເປົ້າໝາຍ:

source: Target CPU
lo: CPU ເປົ້າໝາຍ

source: Target file name: (-o, empty = use unit output directory)
lo: ຊື່ໄຟລ໌ເປົ້າໝາຍ: (-o, ວ່າງ = ໃຊ້ໄດເຣັກທໍຣີ output ຂອງ unit)

source: Target file name (-o):
lo: ຊື່ໄຟລ໌ເປົ້າໝາຍ (-o):

source: Target filename of project
lo: ຊື່ໄຟລ໌ເປົ້າໝາຍຂອງໂປຣເຈັກ

source: Target filename + params
lo: ຊື່ໄຟລ໌ເປົ້າໝາຍ + params

source: Target is read only
lo: ເປົ້າໝາຍແມ່ນອ່ານໄດ້ຢ່າງດຽວ

# lazarusidestrconsts.listargetos
source: Target OS
lo: OS ເປົ້າໝາຍ

source: Editable Cell
lo: ຫ້ອງທີ່ແກ້ໄຂໄດ້

source: Insert an editable Cell. Cells can be navigated using the tab key.%0:sThe "param" macro takes a list of comma separated arguments.%0:sThe first argument is the default value.%0:sThe 2nd argument (optional) can be used to link the cell to another cell (syncro edit).%0:s%0:s while param("foo") do param(foo);%0:sInserts 2 independent cells, both with the default text "foo".%0:sThe quotes are optional.%0:s%0:s if param("foo") > 0 and param("foo",sync=1) < 99 then%0:sInserts 2 linked cells, editing either one, will change the other one too.%0:sThe value "1" refers to the position of the other "param()", so if there are more params:%0:s if param("bar") and param(foo) > 0 and param(foo,sync=2) < 99 then%0:sThe 2nd and third are linked (the 3rd refers to "2").%0:s%0:s"Sync" can be shortened to "s":%0:s if param("foo") > 0 and param("foo",s=1) < 99 then%0:s%0:s if param("bar") and param("foo") > 0 and param("foo",sync) < 99 then%0:sThe 2nd and third are linked.%0:sNote: "Sync" has no position and no "=", so it syncs to the previous cell with the same default (in this case "foo").
lo: ແຊກ Cell ທີ່ແກ້ໄຂໄດ້. ສາມາດຍ້າຍໄປມາໄດ້ໂດຍໃຊ້ປຸ່ມ tab.%0:sມາໂຄຣ "param" ຮັບລາຍຊື່ argument ທີ່ຂັ້ນດ້ວຍຈຸດ.%0:sArgument ທີໜຶ່ງແມ່ນຄ່າເລີ່ມຕົ້ນ.%0:sArgument ທີສອງ (ທາງເລືອກ) ສາມາດໃຊ້ເພື່ອເຊື່ອມໂຍງ cell ກັບ cell ອື່ນ (syncro edit).%0:s%0:s while param("foo") do param(foo);%0:sແຊກ 2 cell ທີ່ເປັນເອກະລາດ, ທັງສອງມີຂໍ້ຄວາມເລີ່ມຕົ້ນ "foo".%0:sເຄື່ອງໝາຍວົງຢືມແມ່ນທາງເລືອກ.%0:s%0:s if param("foo") > 0 and param("foo",sync=1) < 99 then%0:sແຊກ 2 cell ທີ່ເຊື່ອມໂຍງກັນ, ການແກ້ໄຂອັນໃດອັນໜຶ່ງ ຈະປ່ຽນແປງອີກອັນໜຶ່ງຄືກັນ.%0:sຄ່າ "1" ໝາຍເຖິງຕຳແໜ່ງຂອງ "param()" ອື່ນ, ດັ່ງນັ້ນຖ້າມີຫຼາຍ params:%0:s if param("bar") and param(foo) > 0 and param(foo,sync=2) < 99 then%0:sອັນທີ 2 ແລະ 3 ແມ່ນເຊື່ອມໂຍງກັນ (ອັນທີ 3 ອ້າງອີງເຖິງ "2").%0:s%0:s"Sync" ສາມາດຫຍໍ້ເປັນ "s":%0:s if param("foo") > 0 and param("foo",s=1) < 99 then%0:s%0:s if param("bar") and param("foo") > 0 and param("foo",sync) < 99 then%0:sອັນທີ 2 ແລະ 3 ແມ່ນເຊື່ອມໂຍງກັນ.%0:sໝາຍເຫດ: "Sync" ບໍ່ມີຕຳແໜ່ງ ແລະ ບໍ່ມີ "=", ດັ່ງນັ້ນມັນຈະ sync ກັບ cell ກ່ອນໜ້າທີ່ມີຄ່າເລີ່ມຕົ້ນດຽວກັນ (ໃນກໍລະນີນີ້ແມ່ນ "foo").

source: Template file
lo: ໄຟລ໌ແມ່ແບບ

source: Test directory
lo: ໄດເຣັກທໍຣີທົດສອບ

source: Test URL
lo: ທົດສອບ URL

source: The Application Bundle was created for "%s"
lo: Application Bundle ຖືກສ້າງຂຶ້ນສຳລັບ "%s"

source: The class "%s" is a TControl and cannot be pasted onto a non control.%sUnable to paste.
lo: ຄລາສ "%s" ແມ່ນ TControl ແລະ ບໍ່ສາມາດວາງໃສ່ບ່ອນທີ່ບໍ່ແມ່ນ control ໄດ້.%sບໍ່ສາມາດວາງໄດ້.

source: The compiler file "%s" does not look correct:%s%s
lo: ໄຟລ໌ຄອມໄພເລີ "%s" ເບິ່ງຄືວ່າບໍ່ຖືກຕ້ອງ:%s%s

source: The component %s can not be deleted because it is not owned by %s.
lo: ອົງປະກອບ %s ບໍ່ສາມາດລຶບໄດ້ ເນື່ອງຈາກມັນບໍ່ໄດ້ເປັນເຈົ້າຂອງໂດຍ %s.

source: The component editor of class "%s" has created the error:%s"%s"
lo: ຕົວແກ້ໄຂອົງປະກອບຂອງຄລາສ "%s" ໄດ້ສ້າງຂໍ້ຜິດພາດ:%s"%s"

source: The component editor of class "%s"%sinvoked with verb #%s "%s"%shas created the error:%s"%s"
lo: ຕົວແກ້ໄຂອົງປະກອບຂອງຄລາສ "%s"%sທີ່ຖືກຮ້ອງຂໍດ້ວຍ verb #%s "%s"%sໄດ້ສ້າງຂໍ້ຜິດພາດ:%s"%s"

source: The component %s is inherited from %s.%sTo delete an inherited component open the ancestor and delete it there.
lo: ອົງປະກອບ %s ຖືກສືບທອດມາຈາກ %s.%sເພື່ອລຶບອົງປະກອບທີ່ຖືກສືບທອດມາ ໃຫ້ເປີດຕົວບັນພະບຸລຸດ (ancestor) ແລະ ລຶບມັນຢູ່ທີ່ນັ້ນ.

source: The component %s is inherited from %s.%sTo rename an inherited component open the ancestor and rename it there.
lo: ອົງປະກອບ %s ຖືກສືບທອດມາຈາກ %s.%sເພື່ອປ່ຽນຊື່ອົງປະກອບທີ່ຖືກສືບທອດມາ ໃຫ້ເປີດຕົວບັນພະບຸລຸດ ແລະ ປ່ຽນຊື່ມັນຢູ່ທີ່ນັ້ນ.

source: The component name must be unique in all components on the form/datamodule.The name is compared case insensitive like a normal Pascal identifier.
lo: ຊື່ອົງປະກອບຕ້ອງບໍ່ຊ້ຳກັນໃນທຸກອົງປະກອບໃນ form/datamodule. ຊື່ແມ່ນຖືກປຽບທຽບແບບບໍ່ສົນຕົວພິມໃຫຍ່-ນ້ອຍ ຄືກັບ Pascal identifier ທົ່ວໄປ.

source: The configuration will be downgraded/converted.
lo: ການຕັ້ງຄ່າຈະຖືກຫຼຸດລະດັບ/ແປງສະພາບ.

source: The %s contains a nonexistent directory:%s%s
lo: %s ປະກອບມີໄດເຣັກທໍຣີທີ່ບໍ່ມີຢູ່ຈິງ:%s%s

source: The %s contains a star * character.%sLazarus uses this as normal character and does not expand this as file mask.
lo: %s ປະກອບມີຕົວອັກສອນດາວ *.%sLazarus ໃຊ້ມັນເປັນຕົວອັກສອນທົ່ວໄປ ແລະ ບໍ່ໄດ້ຂະຫຍາຍມັນເປັນ file mask.

source: The current FPC has no config file. It will probably miss some units. Check your installation of fpc.
lo: FPC ປະຈຸບັນບໍ່ມີໄຟລ໌ config. ມັນອາດຈະຂາດບາງ units. ກະລຸນາກວດສອບການຕິດຕັ້ງ fpc ຂອງທ່ານ.

source: The debugger "%s"%sdoes not exist or is not executable.%sSee Tools -> Options -> Debugger options
lo: ດີບັກເກີ "%s"%sບໍ່ມີຢູ່ ຫຼື ບໍ່ສາມາດ एग्जीक्यूट (execute) ໄດ້.%sເບິ່ງ Tools -> Options -> Debugger options

source: The default mode must be stored in project, not in session.
lo: ໂໝດເລີ່ມຕົ້ນຕ້ອງຖືກບັນທຶກໄວ້ໃນໂປຣເຈັກ, ບໍ່ແມ່ນໃນ session.

source: The destination directory%s"%s" does not exist.
lo: ໄດເຣັກທໍຣີປາຍທາງ%s"%s" ບໍ່ມີຢູ່.

source: The directory "%s" contains no project include files any more. Remove this directory from the project's include search path?
lo: ໄດເຣັກທໍຣີ "%s" ບໍ່ມີໄຟລ໌ include ຂອງໂປຣເຈັກອີກຕໍ່ໄປ. ລຶບໄດເຣັກທໍຣີນີ້ອອກຈາກເສັ້ນທາງຄົ້ນຫາ include ຂອງໂປຣເຈັກບໍ່?

source: The directory "%s" contains no project units any more. Remove this directory from the project's unit search path?
lo: ໄດເຣັກທໍຣີ "%s" ບໍ່ມີ units ຂອງໂປຣເຈັກອີກຕໍ່ໄປ. ລຶບໄດເຣັກທໍຣີນີ້ອອກຈາກເສັ້ນທາງຄົ້ນຫາ unit ຂອງໂປຣເຈັກບໍ່?

source: The directory "%s" is no longer needed in the unit path.%sRemove it?
lo: ໄດເຣັກທໍຣີ "%s" ບໍ່ຈຳເປັນໃນເສັ້ນທາງ unit ອີກຕໍ່ໄປ.%sລຶບມັນອອກບໍ່?

source: The file "%s"
lo: ໄຟລ໌ "%s"

source: The file index is needed for functions like find declaration. While scanning you can edit sources and compile, but functions like find declaration will show unit-not-found errors. This can take a minute.
lo: ດັດຊະນີໄຟລ໌ (file index) ຈຳເປັນສຳລັບຟັງຊັນເຊັ່ນ ການຄົ້ນຫາການປະກາດ (find declaration). ໃນຂະນະທີ່ກຳລັງສະແກນ ທ່ານສາມາດແກ້ໄຂ source ແລະ compile ໄດ້, ແຕ່ຟັງຊັນເຊັ່ນ ການຄົ້ນຫາການປະກາດ ຈະສະແດງຂໍ້ຜິດພາດ unit-not-found. ການດຳເນີນການນີ້ອາດໃຊ້ເວລາຈັກໜ້ອຍ.

source: The file "%s" is not a Lazarus project.%sCreate a new project for this "%s"?
lo: ໄຟລ໌ "%s" ບໍ່ແມ່ນໂປຣເຈັກ Lazarus.%sສ້າງໂປຣເຈັກໃໝ່ສຳລັບ "%s" ນີ້ບໍ່?

source: The file mask "%s" is invalid.
lo: File mask "%s" ບໍ່ຖືກຕ້ອງ.

source: The file mask "%s" is not a valid regular expression.
lo: File mask "%s" ບໍ່ແມ່ນ regular expression ທີ່ຖືກຕ້ອງ.

source: The file "%s" seems to be a program.%sClose current project and create a new Lazarus project for this program?%s"No" will load the file as normal source.
lo: ໄຟລ໌ "%s" ເບິ່ງຄືວ່າເປັນໂປຣແກຣມ.%sປິດໂປຣເຈັກປະຈຸບັນ ແລະ ສ້າງໂປຣເຈັກ Lazarus ໃໝ່ສຳລັບໂປຣແກຣມນີ້ບໍ່?%s"No" ຈະໂຫຼດໄຟລ໌ເປັນ source ປົກກະຕິ.

source: The file %s seems to be the program file of an existing Lazarus Project.
lo: ໄຟລ໌ %s ເບິ່ງຄືວ່າເປັນໄຟລ໌ໂປຣແກຣມຂອງໂປຣເຈັກ Lazarus ທີ່ມີຢູ່ແລ້ວ.

source: The file "%s" was not found.%sDo you want to locate it yourself?
lo: ບໍ່ພົບໄຟລ໌ "%s".%sທ່ານຕ້ອງການຊອກຫາມັນດ້ວຍຕົນເອງບໍ່?

source: The file "%s" was not found.%sIgnore will go on loading the project,%sAbort will stop the loading.
lo: ບໍ່ພົບໄຟລ໌ "%s".%sIgnore ຈະໂຫຼດໂປຣເຈັກຕໍ່ໄປ,%sAbort ຈະຢຸດການໂຫຼດ.

source: The following methods used by %s are not in the source%s%s%s%s%sRemove the dangling references?
lo: ເມທອດຕໍ່ໄປນີ້ທີ່ໃຊ້ໂດຍ %s ບໍ່ຢູ່ໃນ source%s%s%s%s%sລຶບການອ້າງອີງທີ່ບໍ່ມີຕົວຕົນເຫຼົ່ານັ້ນອອກບໍ່?

source: The FPC source directory "%s" does not look correct:%s%s
lo: ໄດເຣັກທໍຣີ source ຂອງ FPC "%s" ເບິ່ງຄືວ່າບໍ່ຖືກຕ້ອງ:%s%s

source: The Fppkg configuration file "%s" does not look correct:%s%s
lo: ໄຟລ໌ການຕັ້ງຄ່າ Fppkg "%s" ເບິ່ງຄືວ່າບໍ່ຖືກຕ້ອງ:%s%s

source: The Free Pascal compiler executable typically has the name "%s". You can also use the target specific compiler like "%s". Please give the full file path.
lo: ໄຟລ໌ एग्जीक्यूट (executable) ຂອງ Free Pascal compiler ໂດຍທົ່ວໄປມີຊື່ວ່າ "%s". ທ່ານຍັງສາມາດໃຊ້ compiler ສະເພາະເປົ້າໝາຍເຊັ່ນ "%s". ກະລຸນາລະບຸເສັ້ນທາງໄຟລ໌ເຕັມ.

source: The IDE is still building.
lo: IDE ຍັງກຳລັງ build ຢູ່.

source: The identifier is a unit. Please use the File - Save as function to rename a unit.
lo: ຊື່ລະບຸ (identifier) ແມ່ນ unit. ກະລຸນາໃຊ້ຟັງຊັນ File - Save as ເພື່ອປ່ຽນຊື່ unit.

source: The identifier is a %s.%sNew file(s) will be created, old can be deleted.%sProceed anyway?
lo: ຊື່ລະບຸແມ່ນ %s.%sໄຟລ໌ໃໝ່ຈະຖືກສ້າງຂຶ້ນ, ອັນເກົ່າສາມາດລຶບໄດ້.%sດຳເນີນການຕໍ່ບໍ່?

source: The key %s is already assigned to %s%s.%s%sRemove the old assignment and assign the key to the new function %s?
lo: ປຸ່ມ %s ຖືກກຳນົດໃຫ້ກັບ %s%s ແລ້ວ.%s%sລຶບການກຳນົດເກົ່າ ແລະ ກຳນົດປຸ່ມໃຫ້ກັບຟັງຊັນໃໝ່ %s ບໍ່?

source: The Application Bundle %s%sneeded for execution does not exist or is not executable.%sDo you want to create one?%sSee Project -> Project Options -> Application for settings.
lo: Application Bundle %s%sທີ່ຈຳເປັນສຳລັບການ एग्जीक्यूट (execution) ບໍ່ມີຢູ່ ຫຼື ບໍ່ສາມາດ एग्जीक्यूट ໄດ້.%sທ່ານຕ້ອງການສ້າງມັນບໍ່?%sເບິ່ງ Project -> Project Options -> Application ສຳລັບການຕັ້ງຄ່າ.

source: The launching application "%s"%sdoes not exist or is not executable.%sSee Run -> Run parameters -> Local
lo: ແອັບພລິເຄຊັນ launching "%s"%sບໍ່ມີຢູ່ ຫຼື ບໍ່ສາມາດ एग्जीक्यूट ໄດ້.%sເບິ່ງ Run -> Run parameters -> Local

source: The Lazarus directory contains the sources of the IDE and the package files of LCL and many standard packages. For example it contains the file "ide%slazarus.lpi". The translation files are located there too.
lo: ໄດເຣັກທໍຣີ Lazarus ປະກອບມີ source ຂອງ IDE ແລະ ໄຟລ໌ package ຂອງ LCL ແລະ packages ມາດຕະຖານຫຼາຍຢ່າງ. ຕົວຢ່າງ ມັນປະກອບມີໄຟລ໌ "ide%slazarus.lpi". ໄຟລ໌ແປພາສາກໍ່ຕັ້ງຢູ່ທີ່ນັ້ນເຊັ່ນກັນ.

source: The Lazarus directory "%s" does not look correct:%s%s
lo: ໄດເຣັກທໍຣີ Lazarus "%s" ເບິ່ງຄືວ່າບໍ່ຖືກຕ້ອງ:%s%s

source: The Lazarus sources use a different list of base packages.%sIt is recommended to compile the IDE clean using lazbuild.
lo: Source ຂອງ Lazarus ໃຊ້ລາຍຊື່ base packages ທີ່ແຕກຕ່າງກັນ.%sແນະນຳໃຫ້ compile IDE ແບບ clean ໂດຍໃຊ້ lazbuild.
