Repository: fpc/Lazarus
Catalog: languages/lazaruside.*.po
Languages: lo

source: The package %s is required by %s which is marked for installation.%sSee package graph.
lo: ແພັກເກັດ %s ເປັນທີ່ຕ້ອງການໂດຍ %s ເຊິ່ງຖືກໝາຍໄວ້ສຳລັບການຕິດຕັ້ງ.%sເບິ່ງ package graph.

source: The package name "%s" is not a valid package name%sPlease choose another name (e.g. package1.lpk)
lo: ຊື່ແພັກເກັດ "%s" ບໍ່ແມ່ນຊື່ແພັກເກັດທີ່ຖືກຕ້ອງ%sກະລຸນາເລືອກຊື່ອື່ນ (ເຊັ່ນ: package1.lpk)

source: The package name "%s" of%sthe file "%s" is invalid.
lo: ຊື່ແພັກເກັດ "%s" ຂອງ%sໄຟລ໌ "%s" ບໍ່ຖືກຕ້ອງ.

source: The package "%s" was marked.%sCurrently Lazarus only supports static linked packages. The real un-installation needs rebuilding and restarting of Lazarus.%sDo you want to rebuild Lazarus now?
lo: ແພັກເກັດ "%s" ຖືກໝາຍໄວ້.%sປະຈຸບັນ Lazarus ຮອງຮັບພຽງແຕ່ແພັກເກັດທີ່ເຊື່ອມໂຍງແບບ static. ການຖອນການຕິດຕັ້ງທີ່ແທ້ຈິງຕ້ອງການການ rebuilding ແລະ restarting ຂອງ Lazarus.%sເຈົ້າຕ້ອງການ rebuild Lazarus ດຽວນີ້ບໍ່?

source: The package "%s" was marked for installation.%sCurrently Lazarus only supports static linked packages. The real installation needs rebuilding and restarting of Lazarus.%sDo you want to rebuild Lazarus now?
lo: ແພັກເກັດ "%s" ຖືກໝາຍໄວ້ສຳລັບການຕິດຕັ້ງ.%sປະຈຸບັນ Lazarus ຮອງຮັບພຽງແຕ່ແພັກເກັດທີ່ເຊື່ອມໂຍງແບບ static. ການຕິດຕັ້ງທີ່ແທ້ຈິງຕ້ອງການການ rebuilding ແລະ restarting ຂອງ Lazarus.%sເຈົ້າຕ້ອງການ rebuild Lazarus ດຽວນີ້ບໍ່?

source: The project requires the package "%s".%sBut it was not found. See Project -> Project Inspector.
lo: ໂຄງການຕ້ອງການແພັກເກັດ "%s".%sແຕ່ມັນບໍ່ພົບ. ເບິ່ງ Project -> Project Inspector.

source: There are two units with the same name:%s1. "%s" from %s%s2. "%s" from %s
lo: ມີສອງ units ທີ່ມີຊື່ດຽວກັນ:%s1. "%s" ຈາກ %s%s2. "%s" ຈາກ %s

source: There is a circular dependency in the packages. See package graph.
lo: ມີ circular dependency ໃນແພັກເກັດ. ເບິ່ງ package graph.

source: There is a FPC unit with the same name as a package:%s"%s"
lo: ມີ FPC unit ທີ່ມີຊື່ດຽວກັນກັບແພັກເກັດ:%s"%s"

source: There is a FPC unit with the same name as:%s"%s" from %s
lo: ມີ FPC unit ທີ່ມີຊື່ດຽວກັນກັບ:%s"%s" ຈາກ %s

source: There is already another package with the name "%s".%sConflict package: "%s"%sFile: "%s"
lo: ມີແພັກເກັດອື່ນທີ່ມີຊື່ "%s" ຢູ່ແລ້ວ.%sແພັກເກັດທີ່ຂັດແຍ່ງ: "%s"%sໄຟລ໌: "%s"

source: There is already a package "%s" loaded%sfrom file "%s".%sSee Package -> Package Graph.%sReplace is impossible.
lo: ມີແພັກເກັດ "%s" ໂຫຼດຢູ່ແລ້ວ%sຈາກໄຟລ໌ "%s".%sເບິ່ງ Package -> Package Graph.%sການແທນທີ່ເປັນໄປບໍ່ໄດ້.

source: There is an unsaved package in the required packages. See package graph.
lo: ມີແພັກເກັດທີ່ຍັງບໍ່ໄດ້ບັນທຶກໃນ required packages. ເບິ່ງ package graph.

source: There is a unit with the same name as a package:%s1. "%s" from %s%s2. "%s"
lo: ມີ unit ທີ່ມີຊື່ດຽວກັນກັບແພັກເກັດ:%s1. "%s" ຈາກ %s%s2. "%s"

source: This is a virtual package. It has no source yet. Please save the package first.
lo: ນີ້ແມ່ນ virtual package. ມັນຍັງບໍ່ມີຊອດໂຄດ. ກະລຸນາບັນທຶກແພັກເກັດກ່ອນ.

source: Unable to create target directory for Lazarus:%s"%s".%sThis directory is needed for the new changed Lazarus IDE with your custom packages.
lo: ບໍ່ສາມາດສ້າງໂຟນເດີເປົ້າໝາຍສຳລັບ Lazarus:%s"%s".%sໂຟນເດີນີ້ແມ່ນຈຳເປັນສຳລັບ Lazarus IDE ທີ່ປ່ຽນແປງໃໝ່ກັບ custom packages ຂອງເຈົ້າ.

source: Unable to write package "%s"%sto file "%s".%sError: %s
lo: ບໍ່ສາມາດຂຽນແພັກເກັດ "%s"%sລົງໄຟລ໌ "%s".%sຂໍ້ຜິດພາດ: %s

source: Uninstall package?
lo: ຖອນການຕິດຕັ້ງແພັກເກັດບໍ່?

source: Uninstall package %s?
lo: ຖອນການຕິດຕັ້ງແພັກເກັດ %s ບໍ່?

source: Unsaved package
lo: ແພັກເກັດທີ່ຍັງບໍ່ໄດ້ບັນທຶກ

source: Use unit
lo: ໃຊ້ Unit

source: Warning: The file "%s"%sbelongs to the current project.
lo: ຄຳເຕືອນ: ໄຟລ໌ "%s"%sເປັນຂອງໂຄງການປະຈຸບັນ.

# lazarusidestrconsts.lispkgmgrkeep
source: keep
lo: ເກັບໄວ້

# lazarusidestrconsts.lispkgmgrnew
source: new
lo: ໃໝ່

# lazarusidestrconsts.lispkgmgrremove
source: remove
lo: ເອົາອອກ

source: Select a package
lo: ເລືອກແພັກເກັດ

source: The following dependencies are not needed because of the automatic transitivity between package dependencies.
lo: Dependencies ຕໍ່ໄປນີ້ບໍ່ຈຳເປັນເນື່ອງຈາກ automatic transitivity ລະຫວ່າງ package dependencies.

source: The project overrides the output directory of the following packages.%sSee Project / Project Options (compiler options section) / Additions and Overrides%s%s
lo: ໂຄງການກຳນົດໂຟນເດີຜົນລັບຂອງແພັກເກັດຕໍ່ໄປນີ້ທັບຊ້ອນ.%sເບິ່ງ Project / Project Options (compiler options section) / Additions and Overrides%s%s

source: This file is not in any loaded package.
lo: ໄຟລ໌ນີ້ບໍ່ຢູ່ໃນແພັກເກັດທີ່ໂຫຼດຢູ່ເລີຍ.

source: Unable to read package file "%s".%sError: %s
lo: ບໍ່ສາມາດອ່ານໄຟລ໌ແພັກເກັດ "%s".%sຂໍ້ຜິດພາດ: %s

source: Play
lo: ຫຼິ້ນ

source: Online
lo: ອອນລາຍ

source: Online packages cannot be deleted
lo: Online packages ບໍ່ສາມາດຖືກລຶບໄດ້

source: Package Links
lo: ລິງກ໌ແພັກເກັດ

source: Show global links in
lo: ສະແດງ global links ໃນ

source: Show online links
lo: ສະແດງລິງກ໌ອອນລາຍ

source: Show user links in
lo: ສະແດງ user links ໃນ

source: Some packages cannot be deleted
lo: ບາງແພັກເກັດບໍ່ສາມາດຖືກລຶບໄດ້

source: User
lo: ຜູ້ໃຊ້

source: Please fix the error shown in the message window which is normally below the source editor.
lo: ກະລຸນາແກ້ໄຂຂໍ້ຜິດພາດທີ່ສະແດງໃນໜ້າຕ່າງຂໍ້ຄວາມ ເຊິ່ງປົກກະຕິຈະຢູ່ທາງລຸ່ມຂອງຕົວແກ້ໄຂຊອດໂຄດ.

source: Please open a unit before run.
lo: ກະລຸນາເປີດ Unit ກ່ອນທີ່ຈະ Run.

source: Please place the editor caret on an identifier. If this is a new unit, please save the file first.
lo: ກະລຸນາວາງ editor caret ໃສ່ identifier. ຖ້ານີ້ແມ່ນ Unit ໃໝ່, ກະລຸນາບັນທຶກໄຟລ໌ກ່ອນ.

source: Please select some code to extract a new procedure/method.
lo: ກະລຸນາເລືອກບາງໂຄດເພື່ອ extract procedure/method ໃໝ່.

# lazarusidestrconsts.lisplistall
source: <All>
lo: <ທັງໝົດ>

source: Change Font
lo: ປ່ຽນຟອນ

source: Copy method name to the clipboard
lo: ສຳເນົາຊື່ method ໄປທີ່ clipboard

source: Filter by matching any part of method
lo: ກັ່ນຕອງໂດຍການຈັບຄູ່ສ່ວນໃດໜຶ່ງຂອງ method

source: Filter by matching with start of method
lo: ກັ່ນຕອງໂດຍການຈັບຄູ່ກັບການເລີ່ມຕົ້ນຂອງ method

source: Jump To Selection
lo: ໄປທີ່ສ່ວນທີ່ເລືອກ

source: <None>
lo: <ບໍ່ມີ>

source: Procedure List
lo: ລາຍການ Procedure

# lazarusidestrconsts.lisplisttype
source: Type
lo: ຊະນິດ

source: Choose .po file directory
lo: ເລືອກໂຟນເດີໄຟລ໌ .po

source: Do not save any session info
lo: ບໍ່ບັນທຶກຂໍ້ມູນ session ໃດໆ

source: Save in .lps file in IDE config directory
lo: ບັນທຶກໃນໄຟລ໌ .lps ໃນໂຟນເດີຕັ້ງຄ່າ IDE

source: Save in .lpi file
lo: ບັນທຶກໃນໄຟລ໌ .lpi

source: Save in .lps file in project directory
lo: ບັນທຶກໃນໄຟລ໌ .lps ໃນໂຟນເດີໂຄງການ

source: Save session information in
lo: ບັນທຶກຂໍ້ມູນ session ໃນ

source: .lpi is the project main info file, .lps is a separate file for session data only.
lo: .lpi ແມ່ນໄຟລ໌ຂໍ້ມູນຫຼັກຂອງໂຄງການ, .lps ແມ່ນໄຟລ໌ແຍກຕ່າງຫາກສຳລັບຂໍ້ມູນ session ເທົ່ານັ້ນ.

source: Position
lo: ຕຳແໜ່ງ

source: %s (position outside of source)
lo: %s (ຕຳແໜ່ງຢູ່ນອກຊອດໂຄດ)

source: ppu in wrong directory=%s.
lo: ppu ຢູ່ໃນໂຟນເດີຜິດ=%s.

source: %s.ppu not found. Check your fpc.cfg.
lo: ບໍ່ພົບ %s.ppu. ກວດເບິ່ງ fpc.cfg ຂອງເຈົ້າ.

source: Preceding word
lo: ຄຳກ່ອນໜ້າ

source: Primary config directory where Lazarus stores its config files. Default is "%s".
lo: ໂຟນເດີການຕັ້ງຄ່າຫຼັກທີ່ Lazarus ເກັບໄຟລ໌ການຕັ້ງຄ່າ. ຄ່າເລີ່ມຕົ້ນແມ່ນ "%s".

source: Primary config path
lo: ເສັ້ນທາງການຕັ້ງຄ່າຫຼັກ

source: prior %s
lo: %s ກ່ອນໜ້າ

# lazarusidestrconsts.lispriority
source: Priority
lo: ຄວາມສຳຄັນ

source: Probably you need to install some packages before continuing.%sWarning:%sThe project uses the following design time packages which might be needed to open the form in the designer. If you continue, you might get errors about missing components and the form loading will probably create very unpleasant results.%sIt is recommended to cancel and install these packages first.
lo: ອາດຈະເປັນໄປໄດ້ວ່າເຈົ້າຈຳເປັນຕ້ອງຕິດຕັ້ງບາງແພັກເກັດກ່ອນທີ່ຈະດຳເນີນການຕໍ່.%sຄຳເຕືອນ:%sໂຄງການໃຊ້ design time packages ຕໍ່ໄປນີ້ ເຊິ່ງອາດຈະຈຳເປັນໃນການເປີດຟອມໃນ designer. ຖ້າເຈົ້າດຳເນີນການຕໍ່, ເຈົ້າອາດຈະໄດ້ຮັບຂໍ້ຜິດພາດກ່ຽວກັບ components ທີ່ຂາດຫາຍ ແລະ ການໂຫຼດຟອມອາດຈະສ້າງຜົນລັບທີ່ບໍ່ໜ້າພໍໃຈ.%sແນະນຳໃຫ້ຍົກເລີກ ແລະ ຕິດຕັ້ງແພັກເກັດເຫຼົ່ານີ້ກ່ອນ.

source: Procedure with interface
lo: Procedure ທີ່ມີ interface

# lazarusidestrconsts.lisprogram
source: Program
lo: ໂປຣແກຣມ

source: Program detected
lo: ກວດພົບໂປຣແກຣມ

source: A Free Pascal command line program with some useful settings added.
lo: ໂປຣແກຣມ Free Pascal command line ທີ່ມີການຕັ້ງຄ່າທີ່ເປັນປະໂຫຍດເພີ່ມເຂົ້າມາ.

source: Program source must have a Pascal extension like .pas, .pp or .lpr
lo: ຊອດໂຄດໂປຣແກຣມຕ້ອງມີນາມສະກຸນ Pascal ເຊັ່ນ .pas, .pp ຫຼື .lpr

source: Dependency already exists
lo: Dependency ມີຢູ່ແລ້ວ

source: Add Editor Files
lo: ເພີ່ມໄຟລ໌ Editor

source: Invalid Min-Max version
lo: ເວີຊັນ Min-Max ບໍ່ຖືກຕ້ອງ

source: Invalid version
lo: ເວີຊັນບໍ່ຖືກຕ້ອງ

source: Maximum Version (optional):
lo: ເວີຊັນສູງສຸດ (ທາງເລືອກ):

source: Minimum Version (optional):
lo: ເວີຊັນຕໍ່າສຸດ (ທາງເລືອກ):

source: New FPMake Requirement
lo: FPMake Requirement ໃໝ່

source: New Requirement
lo: Requirement ໃໝ່

source: Package Name:
lo: ຊື່ແພັກເກັດ:

source: Package not found
lo: ບໍ່ພົບແພັກເກັດ

source: Package Type:
lo: ຊະນິດແພັກເກັດ:

source: The dependency "%s" was not found.%sPlease choose an existing package.
lo: ບໍ່ພົບ dependency "%s".%sກະລຸນາເລືອກແພັກເກັດທີ່ມີຢູ່.

# lazarusidestrconsts.lisprojaddthemaximumversionisinvalid
source: The Maximum Version "%s" is invalid.%sPlease use the format major.minor.release.build%sFor example: 1.0.20.10
lo: ເວີຊັນສູງສຸດ "%s" ບໍ່ຖືກຕ້ອງ.%sກະລຸນາໃຊ້ຮູບແບບ major.minor.release.build%sຕົວຢ່າງ: 1.0.20.10

# lazarusidestrconsts.lisprojaddthemaximumversionislowerthantheminimimversion
source: The Maximum Version is lower than the Minimim Version.
lo: ເວີຊັນສູງສຸດ ຕ່ຳກວ່າ ເວີຊັນຕໍ່າສຸດ.

# lazarusidestrconsts.lisprojaddtheminimumversionisinvalid
source: The Minimum Version "%s" is invalid.%sPlease use the format major.minor.release.build%sFor example: 1.0.20.10
lo: ເວີຊັນຕໍ່າສຸດ "%s" ບໍ່ຖືກຕ້ອງ.%sກະລຸນາໃຊ້ຮູບແບບ major.minor.release.build%sຕົວຢ່າງ: 1.0.20.10

source: The project has already a dependency for the package "%s".
lo: ໂຄງການມີ dependency ສຳລັບແພັກເກັດ "%s" ຢູ່ແລ້ວ.

source: The unit name "%s" already exists in the project%swith file: "%s".
lo: ຊື່ Unit "%s" ມີຢູ່ໃນໂຄງການແລ້ວ%sກັບໄຟລ໌: "%s".

source: The unit name "%s" already exists in the selection%swith file: "%s".
lo: ຊື່ Unit "%s" ມີຢູ່ໃນສ່ວນທີ່ເລືອກແລ້ວ%sກັບໄຟລ໌: "%s".

source: Unit name already exists
lo: ຊື່ Unit ມີຢູ່ແລ້ວ

source: Project %s
lo: ໂຄງການ %s

source: Project:
lo: ໂຄງການ:

source: project
lo: ໂຄງການ

source: Project changed
lo: ໂຄງການມີການປ່ຽນແປງ

source: Project changed on disk
lo: ໂຄງການມີການປ່ຽນແປງໃນດິດສ໌

# lazarusidestrconsts.lisprojectdirectory
source: Project directory
lo: ໂຟນເດີໂຄງການ

source: Project filename
lo: ຊື່ໄຟລ໌ໂຄງການ

source: Project Include Path
lo: ເສັ້ນທາງ Include ຂອງໂຄງການ

source: Project info file detected
lo: ກວດພົບໄຟລ໌ຂໍ້ມູນໂຄງການ

source: Project is runnable
lo: ໂຄງການສາມາດ Run ໄດ້

source: Generates a binary executable which can be run.
lo: ສ້າງ binary executable ເຊິ່ງສາມາດ run ໄດ້.

# lazarusidestrconsts.lisprojectmacro
source: Project
lo: ໂຄງການ

source: Project macro properties
lo: ຄຸນສົມບັດ macro ຂອງໂຄງການ

source: Project Namespaces
lo: Namespaces ຂອງໂຄງການ

source: Project Option
lo: ຕົວເລືອກໂຄງການ

source: Project Output directory (e.g. the ppu directory)
lo: ໂຟນເດີຜົນລັບໂຄງການ (ເຊັ່ນ: ໂຟນເດີ ppu)

source: Project output directory
lo: ໂຟນເດີຜົນລັບໂຄງການ

source: Directory where project's main file must be
lo: ໂຟນເດີທີ່ໄຟລ໌ຫຼັກຂອງໂຄງການຕ້ອງຢູ່

source: Project Session
lo: Session ໂຄງການ

source: Project session changed
lo: Session ໂຄງການມີການປ່ຽນແປງ

source: Project source directories
lo: ໂຟນເດີຊອດໂຄດຂອງໂຄງການ

source: %0:s%0:s At address %1:x
lo: %0:s%0:s ທີ່ທີ່ຢູ່ %1:x

source: Project %s raised exception class '%s'.
lo: ໂຄງການ %s ເກີດ exception class '%s'.

source: Project %s raised exception class '%s' with message:%s%s
lo: ໂຄງການ %s ເກີດ exception class '%s' ພ້ອມຂໍ້ຄວາມ:%s%s

source: %0:s%0:s In file '%1:s' at address %2:x
lo: %0:s%0:s ໃນໄຟລ໌ '%1:s' ທີ່ທີ່ຢູ່ %2:x

source: %0:s%0:s In file '%1:s' at line %2:d
lo: %0:s%0:s ໃນໄຟລ໌ '%1:s' ທີ່ແຖວ %2:d

source: %0:s%0:s In file '%1:s' at line %2:d:%0:s%3:s
lo: %0:s%0:s ໃນໄຟລ໌ '%1:s' ທີ່ແຖວ %2:d:%0:s%3:s

source: Project Src Path
lo: ເສັ້ນທາງ Src ຂອງໂຄງການ

source: project unit
lo: unit ໂຄງການ

source: Project Unit Path
lo: ເສັ້ນທາງ Unit ຂອງໂຄງການ

source: Project version
lo: ເວີຊັນໂຄງການ

source: Project Wizard
lo: ຕົວຊ່ວຍສ້າງໂຄງການ

source: Confirm deleting dependency
lo: ຢືນຢັນການລຶບ dependency

source: Confirm removing file
lo: ຢືນຢັນການລຶບໄຟລ໌

source: Delete dependency for %s?
lo: ລຶບ dependency ສຳລັບ %s ບໍ່?

source: Project Inspector - %s
lo: ຕົວກວດສອບໂຄງການ - %s

# lazarusidestrconsts.lisprojinspremovedrequiredpackages
source: Removed required packages
lo: ແພັກເກັດທີ່ຈຳເປັນທີ່ຖືກລຶບ

source: Remove file %s from project?
lo: ເອົາໄຟລ໌ %s ອອກຈາກໂຄງການບໍ່?

source: Remove %s items from project?
lo: ເອົາ %s ລາຍການອອກຈາກໂຄງການບໍ່?

source: Always build (even if nothing changed)
lo: Build ສະເໝີ (ເຖິງແມ່ນວ່າບໍ່ມີຫຍັງປ່ຽນແປງ)

source: May be needed if there is a bug in dependency check, normally not needed.
lo: ອາດຈະຈຳເປັນຖ້າມີ bug ໃນ dependency check, ປົກກະຕິແລ້ວບໍ່ຈຳເປັນ.

# lazarusidestrconsts.lisprojoptserror
source: Error
lo: ຂໍ້ຜິດພາດ

source: Unable to change the auto create form list in the program source.%sPlease fix errors first.
lo: ບໍ່ສາມາດປ່ຽນແປງ auto create form list ໃນຊອດໂຄດໂປຣແກຣມ.%sກະລຸນາແກ້ໄຂຂໍ້ຜິດພາດກ່ອນ.

source: Prompt for value
lo: ຖາມຫາຄ່າ

source: Properties (replace or remove)
lo: ຄຸນສົມບັດ (ແທນທີ່ ຫຼື ເອົາອອກ)

source: %s property
lo: ຄຸນສົມບັດ %s

source: Published to %s
lo: Published ໄປທີ່ %s

source: Files belonging to project / package will be included automatically.
lo: ໄຟລ໌ທີ່ເປັນຂອງ ໂຄງການ / ແພັກເກັດ ຈະຖືກລວມເຂົ້າໂດຍອັດຕະໂນມັດ.

source: Publish project directory
lo: ເຜີຍແຜ່ໂຟນເດີໂຄງການ

source: Publish Project
lo: ເຜີຍແຜ່ໂຄງການ

source: Save .lrs files in the output directory
lo: ບັນທຶກໄຟລ໌ .lrs ໃນໂຟນເດີຜົນລັບ

source: The resource will be available for FPC.
lo: Resource ຈະມີໃຫ້ສຳລັບ FPC.

# lazarusidestrconsts.lispvuapascalunitmusthavetheextensionpporpas
source: A Pascal unit must have the extension .pp or .pas
lo: Pascal unit ຕ້ອງມີນາມສະກຸນ .pp ຫຼື .pas

source: Edit virtual unit
lo: ແກ້ໄຂ virtual unit

# lazarusidestrconsts.lispvuthereisalreadyanunitwiththisnamefile
source: There is already an unit with this name.%sFile: %s
lo: ມີ unit ທີ່ມີຊື່ນີ້ຢູ່ແລ້ວ.%sໄຟລ໌: %s

# lazarusidestrconsts.lispvutheunitnameisnotavalidpascalidentifier
source: The unitname is not a valid Pascal identifier.
lo: ຊື່ Unit ບໍ່ແມ່ນ Pascal identifier ທີ່ຖືກຕ້ອງ.

# lazarusidestrconsts.lispvuunitnameandfilenamedonotmatchexampleunit1pasanduni
source: Unitname and Filename do not match.%sExample: unit1.pas and Unit1
lo: ຊື່ Unit ແລະ ຊື່ໄຟລ໌ບໍ່ກົງກັນ.%sຕົວຢ່າງ: unit1.pas ແລະ Unit1

source: Convert &Delphi Project
lo: ແປງໂຄງການ &Delphi

source: &New Project
lo: ໂຄງການໃ&ໝ່

source: &Open Project
lo: ເ&ປີດໂຄງການ

# lazarusidestrconsts.lispwopenrecentproject
source: Open &Recent Project
lo: ເປີດໂຄງການ&ຫຼ້າສຸດ

source: View &Example Projects
lo: ເບິ່ງໂຄງການ&ຕົວຢ່າງ

source: Quick check Fppkg configuration at start
lo: ກວດສອບການຕັ້ງຄ່າ Fppkg ດ່ວນຕອນເລີ່ມຕົ້ນ

source: QuickFix error
lo: ຂໍ້ຜິດພາດ QuickFix

source: Search identifier
lo: ຄົ້ນຫາ identifier

# lazarusidestrconsts.lisquit
source: Quit
lo: ອອກ

source: &Quit Lazarus
lo: &ອອກຈາກ Lazarus

source: Really delete?
lo: ຕ້ອງການລຶບແທ້ບໍ່?

source: Recent tabs
lo: ແຖບຫຼ້າສຸດ

source: Recorded
lo: ທີ່ບັນທຶກໄວ້

# lazarusidestrconsts.lisredo
source: Redo
lo: ເຮັດຄືນ

# lazarusidestrconsts.lisremove
source: Remove
lo: ເອົາອອກ

source: Remove?
lo: ເອົາອອກບໍ່?

source: Remove all invalid properties
lo: ເອົາຄຸນສົມບັດທີ່ບໍ່ຖືກຕ້ອງທັງໝົດອອກ

source: Remove all message type filters
lo: ເອົາຕົວກອງຊະນິດຂໍ້ຄວາມທັງໝົດອອກ

source: Remove all units
lo: ເອົາ Unit ທັງໝົດອອກ

source: Remove Compiler Option Hide Message
lo: ເອົາ Compiler Option Hide Message ອອກ

source: Remove %s dependencies from package "%s"?
lo: ເອົາ %s dependencies ອອກຈາກແພັກເກັດ "%s" ບໍ່?

source: Removed property "%s".
lo: ເອົາຄຸນສົມບັດ "%s" ອອກແລ້ວ.

source: Remove %s files from package "%s"?
lo: ເອົາໄຟລ໌ %s ໄຟລ໌ອອກຈາກແພັກເກັດ "%s" ບໍ່?

source: Remove from Project
lo: ເອົາອອກຈາກໂຄງການ

source: Remove from search path
lo: ເອົາອອກຈາກເສັ້ນທາງຄົ້ນຫາ

source: Remove include path?
lo: ເອົາ include path ອອກບໍ່?

source: Remove local variable "%s"
lo: ເອົາຕົວປ່ຽນ local "%s" ອອກ

source: Remove Message Type Filter
lo: ເອົາຕົວກອງຊະນິດຂໍ້ຄວາມອອກ

source: Remove nonexistent files
lo: ເອົາໄຟລ໌ທີ່ບໍ່ມີຢູ່ຈິງອອກ

source: Remove selected units
lo: ເອົາ Unit ທີ່ເລືອກອອກ

source: Remove them
lo: ເອົາພວກມັນອອກ

source: Remove the paths from "Other sources"
lo: ເອົາເສັ້ນທາງອອກຈາກ "Other sources"

source: Remove unit path?
lo: ເອົາ unit path ອອກບໍ່?

source: Remove uses "%s"
lo: ເອົາ uses "%s" ອອກ

# lazarusidestrconsts.lisrename
source: Rename
lo: ປ່ຽນຊື່

source: Rename ...
lo: ປ່ຽນຊື່ ...

source: Rename file?
lo: ປ່ຽນຊື່ໄຟລ໌ບໍ່?

source: Rename file failed
lo: ການປ່ຽນຊື່ໄຟລ໌ລົ້ມເຫຼວ

source: Show list of renamed Identifiers
lo: ສະແດງລາຍການ Identifiers ທີ່ຖືກປ່ຽນຊື່

source: Rename to %s
lo: ປ່ຽນຊື່ເປັນ %s

source: Rename to lowercase
lo: ປ່ຽນຊື່ເປັນຕົວພິມນ້ອຍ

source: Renaming aborted
lo: ການປ່ຽນຊື່ຖືກຍົກເລີກ

source: Renaming conflict
lo: ຂໍ້ຂັດແຍ່ງການປ່ຽນຊື່

source: Reopen project
lo: ເປີດໂຄງການຄືນໃໝ່

source: Reopen with another encoding
lo: ເປີດຄືນໃໝ່ດ້ວຍການເຂົ້າລະຫັດອື່ນ

# lazarusidestrconsts.lisrepeat
source: Repeat
lo: ເຮັດຊໍ້າ

# lazarusidestrconsts.lisreplace
source: Replace
lo: ແທນທີ່

source: Replaced property "%s" with "%s".
lo: ແທນທີ່ຄຸນສົມບັດ "%s" ດ້ວຍ "%s" ແລ້ວ.

source: Replaced type "%s" with "%s".
lo: ແທນທີ່ຊະນິດ "%s" ດ້ວຍ "%s" ແລ້ວ.

source: Replacement
lo: ການແທນທີ່

source: Replacement functions
lo: ຟັງຊັນການແທນທີ່

source: Replacements
lo: ການແທນທີ່

source: Fix unknown properties and types
lo: ແກ້ໄຂຄຸນສົມບັດແລະຊະນິດທີ່ບໍ່ຮູ້ຈັກ

source: Replace whole identifier
lo: ແທນທີ່ identifier ທັງໝົດ

source: Replacing selection failed.
lo: ການແທນທີ່ສ່ວນທີ່ເລືອກລົ້ມເຫຼວ.

source: Rescan
lo: ສະແກນຄືນໃໝ່

# lazarusidestrconsts.lisreset
source: Reset
lo: ຣີເຊັດ

source: Reset all file filters to defaults?
lo: ຣີເຊັດຕົວກອງໄຟລ໌ທັງໝົດເປັນຄ່າເລີ່ມຕົ້ນບໍ່?

source: Reset Left, Top, Width, Height of selected components to their ancestor values?
lo: ຣີເຊັດ Left, Top, Width, Height ຂອງ components ທີ່ເລືອກເປັນຄ່າຂອງ ancestor ບໍ່?

source: Resource name must be unique.
lo: ຊື່ Resource ຕ້ອງບໍ່ຊໍ້າກັນ.

source: Resource save error
lo: ຜິດພາດການບັນທຶກ Resource

source: Resource type of project
lo: ຊະນິດ Resource ຂອງໂຄງການ

# lazarusidestrconsts.lisrestart
source: Restart
lo: ເລີ່ມຕົ້ນໃໝ່

source: Result:
lo: ຜົນລັບ:

source: Return parameter-indexed word from the current line preceding cursor position. Words in a line are numbered 1,2,3,... from left to right, but the last word which is always a macro command to be expanded has number 0, thus $PrevWord(0) is always the current macro. Example line: i 0 count-1 forb| Here $PrevWord(0)=forb, $PrevWord(1)=i, $PrevWord(2)=0, $PrevWord(3)=count-1 In the end of your template use $PrevWord(-1) which expands to an empty string, but performs an important operation of wiping off all of the $PrevWords found. In addition here is a regexp that is used to detect words for this macro: [\w\-+*\(\)\[\].^@]+
lo: Return parameter-indexed word ຈາກແຖວປະຈຸບັນກ່ອນໜ້າຕຳແໜ່ງ cursor. ຄໍາສັບໃນແຖວຖືກໃສ່ໝາຍເລກ 1,2,3,... ຈາກຊ້າຍຫາຂວາ, ແຕ່ຄໍາສັບສຸດທ້າຍ ເຊິ່ງເປັນ macro command ທີ່ຈະຖືກຂະຫຍາຍສະເໝີ ມີໝາຍເລກ 0, ດັ່ງນັ້ນ $PrevWord(0) ຈຶ່ງແມ່ນ macro ປະຈຸບັນສະເໝີ. ຕົວຢ່າງແຖວ: i 0 count-1 forb| ບ່ອນນີ້ $PrevWord(0)=forb, $PrevWord(1)=i, $PrevWord(2)=0, $PrevWord(3)=count-1 ໃນຕອນທ້າຍຂອງ template ຂອງທ່ານ ໃຊ້ $PrevWord(-1) ເຊິ່ງຂະຫຍາຍເປັນ empty string, ແຕ່ ດຳເນີນການທີ່ສຳຄັນໃນການລ້າງ $PrevWords ທັງໝົດທີ່ພົບ. ນອກຈາກນັ້ນ ນີ້ແມ່ນ regexp ທີ່ໃຊ້ເພື່ອ ກວດຫາຄໍາສັບສຳລັບ macro ນີ້: [\w\-+*\(\)\[\].^@]+

source: Return the list of all values of case variable in front of variable. Optional Parameters (comma separated): WithoutExtraIndent // the case list will be generated without extra indentation
lo: Return ລາຍການຂອງຄ່າທັງໝົດຂອງ case variable ຢູ່ທາງຫນ້າ variable. Parameters ທາງເລືອກ (ຂັ້ນດ້ວຍຈຸດ): WithoutExtraIndent // case list ຈະຖືກສ້າງຂຶ້ນໂດຍບໍ່ມີການຫຍໍ້ໜ້າເພີ່ມເຕີມ

source: Revert failed
lo: ການຍ້ອນກັບລົ້ມເຫຼວ

source: Revision:
lo: ສະບັບແກ້ໄຂ:

# lazarusidestrconsts.lisright
source: Right
lo: ຂວາ

source: Right anchoring
lo: ການຍຶດດ້ານຂວາ

source: Right borderspace. This value is added to base borderspace and used for the space right to the control.
lo: Right borderspace. ຄ່ານີ້ຖືກເພີ່ມໃສ່ base borderspace ແລະ ໃຊ້ສຳລັບພື້ນທີ່ ທາງຂວາຂອງ control.

# lazarusidestrconsts.lisrightgutter
source: Right
lo: ຂວາ

source: This is the sibling control to which the right side is anchored. Leave empty for anchoring to parent in Delphi style (BorderSpacing and ReferenceSide do not matter).
lo: ນີ້ແມ່ນ sibling control ທີ່ດ້ານຂວາຖືກຍຶດໄວ້. ປະໄວ້ຫວ່າງສຳລັບ ການຍຶດກັບ parent ໃນແບບ Delphi (BorderSpacing ແລະ ReferenceSide ບໍ່ມີຜົນ).

source: Right sides
lo: ດ້ານຂວາ

source: Right space equally
lo: ໄລຍະຫ່າງດ້ານຂວາເທົ່າກັນ

source: "Run and Design time" packages have no limitations.
lo: ແພັກເກັດ "Run and Design time" ບໍ່ມີຂໍ້ຈຳກັດ.

source: %s (running ...)
lo: %s (ກຳລັງ Run ...)

source: File not executable
lo: ໄຟລ໌ບໍ່ສາມາດປະຕິບັດການໄດ້ (executable)

source: The host application "%s" is not executable.
lo: Host application "%s" ບໍ່ສາມາດປະຕິບັດການໄດ້.

source: Runtime only, cannot be installed in IDE
lo: Runtime only, ບໍ່ສາມາດຕິດຕັ້ງໃນ IDE

source: "Run time only" packages are only for projects. They cannot be installed in the IDE, not even indirectly.
lo: ແພັກເກັດ "Run time only" ແມ່ນສຳລັບໂຄງການເທົ່ານັ້ນ. ພວກມັນບໍ່ສາມາດຕິດຕັ້ງໃນ IDE ໄດ້, ເຖິງແມ່ນວ່າທາງອ້ອມກໍຕາມ.

source: "Run time" packages can be used by projects. They cannot be installed in the IDE unless some design time package requires them.
lo: ແພັກເກັດ "Run time" ສາມາດໃຊ້ໄດ້ໂດຍໂຄງການ. ພວກມັນບໍ່ສາມາດຕິດຕັ້ງໃນ IDE ເວັ້ນແຕ່ design time package ບາງອັນຕ້ອງການພວກມັນ.

source: Run-to failed
lo: Run-to ລົ້ມເຫຼວ

source: Abstract Methods - not yet overridden
lo: Abstract Methods - ຍັງບໍ່ໄດ້ override

source: Abstract methods of %s
lo: Abstract methods ຂອງ %s

source: Cursor is not in a class declaration
lo: ເຄີເຊີບໍ່ຢູ່ໃນການປະກາດ class

source: IDE is busy
lo: IDE ກຳລັງບໍ່ຫວ່າງ

source: %s is an abstract class, it has %s abstract methods.
lo: %s ແມ່ນ abstract class, ມັນມີ %s abstract methods.

source: No abstract methods found
lo: ບໍ່ພົບ abstract methods

source: Override all selected
lo: Override ລາຍການທີ່ເລືອກທັງໝົດ

source: Override first selected
lo: Override ລາຍການທີ່ເລືອກອັນທຳອິດ

source: Select none
lo: ບໍ່ເລືອກເລີຍ

source: There are %s abstract methods to override.%sSelect the methods for which stubs should be created:
lo: ມີ %s abstract methods ທີ່ຕ້ອງ override.%sເລືອກ methods ທີ່ stubs ຄວນຖືກສ້າງຂຶ້ນ:

source: There are no abstract methods left to override.
lo: ບໍ່ມີ abstract methods ເຫຼືອໃຫ້ override.

source: This method can not be overridden because it is defined in the current class
lo: Method ນີ້ບໍ່ສາມາດຖືກ overridden ໄດ້ເພາະວ່າມັນຖືກນິຍາມໃນ class ປະຈຸບັນ

source: Unable to show abstract methods of the current class, because
lo: ບໍ່ສາມາດສະແດງ abstract methods ຂອງ class ປະຈຸບັນ, ເພາະວ່າ

# lazarusidestrconsts.lissave
source: Save
lo: ບັນທຶກ

# lazarusidestrconsts.lissaveall
source: Save All
lo: ບັນທຶກທັງໝົດ

source: Save All Checked
lo: ບັນທຶກທັງໝົດທີ່ໝາຍຕິກ

source: Save all modified files
lo: ບັນທຶກໄຟລ໌ທີ່ມີການແກ້ໄຂທັງໝົດ

source: Save All/Original Messages to File ...
lo: ບັນທຶກ ຂໍ້ຄວາມທັງໝົດ/ຕົ້ນສະບັບ ລົງໄຟລ໌ ...

source: Only Save
lo: ບັນທຶກເທົ່ານັ້ນ

source: Save changed files?
lo: ບັນທຶກໄຟລ໌ທີ່ມີການປ່ຽນແປງບໍ່?

source: Save changes?
lo: ບັນທຶກການປ່ຽນແປງບໍ່?
