Repository: fpc/Lazarus
Catalog: languages/lazaruside.*.po
Languages: lo

source: The LFM (Lazarus form) file contains invalid properties. This means for example it contains some properties/classes which do not exist in the current LCL. The normal fix is to remove these properties from the lfm and fix the Pascal code manually.
lo: ໄຟລ໌ LFM (ຟອມ Lazarus) ປະກອບມີຄຸນສົມບັດທີ່ບໍ່ຖືກຕ້ອງ. ອັນນີ້ໝາຍຄວາມວ່າຕົວຢ່າງມັນປະກອບມີບາງຄຸນສົມບັດ/ຄລາສ ທີ່ບໍ່ມີຢູ່ໃນ LCL ປະຈຸບັນ. ວິທີແກ້ໄຂປົກກະຕິແມ່ນການລຶບຄຸນສົມບັດເຫຼົ່ານີ້ອອກຈາກ lfm ແລະ ແກ້ໄຂໂຄ້ດ Pascal ດ້ວຍຕົນເອງ.

source: The macro "%s" does not begin with "%s".
lo: ມາໂຄຣ "%s" ບໍ່ໄດ້ເລີ່ມຕົ້ນດ້ວຍ "%s".

source: The "make" executable typically has the name "%s". It is needed for building the IDE. Please give the full file path.
lo: ໄຟລ໌ "make" ໂດຍທົ່ວໄປມີຊື່ວ່າ "%s". ມັນຈຳເປັນສຳລັບການ build Lazarus. ກະລຸນາລະບຸເສັ້ນທາງໄຟລ໌ເຕັມ.

source: The name "%s" contains a Pascal keyword.
lo: ຊື່ "%s" ປະກອບມີຄຳສະຫງວນຂອງ Pascal.

source: The new include file is not yet in the include search path.%sAdd directory %s?
lo: ໄຟລ໌ include ໃໝ່ຍັງບໍ່ຢູ່ໃນເສັ້ນທາງຄົ້ນຫາ include.%sເພີ່ມໄດເຣັກທໍຣີ %s ບໍ່?

source: The new unit is not yet in the unit search path.%sAdd directory %s?
lo: Unit ໃໝ່ຍັງບໍ່ຢູ່ໃນເສັ້ນທາງຄົ້ນຫາ unit.%sເພີ່ມໄດເຣັກທໍຣີ %s ບໍ່?

source: The old configuration will be upgraded.
lo: ການຕັ້ງຄ່າເກົ່າຈະຖືກອັບເກຣດ.

source: The "Other sources" contains a directory which is already in the "Other unit files".%s%s
lo: "Other sources" ປະກອບມີໄດເຣັກທໍຣີທີ່ມີຢູ່ແລ້ວໃນ "Other unit files".%s%s

source: The output directory "%s" is missing.
lo: ໄດເຣັກທໍຣີ output "%s" ຫາຍໄປ.

source: The output directory of %s is listed in the include search path of %s.
lo: ໄດເຣັກທໍຣີ output ຂອງ %s ຖືກລະບຸຢູ່ໃນເສັ້ນທາງຄົ້ນຫາ include ຂອງ %s.

source: The output directory of %s is listed in the inherited include search path of %s.
lo: ໄດເຣັກທໍຣີ output ຂອງ %s ຖືກລະບຸຢູ່ໃນເສັ້ນທາງຄົ້ນຫາ include ທີ່ສືບທອດມາຂອງ %s.

source: The output directory of %s is listed in the inherited unit search path of %s.
lo: ໄດເຣັກທໍຣີ output ຂອງ %s ຖືກລະບຸຢູ່ໃນເສັ້ນທາງຄົ້ນຫາ unit ທີ່ສືບທອດມາຂອງ %s.

source: The output directory of %s is listed in the unit search path of %s.
lo: ໄດເຣັກທໍຣີ output ຂອງ %s ຖືກລະບຸຢູ່ໃນເສັ້ນທາງຄົ້ນຫາ unit ຂອງ %s.

source: The output directory should be a separate directory and not contain any source files.
lo: ໄດເຣັກທໍຣີ output ຄວນເປັນໄດເຣັກທໍຣີແຍກຕ່າງຫາກ ແລະ ບໍ່ຄວນປະກອບມີໄຟລ໌ source ໃດໆ.

source: The owner class has this name
lo: ຄລາສເຈົ້າຂອງມີຊື່ນີ້

source: The owner has this name
lo: ເຈົ້າຂອງມີຊື່ນີ້

source: The package %s adds the path "%s" to the include path of the IDE.%sThis is probably a misconfiguration of the package.
lo: ແພັກເກັດ %s ເພີ່ມເສັ້ນທາງ "%s" ໃສ່ເສັ້ນທາງ include ຂອງ IDE.%sອັນນີ້ອາດຈະເປັນການຕັ້ງຄ່າທີ່ຜິດພາດຂອງແພັກເກັດ.

source: The package %s adds the path "%s" to the unit path of the IDE.%sThis is probably a misconfiguration of the package.
lo: ແພັກເກັດ %s ເພີ່ມເສັ້ນທາງ "%s" ໃສ່ເສັ້ນທາງ unit ຂອງ IDE.%sອັນນີ້ອາດຈະເປັນການຕັ້ງຄ່າທີ່ຜິດພາດຂອງແພັກເກັດ.

source: The package already contains a unit with this name.
lo: ແພັກເກັດມີ unit ທີ່ມີຊື່ນີ້ແລ້ວ.

source: The package %s cannot be installed because it requires the package "%s" which is a runtime only package.
lo: ແພັກເກັດ %s ບໍ່ສາມາດຕິດຕັ້ງໄດ້ ເນື່ອງຈາກມັນຕ້ອງການແພັກເກັດ "%s" ເຊິ່ງເປັນແພັກເກັດ runtime ເທົ່ານັ້ນ.

source: The package %s can not be uninstalled because it is needed by the IDE itself.
lo: ແພັກເກັດ %s ບໍ່ສາມາດຖອນການຕິດຕັ້ງໄດ້ ເນື່ອງຈາກ IDE ຕ້ອງການມັນ.

source: The package %s does not have any "Register" procedure which typically means it does not provide any IDE addon. Installing it will probably only increase the size of the IDE and may even make it unstable.%sHint: If you want to use a package in your project, use the "Add to project" menu item.
lo: ແພັກເກັດ %s ບໍ່ມີ procedure "Register" ໃດໆ ເຊິ່ງໂດຍທົ່ວໄປໝາຍຄວາມວ່າມັນບໍ່ໄດ້ໃຫ້ IDE addon ໃດໆ. ການຕິດຕັ້ງມັນອາດຈະພຽງແຕ່ເພີ່ມຂະໜາດຂອງ IDE ແລະ ອາດເຮັດໃຫ້ມັນບໍ່ສະຖຽນ.%sຄຳໃບ້: ຖ້າທ່ານຕ້ອງການໃຊ້ແພັກເກັດໃນໂປຣເຈັກຂອງທ່ານ, ໃຫ້ໃຊ້ເມນູ "Add to project".

source: The package %s is already in the list
lo: ແພັກເກັດ %s ຢູ່ໃນລາຍການແລ້ວ

source: The package %s is not a design time package. It cannot be installed in the IDE.
lo: ແພັກເກັດ %s ບໍ່ແມ່ນແພັກເກັດ design time. ມັນບໍ່ສາມາດຕິດຕັ້ງໃນ IDE ໄດ້.

source: The package "%s" is used by
lo: ແພັກເກັດ "%s" ຖືກນຳໃຊ້ໂດຍ

source: The path of "make" is not correct: "%s"
lo: ເສັ້ນທາງຂອງ "make" ບໍ່ຖືກຕ້ອງ: "%s"

source: The program "make" was not found.%sThis tool is needed to build Lazarus.
lo: ບໍ່ພົບໂປຣແກຣມ "make".%sເຄື່ອງມືນີ້ຈຳເປັນສຳລັບການ build Lazarus.

source: The project compiler options and the directives in the main source differ. For the new unit the mode and string type of the project options are used:
lo: ຕົວເລືອກຄອມໄພເລີຂອງໂປຣເຈັກ ແລະ directives ໃນ source ຫຼັກແຕກຕ່າງກັນ. ສຳລັບ unit ໃໝ່ ໂໝດ ແລະ ປະເພດ string ຂອງຕົວເລືອກໂປຣເຈັກຈະຖືກໃຊ້:

source: Running your application with debugger
lo: ການແລ່ນແອັບພລິເຄຊັນຂອງທ່ານດ້ວຍ debugger

source: This choice can be later changed in Project -> Project Options -> Compiler Options -> Debugging.
lo: ຕົວເລືອກນີ້ສາມາດປ່ຽນແປງໄດ້ພາຍຫຼັງໃນ Project -> Project Options -> Compiler Options -> Debugging.

source: Run with no debugger
lo: ແລ່ນໂດຍບໍ່ມີ debugger

source: "%s" can only run your application when it was compiled with a suitable Debug Information enabled.
lo: "%s" ສາມາດແລ່ນແອັບພລິເຄຊັນຂອງທ່ານໄດ້ກໍ່ຕໍ່ເມື່ອມັນຖືກ compile ດ້ວຍ Debug Information ທີ່ເໝາະສົມເທົ່ານັ້ນ.

source: Choose Debug Information format
lo: ເລືອກຮູບແບບ Debug Information

source: The project does not use the LCL unit interfaces, which is required by LCLBase.%sYou will get strange linker errors if you use the LCL without interfaces.
lo: ໂປຣເຈັກບໍ່ໄດ້ໃຊ້ LCL unit interfaces, ເຊິ່ງຈຳເປັນສຳລັບ LCLBase.%sທ່ານຈະພົບກັບຂໍ້ຜິດພາດ linker ທີ່ແປກປະຫຼາດຖ້າທ່ານໃຊ້ LCL ໂດຍບໍ່ມີ interfaces.

source: The project has no compile command.%sSee Project -> Project Options -> Compiler Options -> Compiler Commands
lo: ໂປຣເຈັກບໍ່ມີຄຳສັ່ງ compile.%sເບິ່ງ Project -> Project Options -> Compiler Options -> Compiler Commands

source: The project has no main source file.
lo: ໂປຣເຈັກບໍ່ມີໄຟລ໌ source ຫຼັກ.

source: The project info file "%s"%sis equal to the project main source file!
lo: ໄຟລ໌ຂໍ້ມູນໂປຣເຈັກ "%s"%sຄືກັນກັບໄຟລ໌ source ຫຼັກຂອງໂປຣເຈັກ!

source: The project information file "%s"%shas changed on disk.
lo: ໄຟລ໌ຂໍ້ມູນໂປຣເຈັກ "%s"%sມີການປ່ຽນແປງໃນດິດສ໌.

source: The project must be saved before building%sIf you set the Test Directory in the IDE options,%syou can create new projects and build them at once.%sSave project?
lo: ໂປຣເຈັກຕ້ອງຖືກບັນທຶກກ່ອນການ build%sຖ້າທ່ານຕັ້ງຄ່າ Test Directory ໃນຕົວເລືອກ IDE,%sທ່ານສາມາດສ້າງໂປຣເຈັກໃໝ່ ແລະ build ພວກມັນໄດ້ທັນທີ.%sບັນທຶກໂປຣເຈັກບໍ່?

source: The project uses FPC resources which require at least FPC 2.4
lo: ໂປຣເຈັກໃຊ້ FPC resources ເຊິ່ງຕ້ອງການຢ່າງໜ້ອຍ FPC 2.4

source: The project uses target OS=%s and CPU=%s.%sThe system.ppu for this target was not found in the FPC binary directories.%sMake sure fpc is installed correctly for this target and the fpc.cfg contains the right directories.
lo: ໂປຣເຈັກໃຊ້ເປົ້າໝາຍ OS=%s ແລະ CPU=%s.%sບໍ່ພົບ system.ppu ສຳລັບເປົ້າໝາຍນີ້ໃນໄດເຣັກທໍຣີ binary ຂອງ FPC.%sກະລຸນາກວດສອບວ່າ fpc ຖືກຕິດຕັ້ງຢ່າງຖືກຕ້ອງສຳລັບເປົ້າໝາຍນີ້ ແລະ fpc.cfg ປະກອບມີໄດເຣັກທໍຣີທີ່ຖືກຕ້ອງ.

source: The project writes the debug symbols to an external file. The "%s" supports only symbols within the executable.
lo: ໂປຣເຈັກຂຽນ debug symbols ໃສ່ໄຟລ໌ພາຍນອກ. "%s" ຮອງຮັບສະເພາະ symbols ພາຍໃນ executable ເທົ່ານັ້ນ.

source: The project writes the debug symbols into the executable rather than to an external file. The "%s" supports only symbols in an external file.
lo: ໂປຣເຈັກຂຽນ debug symbols ເຂົ້າໄປໃນ executable ແທນທີ່ຈະເປັນໄຟລ໌ພາຍນອກ. "%s" ຮອງຮັບສະເພາະ symbols ໃນໄຟລ໌ພາຍນອກເທົ່ານັ້ນ.

source: %sThere are additional notes for this message on%s
lo: %sມີບັນທຶກເພີ່ມເຕີມສຳລັບຂໍ້ຄວາມນີ້ໃນ%s

source: There are other files in the directory with the same name,%swhich only differ in case:%s%s%sDelete them?
lo: ມີໄຟລ໌ອື່ນໃນໄດເຣັກທໍຣີທີ່ມີຊື່ດຽວກັນ,%sເຊິ່ງແຕກຕ່າງກັນພຽງແຕ່ຕົວພິມ:%s%s%sລຶບພວກມັນບໍ່?

source: There is a file with the same name and a similar extension on disk%sFile: %s%sAmbiguous File: %s%sDelete ambiguous file?
lo: ມີໄຟລ໌ທີ່ມີຊື່ດຽວກັນ ແລະ ນາມສະກຸນຄ້າຍຄືກັນໃນດິດສ໌%sໄຟລ໌: %s%sໄຟລ໌ທີ່ກຳກວມ: %s%sລຶບໄຟລ໌ທີ່ກຳກວມບໍ່?

source: There is already a build mode with this name.
lo: ມີ build mode ຊື່ນີ້ຢູ່ແລ້ວ.

source: There is already a component class with the name %s.
lo: ມີ component class ຊື່ %s ຢູ່ແລ້ວ.

source: There is already a component with this name
lo: ມີ component ຊື່ນີ້ຢູ່ແລ້ວ

source: There is already a file%s%s%sin %s
lo: ມີໄຟລ໌%s%s%sຢູ່ໃນ %s ແລ້ວ

source: There is already a file "%s" in %s%sOld: %s%sNew: %s%s%sContinue?
lo: ມີໄຟລ໌ "%s" ໃນ %s ແລ້ວ%sເກົ່າ: %s%sໃໝ່: %s%s%sດຳເນີນການຕໍ່ບໍ່?

source: There is already a form with the name "%s"
lo: ມີຟອມທີ່ມີຊື່ "%s" ຢູ່ແລ້ວ

source: There is already a macro with the name "%s".
lo: ມີມາໂຄຣທີ່ມີຊື່ "%s" ຢູ່ແລ້ວ.

source: There is already an IDE macro with the name "%s"
lo: ມີ IDE macro ທີ່ມີຊື່ "%s" ຢູ່ແລ້ວ

source: There is already a package %s in the list
lo: ມີແພັກເກັດ %s ໃນລາຍການແລ້ວ

source: There is already a unit "%s" in %s%sOld: %s%sNew: %s%sYou have to make sure that the unit search path contains only one of them.%s%sContinue?
lo: ມີ unit "%s" ໃນ %s ແລ້ວ%sເກົ່າ: %s%sໃໝ່: %s%sທ່ານຕ້ອງແນ່ໃຈວ່າເສັ້ນທາງຄົ້ນຫາ unit ມີພຽງແຕ່ອັນດຽວໃນນັ້ນ.%s%sດຳເນີນການຕໍ່ບໍ່?

source: There is already a unit with the name "%s". Pascal identifiers must be unique.
lo: ມີ unit ທີ່ມີຊື່ "%s" ຢູ່ແລ້ວ. Pascal identifiers ຕ້ອງບໍ່ຊ້ຳກັນ.

source: There is a unit with the name "%s" in the project.%sPlease choose a different name
lo: ມີ unit ທີ່ມີຊື່ "%s" ໃນໂປຣເຈັກ.%sກະລຸນາເລືອກຊື່ອື່ນ.

source: There is no fpc.exe in the directory of %s. Usually the make executable is installed together with the FPC compiler.
lo: ບໍ່ມີ fpc.exe ໃນໄດເຣັກທໍຣີຂອງ %s. ໂດຍທົ່ວໄປ make executable ຈະຖືກຕິດຕັ້ງພ້ອມກັບ FPC compiler.

source: There is no Free Pascal Compiler (e. g. fpc%0:s or ppc<cpu>%0:s) configured in the project options. CodeTools will not work properly.%1:s%1:sError message:%1:s%2:s
lo: ບໍ່ມີ Free Pascal Compiler (ເຊັ່ນ fpc%0:s ຫຼື ppc<cpu>%0:s) ຖືກກຳນົດຄ່າໃນຕົວເລືອກໂປຣເຈັກ. CodeTools ຈະບໍ່ເຮັດວຽກຢ່າງຖືກຕ້ອງ.%1:s%1:sຂໍ້ຄວາມຜິດພາດ:%1:s%2:s

source: There must be at least one build mode.
lo: ຕ້ອງມີຢ່າງໜ້ອຍໜຶ່ງ build mode.

source: The resource class "%s" descends from "%s". Probably this is a typo for TForm.
lo: Resource class "%s" ສືບທອດມາຈາກ "%s". ອັນນີ້ອາດຈະເປັນການພິມຜິດສຳລັບ TForm.

source: There was an error during writing the selected component %s:%s:%s%s
lo: ເກີດຂໍ້ຜິດພາດໃນລະຫວ່າງການຂຽນ component ທີ່ເລືອກ %s:%s:%s%s

source: There was an error while converting the binary stream of the selected component %s:%s:%s%s
lo: ເກີດຂໍ້ຜິດພາດໃນລະຫວ່າງການແປງ binary stream ຂອງ component ທີ່ເລືອກ %s:%s:%s%s

source: There was an error while copying the component stream to clipboard:%s%s
lo: ເກີດຂໍ້ຜິດພາດໃນລະຫວ່າງການຄັດລອກ component stream ໄປຍັງ clipboard:%s%s

source: The root component cannot be deleted.
lo: Root component ບໍ່ສາມາດລຶບໄດ້.

source: These files will be deleted
lo: ໄຟລ໌ເຫຼົ່ານີ້ຈະຖືກລຶບ

source: These settings are stored with the project.
lo: ການຕັ້ງຄ່າເຫຼົ່ານີ້ຖືກບັນທຶກໄວ້ກັບໂປຣເຈັກ.

source: These units were not found:
lo: ບໍ່ພົບ units ເຫຼົ່ານີ້:

source: The sources of the Free Pascal packages are required for browsing and code completion. For example it has the file "%s".
lo: Sources ຂອງ Free Pascal packages ແມ່ນຈຳເປັນສຳລັບການ browsing ແລະ code completion. ຕົວຢ່າງ ມັນມີໄຟລ໌ "%s".

source: The target directory is a file:%s
lo: ໄດເຣັກທໍຣີເປົ້າໝາຍແມ່ນໄຟລ໌:%s

source: The target file name is a directory.
lo: ຊື່ໄຟລ໌ເປົ້າໝາຍແມ່ນໄດເຣັກທໍຣີ.

source: The target %s is not writable.
lo: ເປົ້າໝາຍ %s ບໍ່ສາມາດຂຽນໄດ້.

source: The Test Directory could not be found:%s"%s"%s(see IDE options)
lo: ບໍ່ພົບ Test Directory:%s"%s"%s(ເບິ່ງ IDE options)

source: The unit "%s" already exists.
lo: Unit "%s" ມີຢູ່ແລ້ວ.

source: The unit belongs to package %s.
lo: Unit ເປັນຂອງແພັກເກັດ %s.

source: The unit %s exists twice in the unit path of the %s:
lo: Unit %s ມີຢູ່ສອງຄັ້ງໃນເສັ້ນທາງ unit ຂອງ %s:

source: The unit has this name
lo: Unit ມີຊື່ນີ້

source: The unit filename "%s" is not lowercase.%sThe Free Pascal compiler does not search for all cases. It is recommended to use lowercase filename.%sRename file lowercase?
lo: ຊື່ໄຟລ໌ unit "%s" ບໍ່ແມ່ນຕົວພິມນ້ອຍ.%sFree Pascal compiler ບໍ່ຄົ້ນຫາທຸກກໍລະນີຕົວພິມ. ແນະນຳໃຫ້ໃຊ້ຊື່ໄຟລ໌ຕົວພິມນ້ອຍ.%sປ່ຽນຊື່ໄຟລ໌ເປັນຕົວພິມນ້ອຍບໍ່?

source: The unit %s is part of the FPC sources but the corresponding fpdoc xml file was not found.%sEither you have not yet added the fpcdocs directory to the search path or the unit is not yet documented.%sThe fpdoc files for the FPC sources can be downloaded from: %s%sPlease add the directory in the fpdoc editor options.%sIn order to create a new file the directory must be writable.
lo: Unit %s ແມ່ນສ່ວນໜຶ່ງຂອງ FPC sources ແຕ່ບໍ່ພົບໄຟລ໌ fpdoc xml ທີ່ກ່ຽວຂ້ອງ.%sທ່ານອາດຈະຍັງບໍ່ໄດ້ເພີ່ມໄດເຣັກທໍຣີ fpcdocs ໃສ່ເສັ້ນທາງຄົ້ນຫາ ຫຼື unit ຍັງບໍ່ໄດ້ຖືກບັນທຶກເອກະສານ.%sໄຟລ໌ fpdoc ສຳລັບ FPC sources ສາມາດດາວໂຫຼດໄດ້ຈາກ: %s%sກະລຸນາເພີ່ມໄດເຣັກທໍຣີໃນຕົວເລືອກ fpdoc editor.%sເພື່ອສ້າງໄຟລ໌ໃໝ່ ໄດເຣັກທໍຣີຕ້ອງສາມາດຂຽນໄດ້.

source: The unit %s is used by other files.%sUpdate references automatically?
lo: Unit %s ຖືກໃຊ້ໂດຍໄຟລ໌ອື່ນ.%sອັບເດດການອ້າງອີງໂດຍອັດຕະໂນມັດບໍ່?

source: The unit itself has already the name "%s". Pascal identifiers must be unique.
lo: ຕົວ unit ເອງມີຊື່ "%s" ຢູ່ແລ້ວ. Pascal identifiers ຕ້ອງບໍ່ຊ້ຳກັນ.

source: The unit search path of "%s" contains the source directory "%s" of package %s
lo: ເສັ້ນທາງຄົ້ນຫາ unit ຂອງ "%s" ປະກອບມີໄດເຣັກທໍຣີ source "%s" ຂອງແພັກເກັດ %s

source: The working directory "%s" does not exist.%sPlease check the working directory in Menu > Run > Run parameters.
lo: ໄດເຣັກທໍຣີເຮັດວຽກ "%s" ບໍ່ມີຢູ່.%sກະລຸນາກວດສອບໄດເຣັກທໍຣີເຮັດວຽກໃນ Menu > Run > Run parameters.

source: This component already contains a class with the name %s.
lo: Component ນີ້ມີ class ທີ່ມີຊື່ %s ຢູ່ແລ້ວ.

source: This function needs an open .lfm file in the source editor.
lo: ຟັງຊັນນີ້ຕ້ອງການໄຟລ໌ .lfm ທີ່ເປີດຢູ່ໃນຕົວແກ້ໄຂ source.

source: This help message.
lo: ຂໍ້ຄວາມຊ່ວຍເຫຼືອນີ້.

source: This is a test project for a design time package, testing it outside the IDE.
lo: ນີ້ແມ່ນໂປຣເຈັກທົດສອບສຳລັບ design time package, ທົດສອບມັນຢູ່ນອກ IDE.

source: This looks like a Pascal file.%sIt is recommended to use lower case filenames to avoid various problems on some filesystems and different compilers.%sRename it to lowercase?
lo: ນີ້ເບິ່ງຄືວ່າເປັນໄຟລ໌ Pascal.%sແນະນຳໃຫ້ໃຊ້ຊື່ໄຟລ໌ຕົວພິມນ້ອຍ ເພື່ອຫຼີກເວັ້ນບັນຫາຕ່າງໆໃນບາງລະບົບໄຟລ໌ ແລະ compiler ທີ່ແຕກຕ່າງກັນ.%sປ່ຽນຊື່ເປັນຕົວພິມນ້ອຍບໍ່?

source: This project has no main source file
lo: ໂປຣເຈັກນີ້ບໍ່ມີໄຟລ໌ source ຫຼັກ

source: This project has only the default build mode.
lo: ໂປຣເຈັກນີ້ມີພຽງແຕ່ build mode ເລີ່ມຕົ້ນເທົ່ານັ້ນ.

source: This set of options to build Lazarus is not supported by this installation.%sThe directory "%s" is not writable.%sSee the Lazarus website for other ways to install Lazarus.
lo: ຊຸດຕົວເລືອກນີ້ໃນການ build Lazarus ແມ່ນບໍ່ຮອງຮັບໂດຍການຕິດຕັ້ງນີ້.%sໄດເຣັກທໍຣີ "%s" ບໍ່ສາມາດຂຽນໄດ້.%sເບິ່ງເວັບໄຊ Lazarus ສຳລັບວິທີອື່ນໃນການຕິດຕັ້ງ Lazarus.

source: This statement can not be extracted.%sPlease select some code to extract a new procedure/method.
lo: ຄຳສັ່ງນີ້ບໍ່ສາມາດແຍກອອກໄດ້.%sກະລຸນາເລືອກໂຄ້ດບາງສ່ວນເພື່ອແຍກ procedure/method ໃໝ່.

source: This will allow changing all build modes at once. Not implemented yet.
lo: ອັນນີ້ຈະອະນຸຍາດໃຫ້ປ່ຽນແປງ build modes ທັງໝົດພ້ອມກັນ. ຍັງບໍ່ໄດ້ເປີດໃຫ້ໃຊ້ງານເທື່ອ.

source: This will create a circular dependency.
lo: ອັນນີ້ຈະສ້າງ circular dependency.

source: This will put a lot of text (%s) on the clipboard.%sProceed?
lo: ອັນນີ້ຈະວາງຂໍ້ຄວາມຈຳນວນຫຼາຍ (%s) ລົງໃນ clipboard.%sດຳເນີນການຕໍ່ບໍ່?

source: &Title
lo: &ຫົວຂໍ້

source: Show the custom IDE title before the IDE's name and other info in the title. Example: project1 - Lazarus.
lo: ສະແດງຫົວຂໍ້ IDE ແບບກຳນົດເອງກ່ອນຊື່ຂອງ IDE ແລະ ຂໍ້ມູນອື່ນໆໃນຫົວຂໍ້. ຕົວຢ່າງ: project1 - Lazarus.

source: Title (leave empty for default)
lo: ຫົວຂໍ້ (ປະວ່າງໄວ້ເພື່ອໃຊ້ຄ່າເລີ່ມຕົ້ນ)

source: Path:
lo: ເສັ້ນທາງ:

source: Toolbar Configuration
lo: ການຕັ້ງຄ່າແຖບເຄື່ອງມື

source: tool "%s" has no executable
lo: ເຄື່ອງມື "%s" ບໍ່ມີ executable

source: Tool Header: Failed
lo: Tool Header: ລົ້ມເຫຼວ

source: Tool Header: Running
lo: Tool Header: ກຳລັງເຮັດວຽກ

source: Tool Header: Scrolled up
lo: Tool Header: ເລື່ອນຂຶ້ນ

source: Tool Header: Success
lo: Tool Header: ສຳເລັດ

source: tool stopped with exit code %s. Use context menu to get more information.
lo: ເຄື່ອງມືຢຸດເຮັດວຽກດ້ວຍ exit code %s. ໃຊ້ເມນູ context ເພື່ອເບິ່ງຂໍ້ມູນເພີ່ມເຕີມ.

source: tool stopped with ExitCode 0 and ExitStatus %s. Use context menu to get more information.
lo: ເຄື່ອງມືຢຸດເຮັດວຽກດ້ວຍ ExitCode 0 ແລະ ExitStatus %s. ໃຊ້ເມນູ context ເພື່ອເບິ່ງຂໍ້ມູນເພີ່ມເຕີມ.

# lazarusidestrconsts.listop
source: Top
lo: ດ້ານເທິງ

source: Top anchoring
lo: ການຍຶດດ້ານເທິງ

source: Top borderspace. This value is added to base borderspace and used for the space above the control.
lo: ພື້ນທີ່ຂອບດ້ານເທິງ. ຄ່ານີ້ຖືກເພີ່ມໃສ່ພື້ນທີ່ຂອບພື້ນຖານ ແລະ ໃຊ້ສຳລັບພື້ນທີ່ເໜືອ control.

source: Show Class/Procedure hint
lo: ສະແດງຄຳໃບ້ Class/Procedure

source: Tops
lo: ດ້ານເທິງ

source: This is the sibling control to which the top side is anchored. Leave empty for anchoring to parent in Delphi style (BorderSpacing and ReferenceSide do not matter).
lo: ນີ້ແມ່ນ control ອ້າຍເອື້ອຍນ້ອງທີ່ດ້ານເທິງຖືກຍຶດໄວ້. ປະວ່າງໄວ້ສຳລັບການຍຶດກັບ parent ໃນແບບ Delphi (BorderSpacing ແລະ ReferenceSide ບໍ່ສຳຄັນ).

source: Top space equally
lo: ໄລຍະຫ່າງດ້ານເທິງເທົ່າກັນ

source: Total Pages: %s
lo: ໜ້າທັງໝົດ: %s

source: Translate the English Messages
lo: ແປຂໍ້ຄວາມພາສາອັງກິດ

source: Tree needs refresh
lo: Tree ຕ້ອງການການຣີເຟຣຊ

source: Two moved files will have the same file name:%s%s%s%s%sin %s
lo: ສອງໄຟລ໌ທີ່ຖືກຍ້າຍຈະມີຊື່ໄຟລ໌ດຽວກັນ:%s%s%s%s%sໃນ %s

source: Types (not removed if no replacement)
lo: Types (ບໍ່ຖືກລຶບ ຖ້າບໍ່ມີການປ່ຽນແທນ)

source: Additional directories:
lo: ໄດເຣັກທໍຣີເພີ່ມເຕີມ:

source: All package units
lo: Units ຂອງແພັກເກັດທັງໝົດ

source: All source editor units
lo: Units ຂອງຕົວແກ້ໄຂ source ທັງໝົດ

source: All units
lo: Units ທັງໝົດ

source: By default only the project units and the source editor units are searched. Add here a list of directories separated by semicolon to search as well.
lo: ໂດຍຄ່າເລີ່ມຕົ້ນ ຈະຄົ້ນຫາສະເພາະ units ຂອງໂປຣເຈັກ ແລະ units ຂອງຕົວແກ້ໄຂ source. ເພີ່ມລາຍຊື່ຂອງໄດເຣັກທໍຣີທີ່ຂັ້ນດ້ວຍ semicolon ຢູ່ບ່ອນນີ້ເພື່ອຄົ້ນຫາເຊັ່ນກັນ.

source: Collapse all nodes
lo: ຫຍໍ້ nodes ທັງໝົດ

source: Expand all nodes
lo: ຂະຫຍາຍ nodes ທັງໝົດ

source: File: %s
lo: ໄຟລ໌: %s

source: (Filter)
lo: (ຕົວຕອງ)

source: Projects and packages
lo: ໂປຣເຈັກ ແລະ ແພັກເກັດ

source: Scanning ...
lo: ກຳລັງສະແກນ ...

source: Scanning: %s units ...
lo: ກຳລັງສະແກນ: %s units ...

source: (Search)
lo: (ຄົ້ນຫາ)

source: Find next occurrence of this phrase
lo: ຊອກຫາຄຳນີ້ໃນຕຳແໜ່ງຖັດໄປ

source: Find next unit with this phrase
lo: ຊອກຫາ unit ຖັດໄປທີ່ມີຄຳນີ້

source: Find previous occurrence of this phrase
lo: ຊອກຫາຄຳນີ້ໃນຕຳແໜ່ງກ່ອນໜ້າ

source: Find previous unit with this phrase
lo: ຊອກຫາ unit ກ່ອນໜ້າທີ່ມີຄຳນີ້

source: Selected units
lo: Units ທີ່ເລືອກ

source: Show nodes for directories
lo: ສະແດງ nodes ສຳລັບໄດເຣັກທໍຣີ

source: Show nodes for project and packages
lo: ສະແດງ nodes ສຳລັບໂປຣເຈັກ ແລະ ແພັກເກັດ

source: Used by Implementations: %s
lo: ຖືກໃຊ້ໂດຍ Implementations: %s

source: used by implementations: %s
lo: ຖືກໃຊ້ໂດຍ implementations: %s

source: Used by Interfaces: %s
lo: ຖືກໃຊ້ໂດຍ Interfaces: %s

source: used by interfaces: %s
lo: ຖືກໃຊ້ໂດຍ interfaces: %s

source: Do not show this message again.
lo: ຢ່າສະແດງຂໍ້ຄວາມນີ້ອີກ.

source: Error in regular expression
lo: ຂໍ້ຜິດພາດໃນ regular expression

source: Font without UTF-8
lo: ຟອນທີ່ບໍ່ມີ UTF-8

source: Goto line:
lo: ໄປທີ່ແຖວ:

source: Not found
lo: ບໍ່ພົບ

source: Replace this occurrence of "%s"%s with "%s"?
lo: ປ່ຽນແທນ "%s"%s ທີ່ພົບນີ້ດ້ວຍ "%s" ບໍ່?

source: Searching: %s
lo: ກຳລັງຄົ້ນຫາ: %s

source: Continue search from the beginning?
lo: ຄົ້ນຫາຕໍ່ຈາກຈຸດເລີ່ມຕົ້ນບໍ່?

source: Continue search from the end?
lo: ຄົ້ນຫາຕໍ່ຈາກຈຸດສຸດທ້າຍບໍ່?

source: Search string '%s' not found!
lo: ບໍ່ພົບຂໍ້ຄວາມຄົ້ນຫາ '%s'!

source: The current editor font does not support UTF-8 but your system seems to use it.%sThat means non ASCII characters will probably be shown incorrectly.%sYou can select another font in the editor options.
lo: ຟອນຕົວແກ້ໄຂປະຈຸບັນບໍ່ຮອງຮັບ UTF-8 ແຕ່ລະບົບຂອງທ່ານເບິ່ງຄືວ່າໃຊ້ມັນ.%sນັ້ນໝາຍຄວາມວ່າຕົວອັກສອນທີ່ບໍ່ແມ່ນ ASCII ອາດຈະສະແດງຜົນຜິດພາດ.%sທ່ານສາມາດເລືອກຟອນອື່ນໄດ້ໃນຕົວເລືອກ editor.

source: Clear include cache
lo: ລ້າງແຄດ include

source: %s bytes
lo: %s ໄບຕ໌

source: Included by:
lo: Included ໂດຍ:

source: In project:
lo: ໃນໂປຣເຈັກ:

# lazarusidestrconsts.lisuidlines
source: Lines:
lo: ແຖວ:

# lazarusidestrconsts.lisuidname
source: Name:
lo: ຊື່:

source: no
lo: ບໍ່

source: Size:
lo: ຂະໜາດ:

source: Type:
lo: ປະເພດ:

source: yes
lo: ແມ່ນ

source: Show CodeTools Values
lo: ສະແດງຄ່າ CodeTools

source: Unable convert binary stream to text
lo: ບໍ່ສາມາດແປງ binary stream ເປັນຂໍ້ຄວາມ

source: Unable copy components to clipboard
lo: ບໍ່ສາມາດຄັດລອກ components ໄປຍັງ clipboard

source: Unable to add resource header comment to resource file %s"%s".%sProbably a syntax error.
lo: ບໍ່ສາມາດເພີ່ມຄຳເຫັນສ່ວນຫົວ resource ໃສ່ໄຟລ໌ resource %s"%s".%sອາດຈະເກີດຂໍ້ຜິດພາດທາງໄວຍາກອນ.

source: Unable to add resource T%s:FORMDATA to resource file %s"%s".%sProbably a syntax error.
lo: ບໍ່ສາມາດເພີ່ມ resource T%s:FORMDATA ໃສ່ໄຟລ໌ resource %s"%s".%sອາດຈະເກີດຂໍ້ຜິດພາດທາງໄວຍາກອນ.

source: Unable to add the dependency %s because the package %s has already a dependency %s
lo: ບໍ່ສາມາດເພີ່ມ dependency %s ໄດ້ ເນື່ອງຈາກແພັກເກັດ %s ມີ dependency %s ຢູ່ແລ້ວ.

source: Unable to add the dependency %s because this would create a circular dependency. Dependency %s
lo: ບໍ່ສາມາດເພີ່ມ dependency %s ໄດ້ ເນື່ອງຈາກອັນນີ້ຈະສ້າງ circular dependency. Dependency %s

source: Unable to add %s to project because there is already a unit with the same name in the Project.
lo: ບໍ່ສາມາດເພີ່ມ %s ໃສ່ໂປຣເຈັກໄດ້ ເນື່ອງຈາກມີ unit ທີ່ມີຊື່ດຽວກັນໃນໂປຣເຈັກແລ້ວ.

source: Unable to backup file "%s" to "%s"!
lo: ບໍ່ສາມາດສຳຮອງໄຟລ໌ "%s" ໄປຍັງ "%s" ໄດ້!

source: %s%sUnable to change class of %s to %s
lo: %s%sບໍ່ສາມາດປ່ຽນຄລາສຂອງ %s ເປັນ %s

source: Unable to change project scaled in source.%s%s
lo: ບໍ່ສາມາດປ່ຽນ project scaled ໃນ source ໄດ້.%s%s

source: Unable to change project title in source.%s%s
lo: ບໍ່ສາມາດປ່ຽນຫົວຂໍ້ໂປຣເຈັກໃນ source ໄດ້.%s%s

source: Unable to clean up destination directory
lo: ບໍ່ສາມາດອະນາໄມໄດເຣັກທໍຣີປາຍທາງໄດ້

source: Unable to clean up "%s".%sPlease check permissions.
lo: ບໍ່ສາມາດອະນາໄມ "%s" ໄດ້.%sກະລຸນາກວດສອບສິດ (permissions).

source: Unable to convert component text into binary format:%s%s
lo: ບໍ່ສາມາດແປງຂໍ້ຄວາມ component ເປັນຮູບແບບ binary:%s%s

source: Unable to convert file "%s"%sError: %s
lo: ບໍ່ສາມາດແປງໄຟລ໌ "%s"%sຂໍ້ຜິດພາດ: %s

source: Unable to convert text form data of file %s"%s"%sinto binary stream. (%s)
lo: ບໍ່ສາມາດແປງຂໍ້ມູນ text form ຂອງໄຟລ໌ %s"%s"%sເປັນ binary stream. (%s)

source: Unable to convert to encoding "%s"
lo: ບໍ່ສາມາດແປງເປັນການເຂົ້າລະຫັດ "%s"

source: Unable to create new file because there is already a directory with this name.
lo: ບໍ່ສາມາດສ້າງໄຟລ໌ໃໝ່ໄດ້ ເນື່ອງຈາກມີໄດເຣັກທໍຣີທີ່ມີຊື່ນີ້ຢູ່ແລ້ວ.

source: Unable to create temporary lfm buffer.
lo: ບໍ່ສາມາດສ້າງ lfm buffer ຊົ່ວຄາວໄດ້.

source: Unable to delete ambiguous file "%s"
lo: ບໍ່ສາມາດລຶບໄຟລ໌ທີ່ກຳກວມ "%s"

source: unable to execute: %s
lo: ບໍ່ສາມາດ execute: %s

source: Unable to find a ResourceString section in this or any of the used units.
lo: ບໍ່ພົບພາກສ່ວນ ResourceString ໃນ unit ນີ້ ຫຼື unit ອື່ນໆທີ່ໃຊ້.

source: Unable to find a valid classname in "%s"
lo: ບໍ່ພົບຊື່ class ທີ່ຖືກຕ້ອງໃນ "%s"

source: Unable to find file "%s".
lo: ບໍ່ພົບໄຟລ໌ "%s".
