Repository: fpc/Lazarus
Catalog: languages/lazaruside.*.po
Languages: lo

source: NOTE: loading old codetools options file:
lo: ໝາຍເຫດ: ກຳລັງໂຫຼດຟາຍລ໌ຕົວເລືອກ codetools ເກົ່າ:

# lazarusidestrconsts.liscompilestage
source: Compile
lo: ຄອມໄພລ໌

source: Compile with project settings
lo: ຄອມໄພລ໌ດ້ວຍການຕັ້ງຄ່າໂຄງການ

source: Compile with -vd for more details. Check for duplicates.
lo: ຄອມໄພລ໌ດ້ວຍ -vd ສຳລັບລາຍລະອຽດເພີ່ມເຕີມ. ກວດສອບຄວາມຊ້ຳຊ້ອນ.

source: %s (compiling ...)
lo: %s (ກຳລັງຄອມໄພລ໌...)

source: Show long line hints
lo: ສະແດງຄຳໃບ້ແຖວຍາວ

source: Extend far left
lo: ຂະຫຍາຍຊ້າຍສຸດ

source: Extend some left
lo: ຂະຫຍາຍຊ້າຍບາງສ່ວນ

# lazarusidestrconsts.liscompletionlonglinehinttypenone
source: Never
lo: ບໍ່ເຄີຍ

source: Extend right only
lo: ຂະຫຍາຍຂວາເທົ່ານັ້ນ

source: Component name "%s" is keyword
lo: ຊື່ອົງປະກອບ "%s" ເປັນຄຳສະຫງວນ

source: View All
lo: ເບິ່ງທັງໝົດ

source: Open package
lo: ເປີດແພັກເກດ

source: Open unit
lo: ເປີດຢູນິດ

source: Compress
lo: ບີບອັດ

source: The resulting directory will be compressed into a ZIP file.
lo: ໄດເຣັກທໍຣີຜົນລັຍຈະຖືກບີບອັດເປັນຟາຍລ໌ ZIP.

# lazarusidestrconsts.liscomptest
source: &Test
lo: &ທົດສອບ

source: Condition
lo: ເງື່ອນໄຂ

# lazarusidestrconsts.lisconditionals
source: Conditionals
lo: ເງື່ອນໄຂ

source: Lazarus config directory
lo: ໄດເຣັກທໍຣີການຕັ້ງຄ່າ Lazarus

source: Config file of additions:
lo: ຟາຍລ໌ການຕັ້ງຄ່າຂອງສ່ວນເພີ່ມເຕີມ:

source: Configure Build %s
lo: ຕັ້ງຄ່າການສ້າງ %s

source: Configure "Build Lazarus"
lo: ຕັ້ງຄ່າ "Build Lazarus"

source: Configure Toolbar
lo: ຕັ້ງຄ່າ Toolbar

source: Configure Lazarus IDE
lo: ຕັ້ງຄ່າ Lazarus IDE

source: Confirm
lo: ຢືນຢັນ

source: Confirmation
lo: ການຢືນຢັນ

source: Lazarus will be rebuilt with the following profiles:%sContinue?
lo: Lazarus ຈະຖືກສ້າງໃໝ່ດ້ວຍໂປຣໄຟລ໌ຕໍ່ໄປນີ້:%sສືບຕໍ່ບໍ່?

source: Confirm changes
lo: ຢືນຢັນການປ່ຽນແປງ

source: Confirm delete
lo: ຢືນຢັນການລຶບ

source: Do you want to rebuild Lazarus with profile: %s?
lo: ເຈົ້າຕ້ອງການສ້າງ Lazarus ໃໝ່ດ້ວຍໂປຣໄຟລ໌: %s ບໍ່?

source: Confirm new package set for the IDE
lo: ຢືນຢັນຊຸດແພັກເກດໃໝ່ສຳລັບ IDE

# lazarusidestrconsts.lisconfirmpackageaction
source: Action
lo: ການກະທຳ

source: New package set
lo: ຊຸດແພັກເກດໃໝ່

source: Old package set
lo: ຊຸດແພັກເກດເກົ່າ

source: Confirm Replace
lo: ຢືນຢັນການແທນທີ່

source: Conflict
lo: ຂໍ້ຂັດແຍ່ງ

source: Conflict detected
lo: ກວດພົບຂໍ້ຂັດແຍ່ງ

source: Console application
lo: ແອັບພລິເຄຊັນຄອນໂຊນ

source: A Free Pascal command line program using TCustomApplication to easily check command line options, handling exceptions, etc.
lo: ໂປຣແກຣມ Free Pascal command line ທີ່ໃຊ້ TCustomApplication ເພື່ອກວດສອບຕົວເລືອກ command line, ຈັດການ exceptions, ແລະ ອື່ນໆໄດ້ຢ່າງງ່າຍດາຍ.

source: Constructor code
lo: ໂຄດ Constructor

source: contains
lo: ປະກອບມີ

# lazarusidestrconsts.liscontents
source: Contents
lo: ເນື້ອຫາ

source: Context sensitive
lo: ຕາມບໍລິບົດ

source: Continue and do not ask again
lo: ສືບຕໍ່ ແລະ ບໍ່ຕ້ອງຖາມອີກ

source: Continue building
lo: ສືບຕໍ່ການສ້າງ

source: Continue without loading form
lo: ສືບຕໍ່ໂດຍບໍ່ໂຫຼດຟອມ

source: Contributors
lo: ຜູ້ປະກອບສ່ວນ

source: Control needs parent
lo: Control ຕ້ອງການ parent

source: Add comment after replacement
lo: ເພີ່ມຄອມເມັ້ນຫຼັງຈາກການແທນທີ່

source: Added MODE Delphi syntax modifier after unit name.
lo: ເພີ່ມ MODE Delphi syntax modifier ຫຼັງຈາກຊື່ຢູນິດ.

source: Adding flag for "Register" procedure in unit %s.
lo: ກຳລັງເພີ່ມ flag ສຳລັບໂປຣຊີເຈີ "Register" ໃນຢູນິດ %s.

source: ")" is missing from replacement function: %s
lo: ")" ຂາດຫາຍໄປຈາກຟັງຊັນການແທນທີ່: %s

source: Bracket not found
lo: ບໍ່ພົບວົງເລັບ

source: { *Converted from %s* }
lo: { *ແປງມາຈາກ %s* }

source: An offset is added to Top coordinate of controls inside visual containers
lo: An offset ຖືກເພີ່ມໃສ່ພິກັດ Top ຂອງ controls ພາຍໃນ visual containers

source: Deleted file %s
lo: ລຶບຟາຍລ໌ %s

source: Added defines %s in custom options
lo: ເພີ່ມ defines %s ໃນຕົວເລືອກກຳນົດເອງ

source: Added Package %s as a dependency.
lo: ເພີ່ມແພັກເກດ %s ເປັນ dependency.

source: Added unit "%s" to uses section.
lo: ເພີ່ມຢູນິດ "%s" ໃສ່ພາກ uses.

# lazarusidestrconsts.lisconvdelphiallsubdirsscanned
source: All sub-directories will be scanned for unit files
lo: ໄດເຣັກທໍຣີຍ່ອຍທັງໝົດຈະຖືກສະແກນຫາຟາຍລ໌ຢູນິດ

source: BeginCodeTools failed!
lo: BeginCodeTools ລົ້ມເຫຼວ!

source: Categories:
lo: ໝວດໝູ່:

source: Changed encoding from %s to UTF-8
lo: ປ່ຽນການເຂົ້າລະຫັດຈາກ %s ເປັນ UTF-8

source: Conversion Aborted.
lo: ການແປງຖືກຍົກເລີກ.

source: Conversion Ready.
lo: ການແປງພ້ອມແລ້ວ.

source: Conversion took: %s
lo: ການແປງໃຊ້ເວລາ: %s

source: Convert Delphi package
lo: ແປງແພັກເກດ Delphi

source: Convert Delphi project
lo: ແປງໂຄງການ Delphi

source: Convert Delphi unit
lo: ແປງຢູນິດ Delphi

source: *** Converting unit files found during conversion ***
lo: *** ກຳລັງແປງຟາຍລ໌ຢູນິດທີ່ພົບລະຫວ່າງການແປງ ***

source: *** Converting unit files belonging to project/package ***
lo: *** ກຳລັງແປງຟາຍລ໌ຢູນິດທີ່ຂຶ້ນກັບໂຄງການ/ແພັກເກດ ***

source: Error="%s"
lo: ຂໍ້ຜິດພາດ="%s"

source: Exception happened during unit conversion. Continuing with form files of already converted units...
lo: ເກີດ Exception ລະຫວ່າງການແປງຢູນິດ. ກຳລັງສືບຕໍ່ກັບຟາຍລ໌ຟອມຂອງຢູນິດທີ່ ແປງແລ້ວ...

source: Failed converting unit
lo: ການແປງຢູນິດລົ້ມເຫຼວ

source: Failed to convert unit "%s"
lo: ບໍ່ສາມາດແປງຢູນິດ "%s"

source: Fixed character case of unit "%s" to "%s".
lo: ແກ້ໄຂຕົວພິມນ້ອຍ/ໃຫຍ່ຂອງຢູນິດ "%s" ເປັນ "%s".

source: Found all unit files
lo: ພົບຟາຍລ໌ຢູນິດທັງໝົດ

source: Delphi Function
lo: ຟັງຊັນ Delphi

source: %s(%s,%s) missing include file
lo: %s(%s,%s) ຂາດຟາຍລ໌ include

source: Delphi Name
lo: ຊື່ Delphi

source: Package name exists
lo: ຊື່ແພັກເກດມີຢູ່ແລ້ວ

source: Package %s is required but not installed in Lazarus! Install it later.
lo: ຕ້ອງການແພັກເກດ %s ແຕ່ຍັງບໍ່ໄດ້ຕິດຕັ້ງໃນ Lazarus! ຕິດຕັ້ງມັນພາຍຫຼັງ.

source: Omitted unit %s from project
lo: ຂ້າມຢູນິດ %s ຈາກໂຄງການ

source: Removed unit "%s" from uses section.
lo: ລຶບຢູນິດ "%s" ອອກຈາກພາກ uses.

source: *** Fixing used units and Repairing form files ***
lo: *** ກຳລັງແກ້ໄຂຢູນິດທີ່ໃຊ້ ແລະ ສ້ອມແປງຟາຍລ໌ຟອມ ***

# lazarusidestrconsts.lisconvdelphireplacedunitinusessection
source: Replaced unit "%s" with "%s" in uses section.
lo: ແທນທີ່ຢູນິດ "%s" ດ້ວຍ "%s" ໃນພາກ uses.

source: There is already a package with the name "%s"%sPlease close this package first.
lo: ມີແພັກເກດທີ່ມີຊື່ "%s" ຢູ່ແລ້ວ%sກະລຸນາປິດແພັກເກດນີ້ກ່ອນ.

source: Unitname exists in LCL
lo: ຊື່ຢູນິດມີຢູ່ໃນ LCL

source: Units to replace in %s
lo: ຢູນິດທີ່ຈະແທນທີ່ໃນ %s

source: LCL already has a unit with name %s. Delete local file %s?
lo: LCL ມີຢູນິດຊື່ %s ຢູ່ແລ້ວ. ລຶບຟາຍລ໌ທ້ອງຖິ່ນ %s ບໍ່?

source: .dproj file is not supported yet. The file is used by Delphi 2007 and newer. Please select a .dpr file for projects or .dpk file for packages.
lo: ຟາຍລ໌ .dproj ຍັງບໍ່ຮອງຮັບ. ຟາຍລ໌ນີ້ໃຊ້ໂດຍ Delphi 2007 ແລະ ໃໝ່ກວ່າ. ກະລຸນາ ເລືອກຟາຍລ໌ .dpr ສຳລັບໂຄງການ ຫຼື ຟາຍລ໌ .dpk ສຳລັບແພັກເກດ.

source: Conversion error
lo: ຂໍ້ຜິດພາດການແປງ

source: Convert
lo: ແປງ

source: Convert Encoding
lo: ແປງການເຂົ້າລະຫັດ

source: Convert encoding of projects/packages
lo: ແປງການເຂົ້າລະຫັດຂອງໂຄງການ/ແພັກເກດ

source: Other options affecting the conversion
lo: ຕົວເລືອກອື່ນໆທີ່ມີຜົນຕໍ່ການແປງ

source: Convert project or package
lo: ແປງໂຄງການ ຫຼື ແພັກເກດ

source: Target
lo: ເປົ້າໝາຍ

source: Cross-platform versus Windows-only
lo: Cross-platform ທຽບກັບ Windows-only

source: Converter adds conditional compilation to support different targets
lo: ຕົວແປງເພີ່ມ conditional compilation ເພື່ອຮອງຮັບເປົ້າໝາຍທີ່ແຕກຕ່າງກັນ

source: Use the same DFM form file
lo: ໃຊ້ຟາຍລ໌ຟອມ DFM ດຽວກັນ

source: Same DFM file for Lazarus and Delphi instead of copying it to LFM
lo: ຟາຍລ໌ DFM ດຽວກັນສຳລັບ Lazarus ແລະ Delphi ແທນທີ່ຈະສຳເນົາເປັນ LFM

source: Support Delphi
lo: ຮອງຮັບ Delphi

source: Use conditional compilation to support Delphi
lo: ໃຊ້ conditional compilation ເພື່ອຮອງຮັບ Delphi

source: Fixed unit name from %s to %s.
lo: ແກ້ໄຂຊື່ຢູນິດຈາກ %s ເປັນ %s.

source: Function Replacements
lo: ການແທນທີ່ຟັງຊັນ

# lazarusidestrconsts.lisconvfuncreplhint
source: Some Delphi functions can be replaced with LCL function
lo: ບາງຟັງຊັນ Delphi ສາມາດແທນທີ່ດ້ວຍຟັງຊັນ LCL

source: Functions / procedures to replace
lo: ຟັງຊັນ / ໂປຣຊີເຈີ ທີ່ຈະແທນທີ່

source: New Name
lo: ຊື່ໃໝ່

source: Problems when trying to find all units from project file %s
lo: ມີບັນຫາເມື່ອພະຍາຍາມຊອກຫາຢູນິດທັງໝົດຈາກຟາຍລ໌ໂຄງການ %s

source: Problems when fixing include files in file %s
lo: ມີບັນຫາເມື່ອແກ້ໄຂຟາຍລ໌ include ໃນຟາຍລ໌ %s

source: Problems when repairing form file %s
lo: ມີບັນຫາເມື່ອສ້ອມແປງຟາຍລ໌ຟອມ %s

source: Repairing include files :
lo: ກຳລັງສ້ອມແປງຟາຍລ໌ include :

source: Replaced call %s with %s
lo: ແທນທີ່ການເອີ້ນ %s ດ້ວຍ %s

source: Replacement function parameter number should be >= 1: %s
lo: ຈຳນວນພາຣາມິເຕີຂອງຟັງຊັນແທນທີ່ຄວນຈະ >= 1: %s

source: "$" should be followed by a number: %s
lo: "$" ຄວນຕາມດ້ວຍຕົວເລກ: %s

source: Stopped because there already is a package with the same name
lo: ຢຸດແລ້ວ ເນື່ອງຈາກມີແພັກເກດທີ່ມີຊື່ດຽວກັນຢູ່ແລ້ວ

source: This log was saved to %s
lo: ບັນທຶກນີ້ຖືກບັນທຶກໄວ້ທີ່ %s

source: Type Replacements
lo: ການແທນທີ່ປະເພດ (Type)

source: Unknown types in form file (DFM/LFM)
lo: ປະເພດທີ່ບໍ່ຮູ້ຈັກໃນຟາຍລ໌ຟອມ (DFM/LFM)

source: Types to replace
lo: ປະເພດທີ່ຈະແທນທີ່

source: Unit Replacements
lo: ການແທນທີ່ຢູນິດ

source: Unit names in uses section of a source unit
lo: ຊື່ຢູນິດໃນພາກ uses ຂອງຢູນິດຊອດໂຄດ

source: Units to replace
lo: ຢູນິດທີ່ຈະແທນທີ່

source: Unknown properties
lo: ຄຸນສົມບັດທີ່ບໍ່ຮູ້ຈັກ

source: User selected to end conversion with file %s
lo: ຜູ້ໃຊ້ເລືອກທີ່ຈະສິ້ນສຸດການແປງດ້ວຍຟາຍລ໌ %s

source: Add/Config/Delete Toolbar(s)
lo: ເພີ່ມ/ຕັ້ງຄ່າ/ລຶບ Toolbar(s)

source: Add Divider
lo: ເພີ່ມຕົວແບ່ງ

source: Add selected item to toolbar
lo: ເພີ່ມລາຍການທີ່ເລືອກໃສ່ toolbar

source: Available commands
lo: ຄຳສັ່ງທີ່ມີຢູ່

source: Toolbars border style
lo: ຮູບແບບຂອບ Toolbars

# lazarusidestrconsts.liscoolbarborderstyleitem0
source: None
lo: ບໍ່ມີ

# lazarusidestrconsts.liscoolbarborderstyleitem1
source: Single
lo: ດຽວ

source: &Configure
lo: &ຕັ້ງຄ່າ

source: Are you sure you want to delete the selected toolbar?
lo: ເຈົ້າແນ່ໃຈບໍ່ວ່າຕ້ອງການລຶບ toolbar ທີ່ເລືອກ?

source: There must be at least one toolbar!
lo: ຕ້ອງມີຢ່າງໜ້ອຍໜຶ່ງ toolbar!

source: General Coolbar Settings
lo: ການຕັ້ງຄ່າ Coolbar ທົ່ວໄປ

source: Toolbars grab style
lo: ຮູບແບບການຈັບ Toolbars

source: Simple
lo: ງ່າຍດາຍ

# lazarusidestrconsts.liscoolbargrabstyleitem1
source: Double
lo: ຄູ່

source: HorLines
lo: ເສັ້ນນອນ

source: VerLines
lo: ເສັ້ນຕັ້ງ

# lazarusidestrconsts.liscoolbargrabstyleitem5
source: Button
lo: ປຸ່ມ

source: Grab width
lo: ຄວາມກວ້າງຂອງບ່ອນຈັບ

source: Move selected toolbar item down
lo: ຍ້າຍລາຍການ toolbar ທີ່ເລືອກລົງ

source: Move selected toolbar item up
lo: ຍ້າຍລາຍການ toolbar ທີ່ເລືອກຂຶ້ນ

source: Remove selected item from toolbar
lo: ລຶບລາຍການທີ່ເລືອກອອກຈາກ toolbar

source: Restore defaults
lo: ຄືນຄ່າເລີ່ມຕົ້ນ

source: Please select a toolbar first!
lo: ກະລຸນາເລືອກ toolbar ກ່ອນ!

source: Source Tab
lo: ແຖບ Source

source: Toolbar commands
lo: ຄຳສັ່ງ Toolbar

source: Coolbar is &visible
lo: ສະແດງ Coolbar

source: Coolbar width
lo: ຄວາມກວ້າງ Coolbar

source: Copy All Items to Clipboard
lo: ສຳເນົາລາຍການທັງໝົດໄປທີ່ Clipboard

source: Copy All/Original Messages to Clipboard
lo: ສຳເນົາຂໍ້ຄວາມທັງໝົດ/ຕົ້ນສະບັບໄປທີ່ Clipboard

source: Copy All Shown Messages to Clipboard
lo: ສຳເນົາຂໍ້ຄວາມທີ່ສະແດງທັງໝົດໄປທີ່ Clipboard

source: Copy description to clipboard
lo: ສຳເນົາຄຳອະທິບາຍໄປທີ່ clipboard

source: Copy error
lo: ສຳເນົາຂໍ້ຜິດພາດ

source: Copy Filename %s
lo: ສຳເນົາຊື່ຟາຍລ໌ %s

source: Copy File Names to Clipboard
lo: ສຳເນົາຊື່ຟາຍລ໌ໄປທີ່ Clipboard

source: Copying files failed.
lo: ການສຳເນົາຟາຍລ໌ລົ້ມເຫຼວ.

source: Copy "%s" to clipboard
lo: ສຳເນົາ "%s" ໄປທີ່ clipboard

source: Copying a whole form is not implemented.
lo: ການສຳເນົາຟອມທັງໝົດຍັງບໍ່ຮອງຮັບ.

source: Copy Item to Clipboard
lo: ສຳເນົາລາຍການໄປທີ່ Clipboard

source: Copy/Move File to Directory
lo: ສຳເນົາ/ຍ້າຍ ຟາຍລ໌ໄປທີ່ໄດເຣັກທໍຣີ

source: Copy Selected Items to Clipboard
lo: ສຳເນົາລາຍການທີ່ເລືອກໄປທີ່ Clipboard

source: Copy Selected Messages to Clipboard
lo: ສຳເນົາຂໍ້ຄວາມທີ່ເລືອກໄປທີ່ Clipboard

source: Scan for FPC messages
lo: ສະແກນຫາຂໍ້ຄວາມ FPC

source: Scan for Make messages
lo: ສະແກນຫາຂໍ້ຄວາມ Make

source: Skip calling compiler
lo: ຂ້າມການເອີ້ນ compiler

source: Warning: The additional compiler config file has the same name, as one of the standard config filenames the Free Pascal compiler is looking for. This can result in ONLY parsing the additional config and skipping the standard config.
lo: ຄຳເຕືອນ: ຟາຍລ໌ການຕັ້ງຄ່າ compiler ເພີ່ມເຕີມມີຊື່ດຽວກັນກັບໜຶ່ງໃນ ຊື່ຟາຍລ໌ການຕັ້ງຄ່າມາດຕະຖານທີ່ Free Pascal compiler ກຳລັງຊອກຫາ. ອັນນີ້ອາດຈະສົ່ງຜົນ ໃຫ້ມີການ parsing ການຕັ້ງຄ່າເພີ່ມເຕີມເທົ່ານັ້ນ ແລະ ຂ້າມການຕັ້ງຄ່າມາດຕະຖານ.

source: Open Package %s
lo: ເປີດແພັກເກດ %s

source: Open Unit %s
lo: ເປີດຢູນິດ %s

source: Create and edit
lo: ສ້າງ ແລະ ແກ້ໄຂ

source: Create a project first!
lo: ສ້າງໂຄງການກ່ອນ!

source: Create Debug and Release modes
lo: ສ້າງໂໝດ Debug ແລະ Release

source: Create directory?
lo: ສ້າງໄດເຣັກທໍຣີບໍ່?

source: Create Filter
lo: ສ້າງຕົວຄັດຕອງ

source: Restore Fppkg configuration
lo: ຄືນຄ່າການຕັ້ງຄ່າ Fppkg

source: Create function
lo: ສ້າງຟັງຊັນ

source: Create Help node
lo: ສ້າງໂນດ Help

source: Create it
lo: ສ້າງມັນ

source: Create local variable "%s"
lo: ສ້າງຕົວປ່ຽນ local "%s"

source: Create new addition
lo: ສ້າງ addition ໃໝ່

source: (Create new package)
lo: (ສ້າງແພັກເກດໃໝ່)

source: Create new package component
lo: ສ້າງອົງປະກອບແພັກເກດໃໝ່

source: Create project
lo: ສ້າງໂຄງການ

source: Extract translatable strings from a form when saving its LFM file
lo: ດຶງຂໍ້ຄວາມທີ່ແປໄດ້ຈາກຟອມເມື່ອບັນທຶກຟາຍລ໌ LFM ຂອງມັນ

source: Creating file index of FPC sources %s ...
lo: ກຳລັງສ້າງດັດຊະນີຟາຍລ໌ຂອງຊອດໂຄດ FPC %s ...

source: Choose Directory
lo: ເລືອກໄດເຣັກທໍຣີ

source: CodeTools Directory Values
lo: ຄ່າໄດເຣັກທໍຣີ CodeTools

source: <no variable selected>
lo: <ບໍ່ມີຕົວປ່ຽນຖືກເລືອກ>

source: Open Preview
lo: ເປີດການສະແດງຕົວຢ່າງ

source: Tools
lo: ເຄື່ອງມື

source: Variable: %s
lo: ຕົວປ່ຽນ: %s

source: Variable Name
lo: ຊື່ຕົວປ່ຽນ

source: Templates
lo: ແມ່ແບບ

source: Update all method signatures
lo: ອັບເດດລາຍເຊັນ method ທັງໝົດ

source: Update multiple procedure signatures
lo: ອັບເດດລາຍເຊັນໂປຣຊີເຈີຫຼາຍອັນ

source: please select a macro
lo: ກະລຸນາເລືອກ macro

source: Select Code Macro
lo: ເລືອກ Code Macro

source: Current LCL widgetset: "%s"
lo: ຊຸດ widget LCL ປັດຈຸບັນ: "%s"

source: Current state:
lo: ສະຖານະປັດຈຸບັນ:

source: Cursor column in current editor
lo: ຖັນເຄີເຊີໃນຕົວແກ້ໄຂປັດຈຸບັນ

source: Cursor row in current editor
lo: ແຖວເຄີເຊີໃນຕົວແກ້ໄຂປັດຈຸບັນ

source: These options are passed to the compiler after macros are replaced.
lo: ຕົວເລືອກເຫຼົ່ານີ້ຈະຖືກສົ່ງໄປຫາ compiler ຫຼັງຈາກ macros ຖືກແທນທີ່.

source: custom options
lo: ຕົວເລືອກກຳນົດເອງ

source: Custom options
lo: ຕົວເລືອກກຳນົດເອງ

source: Custom Options
lo: ຕົວເລືອກກຳນົດເອງ

source: Custom Program
lo: ໂປຣແກຣມກຳນົດເອງ

source: A Custom Free Pascal program.
lo: ໂປຣແກຣມ Free Pascal ກຳນົດເອງ.

source: Data Module
lo: ໂມດູນຂໍ້ມູນ

source: Breakpoint Evaluation
lo: ການປະເມີນຈຸດຢຸດ

source: Breakpoint Message
lo: ຂໍ້ຄວາມຈຸດຢຸດ

source: Default Color
lo: ສີເລີ່ມຕົ້ນ

source: No debugger specified
lo: ບໍ່ໄດ້ກຳນົດ debugger

source: Set the breakpoint anyway
lo: ຕັ້ງຈຸດຢຸດຢູ່ດີ

source: There is no debugger specified.%sSetting breakpoints have no effect until you set up a Debugger in the debugger options dialog in the menu.
lo: ບໍ່ໄດ້ກຳນົດ debugger.%sການຕັ້ງຄ່າຈຸດຢຸດຈະບໍ່ມີຜົນຈົນກວ່າເຈົ້າຈະຕັ້ງຄ່າ Debugger ໃນກ່ອງໂຕ້ຕອບຕົວເລືອກ debugger ໃນເມນູ.

# lazarusidestrconsts.lisdebug
source: Debug
lo: ດີບັກ

source: Confirm to delete all Breakpoints
lo: ຢືນຢັນການລຶບຈຸດຢຸດທັງໝົດ

source: Confirm to delete Breakpoints in same file
lo: ຢືນຢັນການລຶບຈຸດຢຸດໃນຟາຍລ໌ດຽວກັນ

source: Confirm to clear History
lo: ຢືນຢັນການລຶບລ້າງປະຫວັດ

source: Confirm to delete all Watches
lo: ຢືນຢັນການລຶບ Watches ທັງໝົດ

# lazarusidestrconsts.lisdebugger
source: Debugger
lo: ດີບັກເກີ

source: The debugger encountered an internal error.%0:s%0:sSave your work.%0:sYou may then hit "Stop", or "Reset debugger" to terminate the debug session.
lo: The debugger ພົບຂໍ້ຜິດພາດພາຍໃນ.%0:s%0:sບັນທຶກວຽກຂອງເຈົ້າ.%0:sຈາກນັ້ນເຈົ້າອາດຈະ ກົດ "ຢຸດ", ຫຼື "ຣີເຊັດ debugger" ເພື່ອຢຸດເຊົາເຊດຊັນການດີບັກ.

source: Debugger invalid
lo: Debugger ບໍ່ຖືກຕ້ອງ

source: %s (debugging ...)
lo: %s (ກຳລັງດີບັກ...)

source: Automatic typecast for objects
lo: Automatic typecast ສຳລັບ objects

source: Close log file between writes. Prevents loss of unsaved data when the IDE crashes. By default, writes are buffered by the OS for performance.
lo: ປິດຟາຍລ໌ log ລະຫວ່າງການຂຽນ. ປ້ອງກັນການສູນເສຍຂໍ້ມູນທີ່ຍັງບໍ່ໄດ້ບັນທຶກເມື່ອ IDE ຂັດຂ້ອງ. ໂດຍຄ່າເລີ່ມຕົ້ນ, ການຂຽນຈະຖືກ buffer ໂດຍ OS ເພື່ອປະສິດທິພາບ.

source: Add Exception
lo: ເພີ່ມ Exception

source: Additional search path
lo: Path ຄົ້ນຫາເພີ່ມເຕີມ

source: BETA: Allow function calls in watches (if supported by backend)
lo: BETA: ອະນຸຍາດໃຫ້ເອີ້ນຟັງຊັນໃນ watches (ຖ້າຮອງຮັບໂດຍ backend)

source: Automatically close the assembler window, after source not found
lo: ປິດປ່ອງຢ້ຽມ assembler ອັດຕະໂນມັດ, ຫຼັງຈາກບໍ່ພົບຊອດໂຄດ

source: Automatically set "use instance class type" for new watches
lo: ຕັ້ງຄ່າ "use instance class type" ອັດຕະໂນມັດສຳລັບ watches ໃໝ່

source: Breakpoint
lo: ຈຸດຢຸດ

source: Clear log on run
lo: ລຶບ log ເມື່ອ run

# lazarusidestrconsts.lisdebugoptionsfrmdebugger
source: Debugger
lo: ດີບັກເກີ

source: Debugger dialogs
lo: ກ່ອງໂຕ້ຕອບ Debugger

source: Debugger general options
lo: ຕົວເລືອກ Debugger ທົ່ວໄປ

source: Debugger specific options (depends on type of debugger)
lo: ຕົວເລືອກສະເພາະຂອງ Debugger (ຂຶ້ນກັບປະເພດຂອງ debugger)

source: Always bring debug-windows (watches, locals) to front when adding items
lo: ນຳປ່ອງຢ້ຽມ debug (watches, locals) ມາໄວ້ທາງໜ້າສະເໝີເມື່ອເພີ່ມລາຍການ

source: Duplicate Exception name
lo: ຊື່ Exception ຊ້ຳກັນ

source: Change type
lo: ປ່ຽນປະເພດ

source: Changing the type for the current debugger backend. Use "Add" or "Copy" to create a new backend with a new type.
lo: ກຳລັງປ່ຽນປະເພດສຳລັບ debugger backend ປັດຈຸບັນ. ໃຊ້ "ເພີ່ມ" ຫຼື "ສຳເນົາ" ເພື່ອ ສ້າງ backend ໃໝ່ດ້ວຍປະເພດໃໝ່.

source: Enter the name of the exception
lo: ໃສ່ຊື່ຂອງ exception

source: Handled by
lo: ຈັດການໂດຍ

source: Handled by Debugger
lo: ຈັດການໂດຍ Debugger

source: Handled by Program
lo: ຈັດການໂດຍ Program

source: Ignore these exceptions
lo: ບໍ່ສົນໃຈ exceptions ເຫຼົ່ານີ້

source: Limit line count to
lo: ຈຳກັດຈຳນວນແຖວໄວ້ທີ່

# lazarusidestrconsts.lisdebugoptionsfrmmodule
source: Module
lo: ໂມດູນ

# lazarusidestrconsts.lisdebugoptionsfrmname
source: Name:
lo: ຊື່:

source: Notify on Exceptions
lo: ແຈ້ງເຕືອນເມື່ອມີ Exceptions

source: Output
lo: ຜົນລາຍງານ

source: Process
lo: ຂະບວນການ

source: Reset Debugger after each run
lo: ຣີເຊັດ Debugger ຫຼັງຈາກແຕ່ລະຄັ້ງທີ່ run

source: Show message on stop with Error (Exit-code <> 0)
lo: ສະແດງຂໍ້ຄວາມເມື່ອຢຸດພ້ອມຂໍ້ຜິດພາດ (Exit-code <> 0)

source: Show message on stop
lo: ສະແດງຂໍ້ຄວາມເມື່ອຢຸດ

source: Signals
lo: ສັນຍານ

source: Unknown Debugger backend "%s"
lo: ບໍ່ຮູ້ຈັກ Debugger backend "%s"

source: Use event log colors
lo: ໃຊ້ສີໃນບັນທຶກເຫດການ (Event log)

source: -- Use IDE default Debugger --
lo: -- ໃຊ້ Debugger ເລີ່ມຕົ້ນຂອງ IDE --

source: -- Use project Debugger --
lo: -- ໃຊ້ Debugger ຂອງໂປຣເຈັກ --

source: Unable to load file
lo: ບໍ່ສາມາດໂຫຼດໄຟລ໌ໄດ້

source: Unable to load file "%s".
lo: ບໍ່ສາມາດໂຫຼດໄຟລ໌ "%s" ໄດ້.

# lazarusidestrconsts.lisdefault
source: Default
lo: ຄ່າເລີ່ມຕົ້ນ

source: Default class visibility section of new methods. For example code completion on OnShow:=
lo: ສ່ວນການເບິ່ງເຫັນ Class ເລີ່ມຕົ້ນຂອງ method ໃໝ່. ຕົວຢ່າງ: ການເຕີມໂຄ້ດໃນ OnShow:=

source: The default is ComboBox with "True" and "False" selections
lo: ຄ່າເລີ່ມຕົ້ນແມ່ນ ComboBox ທີ່ມີຕົວເລືອກ "True" ແລະ "False"

source: (default)
lo: (ຄ່າເລີ່ມຕົ້ນ)

source: Default section of methods
lo: ສ່ວນເລີ່ມຕົ້ນຂອງ method

source: Delay for completion box
lo: ເວລາໜ່ວງສຳລັບກ່ອງເຕີມຄຳ (completion box)

source: Delay for long line hints in completion box
lo: ເວລາໜ່ວງສຳລັບຄຳແນະນຳແຖວຍາວໃນກ່ອງເຕີມຄຳ

source: Delay for hints
lo: ເວລາໜ່ວງສຳລັບຄຳແນະນຳ (hints)

source: Delete?
lo: ລົບບໍ່?

source: Delete addition "%s"?
lo: ລົບສ່ວນເພີ່ມ "%s" ບໍ່?

source: &Delete All
lo: &ລົບທັງໝົດ

source: Delete all these files?
lo: ລົບໄຟລ໌ທັງໝົດເຫຼົ່ານີ້ບໍ່?

source: Delete ambiguous file?
lo: ລົບໄຟລ໌ທີ່ບໍ່ຊັດເຈນບໍ່?

source: Delete macro "%s"?
lo: ລົບ Macro "%s" ບໍ່?

source: Delete mode "%s"
lo: ລົບໂໝດ "%s"

source: Delete old file "%s"?
lo: ລົບໄຟລ໌ເກົ່າ "%s" ບໍ່?

source: Delete selected macro?
lo: ລົບ Macro ທີ່ເລືອກບໍ່?

source: Delete this addition
lo: ລົບສ່ວນເພີ່ມນີ້

source: Delete value "%s"?
lo: ລົບຄ່າ "%s" ບໍ່?

source: Delete value %s
lo: ລົບຄ່າ %s

source: Delimiter is semicolon.
lo: ຕົວຂັ້ນແມ່ນຈຸດຈຸດ (;).

source: Delphi compatible resources. Recommended.
lo: ຊັບພະຍາກອນທີ່ເຂົ້າກັນໄດ້ກັບ Delphi. ແນະນຳໃຫ້ໃຊ້.

source: "Design time" packages add components and menu items to the IDE. They can be used by projects but are not compiled into the project. The compiler will not find units of this package when compiling the project.
lo: ແພັກເກັດ "Design time" ເພີ່ມ component ແລະ ລາຍການເມນູໃຫ້ກັບ IDE. ພວກມັນສາມາດໃຊ້ໄດ້ໂດຍໂປຣເຈັກ ແຕ່ບໍ່ໄດ້ຖືກ compile ເຂົ້າໄປໃນໂປຣເຈັກ. Compiler ຈະບໍ່ເຫັນ unit ຂອງແພັກເກັດນີ້ເມື່ອ compile ໂປຣເຈັກ.

source: Destination directory
lo: ໄດເຣັກທໍຣີປາຍທາງ

source: Destructor code
lo: ໂຄ້ດ Destructor

source: %d files were renamed to lowercase.
lo: %d ໄຟລ໌ຖືກປ່ຽນຊື່ເປັນຕົວພິມນ້ອຍ.

source: Case Insensitive
lo: ບໍ່ສົນຕົວພິມໃຫຍ່/ນ້ອຍ

source: File1
lo: ໄຟລ໌ 1

source: File2
lo: ໄຟລ໌ 2

source: Ignore if empty lines were added or removed
lo: ບໍ່ສົນໃຈຖ້າມີການເພີ່ມ ຫຼື ລົບແຖວຫວ່າງ

source: Ignore difference in line ends (e.g. #10 = #13#10)
lo: ບໍ່ສົນໃຈຄວາມແຕກຕ່າງໃນຈຸດສິ້ນສຸດແຖວ (ເຊັ່ນ: #10 = #13#10)

source: Ignore amount of space chars
lo: ບໍ່ສົນໃຈຈຳນວນຂອງຕົວອັກສອນຍະຫວ່າງ

source: Ignore spaces (newline chars not included)
lo: ບໍ່ສົນໃຈຍະຫວ່າງ (ບໍ່ລວມຕົວອັກສອນຂຶ້ນແຖວໃໝ່)

source: Ignore spaces at end of line
lo: ບໍ່ສົນໃຈຍະຫວ່າງທ້າຍແຖວ

source: Ignore spaces at start of line
lo: ບໍ່ສົນໃຈຍະຫວ່າງຕົ້ນແຖວ

source: Only selection
lo: ສະເພາະສ່ວນທີ່ເລືອກ

source: Open difference in editor
lo: ເປີດຄວາມແຕກຕ່າງໃນຕົວແກ້ໄຂ

source: different unit %s found at new position "%s"
lo: ພົບ unit %s ທີ່ແຕກຕ່າງໃນຕຳແໜ່ງໃໝ່ "%s"

source: Directives for new unit
lo: Directives ສຳລັບ unit ໃໝ່

source: Directories
lo: ໄດເຣັກທໍຣີ

source: Directory:
lo: ໄດເຣັກທໍຣີ:

source: Directory "%s" not found.
lo: ບໍ່ພົບໄດເຣັກທໍຣີ "%s".

source: directory %s not found
lo: ບໍ່ພົບໄດເຣັກທໍຣີ %s

source: Directory where the IDE puts the .po files
lo: ໄດເຣັກທໍຣີທີ່ IDE ເກັບໄຟລ໌ .po

source: Disable I18N for LFM
lo: ປິດການໃຊ້ງານ I18N ສຳລັບ LFM

source: Disable Option -Xg?
lo: ປິດການໃຊ້ງານຕົວເລືອກ -Xg ບໍ່?

source: Disable option -Xg
lo: ປິດການໃຊ້ງານຕົວເລືອກ -Xg

source: Discard changes
lo: ຍົກເລີກການປ່ຽນແປງ

source: Discard all changes
lo: ຍົກເລີກການປ່ຽນແປງທັງໝົດ

source: Discard changes and open project
lo: ຍົກເລີກການປ່ຽນແປງ ແລະ ເປີດໂປຣເຈັກ

source: Discard changes and quit
lo: ຍົກເລີກການປ່ຽນແປງ ແລະ ອອກ

source: Discard changes, create new project
lo: ຍົກເລີກການປ່ຽນແປງ, ສ້າງໂປຣເຈັກໃໝ່

source: Click on one of the above items to see the diff
lo: ຄລິກໃສ່ໜຶ່ງໃນລາຍການຂ້າງເທິງເພື່ອເບິ່ງຄວາມແຕກຕ່າງ (diff)

source: Error reading file: %s
lo: ເກີດຂໍ້ຜິດພາດໃນການອ່ານໄຟລ໌: %s

source: Ignore all disk changes
lo: ບໍ່ສົນໃຈການປ່ຽນແປງໃນດິດທັງໝົດ

source: Reload checked files from disk
lo: ໂຫຼດໄຟລ໌ທີ່ເລືອກໃໝ່ຈາກດິດ

source: Some files have changed on disk:
lo: ບາງໄຟລ໌ມີການປ່ຽນແປງໃນດິດ:

source: Some files have local changes. Either local or external changes will be overwritten.
lo: ບາງໄຟລ໌ມີການປ່ຽນແປງໃນເຄື່ອງ. ການປ່ຽນແປງໃນເຄື່ອງ ຫຼື ພາຍນອກຈະຖືກຂຽນທັບ.

source: Distinguish big and small letters e.g. A and a
lo: ແຍກຕົວພິມໃຫຍ່ ແລະ ຕົວພິມນ້ອຍ ເຊັ່ນ: A ແລະ a

source: All options ...
lo: ຕົວເລືອກທັງໝົດ ...
