Repository: fpc/Lazarus
Catalog: languages/lazaruside.*.po
Languages: lo

source: Command
lo: ຄຳສັ່ງ

# lazarusidestrconsts.cocoamfstbijumpback
source: Jump Back
lo: ໂດດກັບຄືນ

# lazarusidestrconsts.cocoamfstbijumpforward
source: Jump Forward
lo: ໂດດໄປໜ້າ

source: Search Instantly
lo: ຄົ້ນຫາທັນທີ

source: Link target line
lo: ເຊື່ອມຕໍ່ແຖວເປົ້າໝາຍ

source: Function name
lo: ຊື່ຟັງຊັນ

source: Source line
lo: ແຖວຊອດໂຄ້ດ

source: Address Breakpoint %s
lo: ຈຸດຢຸດທີ່ຢູ່ %s

source: at $%s
lo: ທີ່ $%s

source: at $%s: from origin %s line %d
lo: ທີ່ $%s: ຈາກຕົ້ນທາງ %s ແຖວ %d

source: at $%s: %s line %d
lo: ທີ່ $%s: %s ແຖວ %d

source: Source Breakpoint %s
lo: ຈຸດຢຸດຊອດໂຄ້ດ %s

source: Unknown Breakpoint %s
lo: ຈຸດຢຸດທີ່ບໍ່ຮູ້ຈັກ %s

source: Watchpoint %s
lo: ຈຸດເຝົ້າລະວັງ %s

source: Unknown Watchpoint out of scope %s
lo: ຈຸດເຝົ້າລະວັງທີ່ບໍ່ຮູ້ຈັກຢູ່ນອກຂອບເຂດ %s

source: Unknown Watchpoint triggered %s. Old value "%s", New Value "%s"
lo: ຈຸດເຝົ້າລະວັງທີ່ບໍ່ຮູ້ຈັກເຮັດວຽກ %s. ຄ່າເກົ່າ "%s", ຄ່າໃໝ່ "%s"

source: Watchpoint for "%s" out of scope %s
lo: ຈຸດເຝົ້າລະວັງສຳລັບ "%s" ຢູ່ນອກຂອບເຂດ %s

source: Watchpoint for "%s" was triggered %s. Old value "%s", New Value "%s"
lo: ຈຸດເຝົ້າລະວັງສຳລັບ "%s" ເຮັດວຽກແລ້ວ %s. ຄ່າເກົ່າ "%s", ຄ່າໃໝ່ "%s"

source: Use predefined scheme
lo: ໃຊ້ຮູບແບບທີ່ກຳນົດໄວ້ລ່ວງໜ້າ

source: Reset all settings
lo: ຣີເຊັດການຕັ້ງຄ່າທັງໝົດ

source: Reset all gutter settings
lo: ຣີເຊັດການຕັ້ງຄ່າຂອບແຖວທັງໝົດ

source: Reset all text settings
lo: ຣີເຊັດການຕັ້ງຄ່າຂໍ້ຄວາມທັງໝົດ

source: Add history point
lo: ເພີ່ມຈຸດປະຫວັດ

source: Context Menu
lo: ເມນູຄຳສັ່ງ

source: Context Menu (debug)
lo: ເມນູຄຳສັ່ງ (ດີບັກ)

source: Context Menu (tab)
lo: ເມນູຄຳສັ່ງ (ແຖບ)

source: Jumps to implementation
lo: ໂດດໄປຫາສ່ວນ implementation

source: Jumps to implementation/other block end
lo: ໂດດໄປຫາສ່ວນ implementation/ຈົບຕັນອື່ນ

source: History back
lo: ປະຫວັດຍ້ອນກັບ

source: History forward
lo: ປະຫວັດໄປໜ້າ

source: Toggle extra Caret
lo: ເປີດ/ປິດ Caret ເພີ່ມເຕີມ

# lazarusidestrconsts.dlfmousesimplebuttonnothing
source: Nothing/Default
lo: ບໍ່ມີຫຍັງ/ຄ່າເລີ່ມຕົ້ນ

# lazarusidestrconsts.dlfmousesimplebuttonpaste
source: Paste
lo: ວາງ

source: Continue %0:s (Bound to: %1:s)
lo: ສືບຕໍ່ %0:s (ຜູກກັບ: %1:s)

source: Continue %0:s
lo: ສືບຕໍ່ %0:s

source: Select text
lo: ເລືອກຂໍ້ຄວາມ

source: Select text (lines)
lo: ເລືອກຂໍ້ຄວາມ (ເປັນແຖວ)

source: Select text (tokens)
lo: ເລືອກຂໍ້ຄວາມ (tokens)

source: Select text (words)
lo: ເລືອກຂໍ້ຄວາມ (ເປັນຄຳ)

source: Select text (Column mode)
lo: ເລືອກຂໍ້ຄວາມ (ໂຫມດຖັນ)

source: Select text (Line mode)
lo: ເລືອກຂໍ້ຄວາມ (ໂຫມດແຖວ)

source: Set a free bookmark
lo: ຕັ້ງຄ່າບຸກມາກອິດສະຫຼະ

source: Select current Line (Full)
lo: ເລືອກແຖວປັດຈຸບັນ (ເຕັມ)

source: Select current Line (Text)
lo: ເລືອກແຖວປັດຈຸບັນ (ຂໍ້ຄວາມ)

source: Select current Paragraph
lo: ເລືອກວັກປັດຈຸບັນ

source: Select current Word
lo: ເລືອກຄຳປັດຈຸບັນ

source: Reset zoom
lo: ຣີເຊັດການຊູມ

source: This page does not represent your current settings. See advanced page. Use this page to reset any advanced changes
lo: ໜ້ານີ້ບໍ່ໄດ້ສະແດງການຕັ້ງຄ່າປັດຈຸບັນຂອງທ່ານ. ເບິ່ງໜ້າຂັ້ນສູງ. ໃຊ້ໜ້ານີ້ເພື່ອຣີເຊັດການປ່ຽນແປງຂັ້ນສູງຕ່າງໆ

# lazarusidestrconsts.dlfmousesimplegenericsect
source: General
lo: ທົ່ວໄປ

source: Standard, All actions (breakpoint, fold) on mouse down
lo: ມາດຕະຖານ, ການກະທຳທັງໝົດ (ຈຸດຢຸດ, ຫຍໍ້) ເມື່ອກົດເມົ້າລົງ

source: Extended, Actions (breakpoint, fold) on mouse up. Selection on mouse down and move
lo: ຂະຫຍາຍ, ການກະທຳ (ຈຸດຢຸດ, ຫຍໍ້) ເມື່ປ່ອຍເມົ້າຂຶ້ນ. ການເລືອກເມື່ອກົດເມົ້າລົງ ແລະ ເລື່ອນ

source: Extended, Actions, right gutter half only
lo: ຂະຫຍາຍ, ການກະທຳ, ຂອບແຖວເຄິ່ງຂວາເທົ່ານັ້ນ

source: Use line numbers to select lines
lo: ໃຊ້ເລກແຖວເພື່ອເລືອກແຖວ

# lazarusidestrconsts.dlfmousesimpleguttersect
source: Gutter
lo: ຂອບແຖວ

source: Right button click includes caret move
lo: ຄລິກປຸ່ມຂວາລວມທັງການຍ້າຍຕົວຊີ້ພິມ

# lazarusidestrconsts.dlfmousesimpletextsect
source: Text
lo: ຂໍ້ຄວາມ

source: Alt-Ctrl Button
lo: ປຸ່ມ Alt-Ctrl

source: Alt-Ctrl Wheel
lo: ລໍ້ເລື່ອນ Alt-Ctrl

source: Alt Button
lo: ປຸ່ມ Alt

source: Alt Wheel
lo: ລໍ້ເລື່ອນ Alt

source: Ctrl Button
lo: ປຸ່ມ Ctrl

source: Ctrl Wheel
lo: ລໍ້ເລື່ອນ Ctrl

source: Drag selection (copy/paste)
lo: ລາກສ່ວນທີ່ເລືອກ (ສຳເນົາ/ວາງ)

source: Extra-1 Button
lo: ປຸ່ມພິເສດ-1

source: Extra-2 Button
lo: ປຸ່ມພິເສດ-2

source: Alt Double
lo: Alt ດັບເບິນ

source: Ctrl Double
lo: Ctrl ດັບເບິນ

# lazarusidestrconsts.dlfmousesimpletextsectldoublelabel
source: Double
lo: ດັບເບິນ

source: Shift Double
lo: Shift ດັບເບິນ

# lazarusidestrconsts.dlfmousesimpletextsectlquadlabel
source: Quad
lo: ສີ່ຄັ້ງ

# lazarusidestrconsts.dlfmousesimpletextsectltriplelabel
source: Triple
lo: ສາມຄັ້ງ

source: Middle Button
lo: ປຸ່ມກາງ

# lazarusidestrconsts.dlfmousesimpletextsectpagebtn
source: Middle
lo: ກາງ

# lazarusidestrconsts.dlfmousesimpletextsectpageextra1
source: Extra 1
lo: ພິເສດ 1

# lazarusidestrconsts.dlfmousesimpletextsectpageextra2
source: Extra 2
lo: ພິເສດ 2

source: Horizontal-Wheel
lo: ລໍ້ເລື່ອນແນວນອນ

source: Left 1
lo: ຊ້າຍ 1

source: Left 2
lo: ຊ້າຍ 2

# lazarusidestrconsts.dlfmousesimpletextsectpageright
source: Right
lo: ຂວາ

# lazarusidestrconsts.dlfmousesimpletextsectpagewheel
source: Wheel
lo: ລໍ້ເລື່ອນ

source: Right Button
lo: ປຸ່ມຂວາ

source: Shift-Alt-Ctrl Button
lo: ປຸ່ມ Shift-Alt-Ctrl

source: Shift-Alt Button
lo: ປຸ່ມ Shift-Alt

source: Shift-Alt Wheel
lo: ລໍ້ເລື່ອນ Shift-Alt

source: Shift-Ctrl Button
lo: ປຸ່ມ Shift-Ctrl

source: Shift-Ctrl Wheel
lo: ລໍ້ເລື່ອນ Shift-Ctrl

source: Shift Button
lo: ປຸ່ມ Shift

# lazarusidestrconsts.dlfmousesimpletextsectwheellabel
source: Wheel
lo: ລໍ້ເລື່ອນ

source: Shift Wheel
lo: ລໍ້ເລື່ອນ Shift

source: You have unsaved changes. Using this page will undo changes made on the advanced page
lo: ທ່ານມີການປ່ຽນແປງທີ່ຍັງບໍ່ທັນບັນທຶກ. ການໃຊ້ໜ້ານີ້ຈະຍົກເລີກການປ່ຽນແປງທີ່ເຮັດໄວ້ໃນໜ້າຂັ້ນສູງ

source: Scroll horizontal (System speed)
lo: ເລື່ອນແນວນອນ (ຄວາມໄວລະບົບ)

source: Scroll horizontal (Single line)
lo: ເລື່ອນແນວນອນ (ແຖວດຽວ)

source: Scroll horizontal (Page)
lo: ເລື່ອນແນວນອນ (ໜ້າ)

source: Scroll horizontal (Half page)
lo: ເລື່ອນແນວນອນ (ເຄິ່ງໜ້າ)

source: Scroll horizontal (Page, less one line)
lo: ເລື່ອນແນວນອນ (ໜ້າ, ຫຼຸດໜຶ່ງແຖວ)

# lazarusidestrconsts.dlfmousesimplewheelnothing
source: Nothing/Default
lo: ບໍ່ມີຫຍັງ/ຄ່າເລີ່ມຕົ້ນ

source: Scroll (System speed)
lo: ເລື່ອນ (ຄວາມໄວລະບົບ)

source: Scroll (Single line)
lo: ເລື່ອນ (ແຖວດຽວ)

source: Scroll (Page)
lo: ເລື່ອນ (ໜ້າ)

source: Scroll (Half page)
lo: ເລື່ອນ (ເຄິ່ງໜ້າ)

source: Scroll (Page, less one line)
lo: ເລື່ອນ (ໜ້າ, ຫຼຸດໜຶ່ງແຖວ)

source: Zoom
lo: ຊູມ

source: < None >
lo: < ບໍ່ມີ >

# lazarusidestrconsts.dlfreadonlycolor
source: Read Only
lo: ອ່ານຢ່າງດຽວ

source: Lowercase, first letter up
lo: ຕົວພິມນ້ອຍ, ຕົວອັກສອນທຳອິດໃຫຍ່

source: active
lo: ເຮັດວຽກ

source: Add assignment operator :=
lo: ເພີ່ມຕົວດຳເນີນການກຳນົດຄ່າ :=

source: Brackets highlight
lo: ໄຮໄລ້ວົງເລັບ

source: Code folding tree
lo: ໂຄງສ້າງການຫຍໍ້ໂຄ້ດ

source: Code folding (current)
lo: ການຫຍໍ້ໂຄ້ດ (ປັດຈຸບັນ)

source: Custom %d
lo: ກຳນົດເອງ %d

source: Default Text
lo: ຂໍ້ຄວາມເລີ່ມຕົ້ນ

source: Default Text / Window
lo: ຂໍ້ຄວາມເລີ່ມຕົ້ນ / ປ່ອງຢ້ຽມ

source: Disabled breakpoint
lo: ຈຸດຢຸດທີ່ຖືກປິດໃຊ້ງານ

source: Enabled breakpoint
lo: ຈຸດຢຸດທີ່ເປີດໃຊ້ງານ

source: Error line
lo: ແຖວທີ່ມີຂໍ້ຜິດພາດ

source: Execution point
lo: ຈຸດປະຕິບັດການ

source: Folded code marker
lo: ເຄື່ອງໝາຍໂຄ້ດທີ່ຫຍໍ້ໄວ້

source: Fold start-line
lo: ແຖວເລີ່ມຕົ້ນການຫຍໍ້

# lazarusidestrconsts.dlgaddhiattrgroupdefault
source: Global
lo: ທົ່ວໄປ

# lazarusidestrconsts.dlgaddhiattrgroupgutter
source: Gutter
lo: ຂອບແຖວ

# lazarusidestrconsts.dlgaddhiattrgroupline
source: Line
lo: ແຖວ

source: Outline Colors
lo: ສີໂຄງຮ່າງ

source: Syncron Edit
lo: ແກ້ໄຂແບບ Syncron

source: Template Edit
lo: ແກ້ໄຂແມ່ແບບ

# lazarusidestrconsts.dlgaddhiattrgrouptext
source: Text
lo: ຂໍ້ຄວາມ

source: Wrapping
lo: ການຕັດແຖວ

source: Comments
lo: ຄຳອະທິບາຍ

source: Declaration Blocks
lo: ບລັອກການປະກາດ

source: Procedure Header
lo: ຫົວຂໍ້ໂປຣຊີເຢີ

source: (Custom)
lo: (ກຳນົດເອງ)

source: (entry type)
lo: (ປະເພດການປ້ອນຂໍ້ມູນ)

source: (Extended)
lo: (ຂະຫຍາຍ)

source: (Nested Brackets)
lo: (ວົງເລັບຊ້ອນກັນ)

source: Gutter Separator
lo: ຕົວແຍກຂອບແຖວ

source: Hide start-line
lo: ເຊື່ອງແຖວເລີ່ມຕົ້ນ

source: Incremental others
lo: ການເພີ່ມຂຶ້ນອື່ນໆ

# lazarusidestrconsts.dlgaddhiattrhighlightprefix
source: Highlight prefix
lo: ໄຮໄລ້ຄຳນຳໜ້າ

source: Highlight current word
lo: ໄຮໄລ້ຄຳປັດຈຸບັນ

source: Incremental search
lo: ຄົ້ນຫາແບບເພີ່ມຂຶ້ນ

source: Invalid breakpoint
lo: ຈຸດຢຸດທີ່ບໍ່ຖືກຕ້ອງ

source: Current line highlight
lo: ໄຮໄລ້ແຖວປັດຈຸບັນ

source: Line number
lo: ເລກແຖວ

source: Modified line
lo: ແຖວທີ່ຖືກແກ້ໄຂ

source: Mouse link
lo: ລິງກ໌ເມົ້າ

source: Nested bracket %d
lo: ວົງເລັບຊ້ອນກັນ %d

source: Level %s
lo: ລະດັບ %s

source: Recently used item
lo: ລາຍການທີ່ໃຊ້ບໍ່ດົນມານີ້

source: Selected Area
lo: ພື້ນທີ່ທີ່ເລືອກ

# lazarusidestrconsts.dlgaddhiattrsyncroeditcur
source: Active Cell
lo: ເຊລທີ່ເຄື່ອນໄຫວ

# lazarusidestrconsts.dlgaddhiattrsyncroeditother
source: Other Cells
lo: ເຊລອື່ນໆ

# lazarusidestrconsts.dlgaddhiattrsyncroeditsync
source: Syncronized Cells
lo: ເຊລທີ່ຊິງໂຄຣນກັນ

# lazarusidestrconsts.dlgaddhiattrtemplateeditcur
source: Active Cell
lo: ເຊລທີ່ເຄື່ອນໄຫວ

# lazarusidestrconsts.dlgaddhiattrtemplateeditother
source: Other Cells
lo: ເຊລອື່ນໆ

# lazarusidestrconsts.dlgaddhiattrtemplateeditsync
source: Syncronized Cells
lo: ເຊລທີ່ຊິງໂຄຣນກັນ

source: Selected text
lo: ຂໍ້ຄວາມທີ່ເລືອກ

source: Unknown breakpoint
lo: ຈຸດຢຸດທີ່ບໍ່ຮູ້ຈັກ

source: Window border
lo: ຂອບປ່ອງຢ້ຽມ

source: Word-Brackets
lo: ຄຳ-ວົງເລັບ

# lazarusidestrconsts.dlgaddhiattrwrapindent
source: Indent
lo: ຫຍໍ້ໜ້າ

# lazarusidestrconsts.dlgaddhiattrwrapsubline
source: Sub-line
lo: ແຖວຍ່ອຍ

source: Visualized Special Chars
lo: ຕົວອັກສອນພິເສດທີ່ສະແດງ

source: Add new mode
lo: ເພີ່ມໂຫມດໃໝ່

source: Add semicolon
lo: ເພີ່ມຈຸດຈຸດ

source: Adjust top line due to comment in front
lo: ປັບແຖວເທິງເນື່ອງຈາກຄຳອະທິບາຍຢູ່ທາງໜ້າ

source: Alphabetically
lo: ຕາມລຳດັບຕົວອັກສອນ

source: Always keep caret in visible area of editor
lo: ຮັກສາຕົວຊີ້ພິມໄວ້ໃນພື້ນທີ່ທີ່ເບິ່ງເຫັນຂອງບັນນາທິການສະເໝີ

source: Ambiguous file action:
lo: ການກະທຳຂອງໄຟລ໌ທີ່ບໍ່ຊັດເຈນ:

source: Warn on compile
lo: ແຈ້ງເຕືອນເມື່ອຄອມໄພລ໌

source: An icon for error/warning/hint is shown in front of a message. The same icon shows in source editor gutter in any case.
lo: ໄອຄອນສຳລັບຂໍ້ຜິດພາດ/ຄຳເຕືອນ/ຄຳແນະນຳ ຈະສະແດງຢູ່ທາງໜ້າຂອງຂໍ້ຄວາມ. ໄອຄອນດຽວກັນຈະສະແດງໃນຂອບແຖວຂອງບັນນາທິການຊອດໂຄ້ດໃນທຸກກໍລະນີ.

source: Application settings
lo: ການຕັ້ງຄ່າແອັບພລິເຄຊັນ

source: Include assertion code
lo: ລວມເອົາໂຄ້ດ assertion

source: Associated debug desktop for "%s"
lo: ເດັສທັອບດີບັກທີ່ກ່ຽວຂ້ອງສຳລັບ "%s"

source: If you select the desktop, the associated debug desktop will be selected as well.
lo: ຖ້າທ່ານເລືອກເດັສທັອບ, ເດັສທັອບດີບັກທີ່ກ່ຽວຂ້ອງຈະຖືກເລືອກເຊັ່ນກັນ.

source: Auto-create forms:
lo: ສ້າງຟອມອັດຕະໂນມັດ:

source: Main .lpr unit creates each form with Application.CreateForm(). They are also freed automatically.
lo: ຢູນິດ .lpr ຫຼັກຈະສ້າງແຕ່ລະຟອມດ້ວຍ Application.CreateForm(). ພວກມັນຈະຖືກປ່ອຍ (freed) ໂດຍອັດຕະໂນມັດເຊັ່ນກັນ.

source: Auto-create new forms
lo: ສ້າງຟອມໃໝ່ອັດຕະໂນມັດ

source: Auto delete file
lo: ລຶບໄຟລ໌ອັດຕະໂນມັດ

source: Auto Display Function Prototypes
lo: ສະແດງຕົ້ນແບບຟັງຊັນອັດຕະໂນມັດ

source: Hide mouse pointer when typing
lo: ເຊື່ອງຕົວຊີ້ເມົ້າເມື່ອພິມ

# lazarusidestrconsts.dlgautoindent
source: Auto indent
lo: ຫຍໍ້ໜ້າອັດຕະໂນມັດ

source: (Set up smart indent)
lo: (ຕັ້ງຄ່າການຫຍໍ້ໜ້າອັດສະລິຍະ)

source: Auto remove empty methods
lo: ລຶບ method ທີ່ຫວ່າງເປົ່າອັດຕະໂນມັດ

source: Auto rename file lowercase
lo: ປ່ຽນຊື່ໄຟລ໌ເປັນຕົວພິມນ້ອຍອັດຕະໂນມັດ

source: Auto save active desktop
lo: ບັນທຶກເດັສທັອບທີ່ໃຊ້ງານອັດຕະໂນມັດ

source: Save active desktop on IDE close Save debug desktop on IDE close and debug end
lo: ບັນທຶກເດັສທັອບທີ່ໃຊ້ງານເມື່ອປິດ IDE ບັນທຶກເດັສທັອບດີບັກເມື່ອປິດ IDE ແລະ ຈົບການດີບັກ

source: Available forms:
lo: ຟອມທີ່ມີຢູ່:

source: These forms must be created and freed in the program code.
lo: ຟອມເຫຼົ່ານີ້ຕ້ອງຖືກສ້າງ ແລະ ປ່ອຍ (freed) ໃນໂຄ້ດໂປຣແກຣມ.

source: Avoid unnecessary jumps
lo: ຫຼີກເວັ້ນການໂດດທີ່ບໍ່ຈຳເປັນ

source: Background
lo: ພື້ນຫຼັງ

source: (no subdirectory)
lo: (ບໍ່ມີໂຟນເດີຍ່ອຍ)

source: Same name (in subdirectory)
lo: ຊື່ດຽວກັນ (ໃນໂຟນເດີຍ່ອຍ)

source: Behind methods
lo: ທາງຫຼັງ method

# lazarusidestrconsts.dlgblockgroupoptions
source: Selection
lo: ການເລືອກ

source: Block indent
lo: ການຫຍໍ້ໜ້າບລັອກ

source: (edit keys)
lo: (ແກ້ໄຂປຸ່ມ)

source: Amount of spaces
lo: ຈຳນວນຍະຫວ່າງ

source: Amount of tabs (tab stops)
lo: ຈຳນວນແຖບ (ຈຸດຢຸດແຖບ)

source: Amount of spaces (tab stops)
lo: ຈຳນວນຍະຫວ່າງ (ຈຸດຢຸດແຖບ)

source: Space/tab as prev Line
lo: ຍະຫວ່າງ/ແຖບ ຕາມແຖວກ່ອນໜ້າ

source: Position only
lo: ຕຳແໜ່ງເທົ່ານັ້ນ

source: Spaces
lo: ຍະຫວ່າງ

source: Tabs, cut off
lo: ແຖບ, ຕັດອອກ

source: Tabs, then spaces
lo: ແຖບ, ຈາກນັ້ນຍະຫວ່າງ

source: Restore scroll position for bookmarks
lo: ຄືນຄ່າຕຳແໜ່ງການເລື່ອນສຳລັບບຸກມາກ

source: Border space can be set in Anchor editor. A colored line is shown if spacing > 0.
lo: ໄລຍະຫ່າງຂອບສາມາດຕັ້ງຄ່າໄດ້ໃນ Anchor editor. ເສັ້ນສີຈະສະແດງຂຶ້ນຖ້າໄລຍະຫ່າງ > 0.

source: BorderSpacing frame
lo: ຂອບ BorderSpacing

source: Bracket highlight
lo: ໄຮໄລ້ວົງເລັບ

source: Matching bracket and quote pairs
lo: ຈັບຄູ່ວົງເລັບ ແລະ ເຄື່ອງໝາຍວົງຢືມ

source: You cannot use docked desktop in undocked environment and vice versa.
lo: ທ່ານບໍ່ສາມາດໃຊ້ເດັສທັອບແບບ docked ໃນສະພາບແວດລ້ອມ undocked ແລະ ກົງກັນຂ້າມ.

source: Secondary carets (multi-caret mode)
lo: ຕົວຊີ້ພິມສຳຮອງ (ໂຫມດຫຼາຍຕົວຊີ້)

# lazarusidestrconsts.dlgcaretcolor
source: Caret (Text-Cursor)
lo: ຕົວຊີ້ພິມ (Text-Cursor)

source: The caret color depends on the colors of text and background under the caret. Each pixel's RGB are bitwise inverted and XOR'ed with the chosen color's RGB.
lo: ສີຂອງຕົວຊີ້ພິມຂຶ້ນກັບສີຂອງຂໍ້ຄວາມ ແລະ ພື້ນຫຼັງພາຍໃຕ້ຕົວຊີ້. RGB ຂອງແຕ່ລະພິກເຊວຈະຖືກ inverted ແລະ XOR ກັບ RGB ຂອງສີທີ່ເລືອກ.

source: Main or primary caret
lo: ຕົວຊີ້ພິມຫຼັກ

source: Caret (Text Cursor)
lo: ຕົວຊີ້ພິມ (Text Cursor)

source: Caret (Text Cursor) past end of line
lo: ຕົວຊີ້ພິມ (Text Cursor) ກາຍຈົບແຖວ

# lazarusidestrconsts.dlgcasesensitive
source: &Case sensitive
lo: &ຕົວພິມນ້ອຍ/ໃຫຍ່ມີຜົນ

source: Checking compiler options
lo: ກຳລັງກວດສອບຕົວເລືອກຄອມໄພເລີ

source: orphaned file found: %s
lo: ພົບໄຟລ໌ກຳພ້າ: %s

source: Results
lo: ຜົນລຶບ

# lazarusidestrconsts.dlgccotest
source: Test
lo: ທົດສອບ

source: Test: Checking compiler ...
lo: ທົດສອບ: ກຳລັງກວດສອບຄອມໄພເລີ ...

source: Test: Checking compiler configuration ...
lo: ທົດສອບ: ກຳລັງກວດສອບການຕັ້ງຄ່າຄອມໄພເລີ ...

source: Test: Checking compiler date ...
lo: ທົດສອບ: ກຳລັງກວດສອບວັນທີຄອມໄພເລີ ...

source: Test: Compiling an empty file ...
lo: ທົດສອບ: ກຳລັງຄອມໄພລ໌ໄຟລ໌ເປົ່າ ...

source: Test: Checking RTL units ...
lo: ທົດສອບ: ກຳລັງກວດສອບ RTL units ...

source: Test: Checking sources in fpc ppu search paths ...
lo: ທົດສອບ: ກຳລັງກວດສອບຊອດໂຄ້ດໃນເສັ້ນທາງຄົ້ນຫາ fpc ppu ...

source: Test: Compiling an empty file
lo: ທົດສອບ: ກຳລັງຄອມໄພລ໌ໄຟລ໌ເປົ່າ

source: using config file %s
lo: ໂດຍໃຊ້ໄຟລ໌ config %s

source: Class order
lo: ລຳດັບຄລາສ

source: Last
lo: ສຸດທ້າຍ

source: lowercase
lo: ຕົວພິມນ້ອຍ

source: Preview (max line length = 1)
lo: ຕົວຢ່າງ (ຄວາມຍາວແຖວສູງສຸດ = 1)

source: Read prefix
lo: ຄຳນຳໜ້າ Read

source: Stored postfix
lo: ຄຳຕໍ່ທ້າຍ Stored

source: UPPERCASE
lo: ຕົວພິມໃຫຍ່

source: Variable prefix
lo: ຄຳນຳໜ້າຕົວປ່ຽນ

source: Write prefix
lo: ຄຳນຳໜ້າ Write

source: Save As - auto rename Pascal files lower case
lo: ບັນທຶກເປັນ - ປ່ຽນຊື່ໄຟລ໌ Pascal ເປັນຕົວພິມນ້ອຍອັດຕະໂນມັດ

source: Check and Auto Save Files
lo: ກວດສອບ ແລະ ບັນທຶກໄຟລ໌ອັດຕະໂນມັດ

source: Check packages on form create
lo: ກວດສອບແພັກເກັດເມື່ອສ້າງຟອມ

source: The form may require a package to work. Install such a package automatically.
lo: ຟອມອາດຈະຕ້ອງການແພັກເກັດເພື່ອເຮັດວຽກ. ຕິດຕັ້ງແພັກເກັດດັ່ງກ່າວໂດຍອັດຕະໂນມັດ.

source: Choose code template file (*.dci)
lo: ເລືອກໄຟລ໌ແມ່ແບບໂຄ້ດ (*.dci)

source: Show close buttons in notebook
lo: ສະແດງປຸ່ມປິດໃນ notebook

source: Color Scheme
lo: ຊຸດສີ

source: C style macros (global)
lo: ມາກໂຄຣແບບ C (ທົ່ວໄປ)

# lazarusidestrconsts.dlgcoansistr
source: Use Ansistrings
lo: ໃຊ້ Ansistrings

source: Assembler style
lo: ຮູບແບບ Assembler

# lazarusidestrconsts.dlgcocfgcmpmessages
source: Messages
lo: ຂໍ້ຄວາມ

source: Checks and assertion
lo: ການກວດສອບ ແລະ assertion

source: Compiler Commands
lo: ຄຳສັ່ງຄອມໄພເລີ

source: C style operators (*=, +=, /= and -=)
lo: ຕົວດຳເນີນການແບບ C (*=, +=, /= ແລະ -=)

# lazarusidestrconsts.dlgcocreatemakefile
source: Create Makefile
lo: ສ້າງ Makefile

# lazarusidestrconsts.dlgcodebugging
source: Debugging
lo: ການດີບັກ

source: Debugger path addition (none):
lo: ການເພີ່ມເສັ້ນທາງ Debugger (ບໍ່ມີ):

source: Code Creation
lo: ການສ້າງໂຄ້ດ

source: Both
lo: ທັງສອງ

source: Fold
lo: ຫຍໍ້

source: Hide
lo: ເຊື່ອງ

source: Reverse fold-order in Popup
lo: ກັບດ້ານລຳດັບການຫຍໍ້ໃນ Popup

source: Generate info for the debugger (slower / increases exe-size)
lo: ສ້າງຂໍ້ມູນສຳລັບ debugger (ຊ້າລົງ / ເພີ່ມຂະໜາດ exe)

source: Use Heaptrc unit (check for mem-leaks)
lo: ໃຊ້ Heaptrc unit (ກວດສອບ mem-leaks)

source: Include files (-Fi):
lo: ໄຟລ໌ Include (-Fi):

source: Debugger info
lo: ຂໍ້ມູນ Debugger

source: Libraries (-Fl):
lo: ໄລບຣາຣີ (-Fl):

source: Linking
lo: ການເຊື່ອມຕໍ່

# lazarusidestrconsts.dlgcoloadsavehint
source: Compiler options can be saved to an XML file.
lo: ຕົວເລືອກຄອມໄພເລີສາມາດບັນທຶກເປັນໄຟລ໌ XML ໄດ້.

source: Extend past EOL
lo: ຂະຫຍາຍກາຍ EOL

source: (Edit Color)
lo: (ແກ້ໄຂສີ)

source: Not modified
lo: ບໍ່ໄດ້ແກ້ໄຂ

# lazarusidestrconsts.dlgcolors
source: Colors
lo: ສີ

source: TML Setup
lo: ການຕັ້ງຄ່າ TML

source: Sample text file not found: %1:s
lo: ບໍ່ພົບໄຟລ໌ຂໍ້ຄວາມຕົວຢ່າງ: %1:s

source: Error:
lo: ຂໍ້ຜິດພາດ:

source: File:
lo: ໄຟລ໌:

source: Below is a list of Highlighter (Textmate) found in the folder %1:s.%0:sThis list may include files with errors and files not yet active in the IDE.%0:sTo activate newly added/changed files restart the IDE.%0:sThe "Reload" button will update the list below, checking if any errors were fixed.
lo: ຂ້າງລຸ່ມນີ້ແມ່ນລາຍຊື່ຂອງ Highlighter (Textmate) ທີ່ພົບໃນໂຟນເດີ %1:s.%0:sລາຍຊື່ນີ້ອາດລວມມີໄຟລ໌ທີ່ມີຂໍ້ຜິດພາດ ແລະ ໄຟລ໌ທີ່ຍັງບໍ່ທັນເປີດໃຊ້ງານໃນ IDE.%0:sເພື່ອເປີດໃຊ້ງານໄຟລ໌ທີ່ເພີ່ມ/ປ່ຽນແປງໃໝ່ ໃຫ້ຣີສະຕາດ IDE.%0:sປຸ່ມ "ໂຫຼດໃໝ່" ຈະອັບເດດລາຍຊື່ຂ້າງລຸ່ມນີ້, ໂດຍກວດສອບວ່າຂໍ້ຜິດພາດໃດໜຶ່ງຖືກແກ້ໄຂແລ້ວຫຼືບໍ່.

source: Did not find all includes: %1:s
lo: ບໍ່ພົບ include ທັງໝົດ: %1:s

source: No files found.
lo: ບໍ່ພົບໄຟລ໌.

source: No sample text configured
lo: ບໍ່ມີຂໍ້ຄວາມຕົວຢ່າງທີ່ຕັ້ງຄ່າໄວ້

source: OK
lo: ຕົກລົງ

source: Reload
lo: ໂຫຼດໃໝ່

source: Command line parameters (without application name)
lo: ພາລາມິເຕີຄຳສັ່ງ (ໂດຍບໍ່ມີຊື່ແອັບພລິເຄຊັນ)

source: Max indent for new line if prefix is based on start of comment on first comment line:
lo: ການຫຍໍ້ໜ້າສູງສຸດສຳລັບແຖວໃໝ່ ຖ້າຄຳນຳໜ້າອີງໃສ່ຈຸດເລີ່ມຕົ້ນຂອງຄຳອະທິບາຍໃນແຖວຄຳອະທິບາຍທຳອິດ:

source: Limit indent to
lo: ຈຳກັດການຫຍໍ້ໜ້າທີ່

source: Prefix comments on linebreak
lo: ໃສ່ຄຳນຳໜ້າຄຳອະທິບາຍເມື່ອຂຶ້ນແຖວໃໝ່

source: Match current line
lo: ກົງກັບແຖວປັດຈຸບັນ

source: Match text including "*" of token "(*"
lo: ກົງກັບຂໍ້ຄວາມລວມທັງ "*" ຂອງ token "(*"

source: Match whole line
lo: ກົງກັບທັງແຖວ

source: Match text after token "%s"
lo: ກົງກັບຂໍ້ຄວາມຫຼັງ token "%s"

source: Match text including token "%s"
lo: ກົງກັບຂໍ້ຄວາມລວມທັງ token "%s"

source: Prefix new line
lo: ຄຳນຳໜ້າແຖວໃໝ່

source: Align Prefix at indent of previous line
lo: ຈັດຄຳນຳໜ້າໃຫ້ກົງກັບການຫຍໍ້ໜ້າຂອງແຖວກ່ອນໜ້າ

source: Align Prefix below start of comment on first comment line
lo: ຈັດຄຳນຳໜ້າໃຫ້ຢູ່ກ້ອງຈຸດເລີ່ມຕົ້ນຂອງຄຳອະທິບາຍໃນແຖວຄຳອະທິບາຍທຳອິດ

source: Do not indent prefix
lo: ບໍ່ຕ້ອງຫຍໍ້ໜ້າຄຳນຳໜ້າ

source: Comments and Strings
lo: ຄຳອະທິບາຍ ແລະ ສະຕຣິງ

source: Extend if matched or not matched
lo: ຂະຫຍາຍ ບໍ່ວ່າຈະກົງກັນ ຫຼື ບໍ່

source: Extend if matched or not matched (not at EOL)
lo: ຂະຫຍາຍ ບໍ່ວ່າຈະກົງກັນ ຫຼື ບໍ່ (ບໍ່ແມ່ນທີ່ EOL)

source: Extend if matched
lo: ຂະຫຍາຍ ຖ້າກົງກັນ

source: Extend if matched and caret in the middle of text (not at EOL)
lo: ຂະຫຍາຍ ຖ້າກົງກັນ ແລະ ຕົວຊີ້ພິມຢູ່ກາງຂໍ້ຄວາມ (ບໍ່ແມ່ນທີ່ EOL)

source: Compilation and Linking
lo: ການຄອມໄພລ໌ ແລະ ການເຊື່ອມຕໍ່

source: Compiler messages
lo: ຂໍ້ຄວາມຄອມໄພເລີ

source: Compiler messages language file (*.msg)
lo: ໄຟລ໌ພາສາຂໍ້ຄວາມຄອມໄພເລີ (*.msg)

source: Complete properties
lo: ຄຸນສົມບັດສົມບູນ

source: Component under mouse cursor is first selected, then the popup menu commands work on it.
lo: ອົງປະກອບທີ່ຢູ່ໃຕ້ຕົວຊີ້ເມົ້າຈະຖືກເລືອກກ່ອນ, ຈາກນັ້ນຄຳສັ່ງເມນູ popup ຈະເຮັດວຽກກັບມັນ.

source: Config and Target
lo: ການຕັ້ງຄ່າ ແລະ ເປົ້າໝາຍ

source: Config files
lo: ໄຟລ໌ Config

source: Current debugger does not support this.
lo: Debugger ປັດຈຸບັນບໍ່ຮອງຮັບສິ່ງນີ້.

source: Other debugging info
lo: ຂໍ້ມູນການດີບັກອື່ນໆ

source: Overflow
lo: ລົ້ນ (Overflow)

source: Parsing
lo: ການ Parsing

source: Copy/Paste with fold info
lo: ສຳເນົາ/ວາງ ພ້ອມຂໍ້ມູນການຫຍໍ້

source: Copy current word when no selection exists
lo: ສຳເນົາຄຳປັດຈຸບັນເມື່ອບໍ່ມີການເລືອກ

# lazarusidestrconsts.dlgcorange
source: Range
lo: ຊ່ວງ

source: Relocatable
lo: ສາມາດຍ້າຍໄດ້ (Relocatable)

source: Set compiler options as default
lo: ຕັ້ງຄ່າຕົວເລືອກຄອມໄພເລີເປັນຄ່າເລີ່ມຕົ້ນ

source: &Show Options
lo: &ສະແດງຕົວເລືອກ

source: Other sources (.pp/.pas files, used only by IDE not by compiler)
lo: ຊອດໂຄ້ດອື່ນໆ (ໄຟລ໌ .pp/.pas, ໃຊ້ໂດຍ IDE ເທົ່ານັ້ນ ບໍ່ແມ່ນໂດຍຄອມໄພເລີ)

source: Strip symbols from executable
lo: ຕັດ symbols ອອກຈາກ executable

source: Type of debug info
lo: ປະເພດຂອງຂໍ້ມູນດີບັກ

# lazarusidestrconsts.dlgcosymboltypeauto
source: Automatic
lo: ອັດຕະໂນມັດ

source: Unit style
lo: ຮູບແບບ Unit

source: Generate code for valgrind
lo: ສ້າງໂຄ້ດສຳລັບ valgrind

source: Verbosity
lo: ຄວາມລະອຽດຂອງຂໍ້ຄວາມ

source: C++ styled INLINE
lo: INLINE ແບບ C++

source: Create new Run Parameters settings
lo: ສ້າງການຕັ້ງຄ່າ Run Parameters ໃໝ່

source: Curly { }
lo: ປີກກາ { }

source: Currently respected by messages window, jump history and search results.
lo: ປັດຈຸບັນມີຜົນກັບປ່ອງຢ້ຽມຂໍ້ຄວາມ, ປະຫວັດການໂດດ ແລະ ຜົນການຄົ້ນຫາ.

source: Cursor beyond EOL
lo: ເຄີເຊີກາຍ EOL

source: Caret left/right clears selection (no move)
lo: ຕົວຊີ້ພິມ ຊ້າຍ/ຂວາ ລ້າງການເລືອກ (ບໍ່ຍ້າຍ)

source: Caret skips selection
lo: ຕົວຊີ້ພິມຂ້າມການເລືອກ

source: Caret skips tabs
lo: ຕົວຊີ້ພິມຂ້າມແຖບ

source: User defined extension (.pp.xxx)
lo: ນາມສະກຸນທີ່ຜູ້ໃຊ້ກຳນົດ (.pp.xxx)

source: debug
lo: ດີບັກ

source: Path Editor
lo: ຕົວແກ້ໄຂເສັ້ນທາງ

source: Debugger type and path
lo: ປະເພດ ແລະ ເສັ້ນທາງ Debugger

source: Default editor font
lo: ຟອນບັນນາທິການເລີ່ມຕົ້ນ

source: Default tab font
lo: ຟອນແຖບເລີ່ມຕົ້ນ

source: Default Window/Console position and size
lo: ຕຳແໜ່ງ ແລະ ຂະໜາດ ປ່ອງຢ້ຽມ/ຄອນໂຊນ ເລີ່ມຕົ້ນ

source: Default Value
lo: ຄ່າເລີ່ມຕົ້ນ

source: Delete mode
lo: ໂຫມດລຶບ

# lazarusidestrconsts.dlgdeleteselecteddesktopbtncaption
source: Delete
lo: ລຶບ

source: Delete selected desktop
lo: ລຶບເດັສທັອບທີ່ເລືອກ

source: Delete template
lo: ລຶບແມ່ແບບ

source: Buttons -
lo: ປຸ່ມ -

source: Hints
lo: ຄຳແນະນຳ

source: Menus -
lo: ເມນູ -

source: Desktop name
lo: ຊື່ເດັສທັອບ

source: %d desktop(s) successfully exported to "%s"
lo: ສົ່ງອອກ %d ເດັສທັອບໄປຍັງ "%s" ສຳເລັດ

source: %d desktop(s) successfully imported from "%s"
lo: ນຳເຂົ້າ %d ເດັສທັອບຈາກ "%s" ສຳເລັດ

source: Different values background
lo: ພື້ນຫຼັງຄ່າທີ່ແຕກຕ່າງ

source: Direction
lo: ທິດທາງ

source: Disable anti-aliasing
lo: ປິດ anti-aliasing

source: Distance between grid points is the smallest step when moving a control.
lo: ໄລຍະຫ່າງລະຫວ່າງຈຸດຕາຕະລາງແມ່ນຂັ້ນຕອນທີ່ນ້ອຍທີ່ສຸດເມື່ອຍ້າຍ control.

source: Use right margin color
lo: ໃຊ້ສີຂອບຂວາ

source: Draw divider level
lo: ແຕ້ມລະດັບຕົວແບ່ງ

source: Nested line color
lo: ສີເສັ້ນຊ້ອນ

source: Line color
lo: ສີເສັ້ນ

source: Draw the component's name below it.
lo: ແຕ້ມຊື່ອົງປະກອບໄວ້ທາງລຸ່ມມັນ.

source: Back
lo: ກັບຄືນ

source: Bold
lo: ຕົວໜາ

source: Sub directory
lo: ໂຟນເດີຍ່ອຍ
