Repository: fpc/Lazarus
Catalog: languages/lazaruside.*.po
Languages: lo

source: Change Class ...
lo: ປ່ຽນ Class ...

# lazarusidestrconsts.lisdlgedit
source: Edit ...
lo: ແກ້ໄຂ ...

# lazarusidestrconsts.lisdlgexport
source: Export ...
lo: ສົ່ງອອກ ...

# lazarusidestrconsts.lisdlgimport
source: Import ...
lo: ນຳເຂົ້າ ...

# lazarusidestrconsts.lisdlgopen
source: Open ...
lo: ເປີດ ...

source: %s does not exist: %s
lo: %s ບໍ່ມີຢູ່: %s

source: Do not change
lo: ບໍ່ຕ້ອງປ່ຽນ

source: Do not check if another IDE instance is already running.
lo: ບໍ່ຕ້ອງກວດສອບວ່າ IDE ອື່ນກຳລັງເຮັດວຽກຢູ່.

source: Do not close the project
lo: ບໍ່ຕ້ອງປິດໂປຣເຈັກ

source: Do not compile dependencies.
lo: ບໍ່ຕ້ອງ compile dependencies.

source: Do not show splash screen.
lo: ບໍ່ຕ້ອງສະແດງໜ້າຈໍ Splash.

source: Do not show this dialog for this project
lo: ບໍ່ຕ້ອງສະແດງກ່ອງໂຕ້ຕອບນີ້ສຳລັບໂປຣເຈັກນີ້

source: Do not show this message again
lo: ບໍ່ຕ້ອງສະແດງຂໍ້ຄວາມນີ້ອີກ

source: Do not write updated project info file after build. If not specified, build number will be incremented if configured.
lo: ບໍ່ຕ້ອງຂຽນໄຟລ໌ຂໍ້ມູນໂປຣເຈັກທີ່ອັບເດດແລ້ວຫຼັງຈາກ build. ຖ້າບໍ່ລະບຸ, ເລກ build ຈະເພີ່ມຂຶ້ນຫາກຕັ້ງຄ່າໄວ້.

source: The following package(s) are not available locally: %s. In order to install it, you must download them first. Download now?
lo: ແພັກເກັດຕໍ່ໄປນີ້ບໍ່ມີໃນເຄື່ອງ: %s. ເພື່ອຕິດຕັ້ງມັນ, ເຈົ້າຕ້ອງດາວໂຫຼດພວກມັນກ່ອນ. ດາວໂຫຼດດຽວນີ້ເລີຍບໍ່?

# lazarusidestrconsts.lisdown
source: Down
lo: ລົງ

source: Downgrade configuration
lo: Downgrade ການຕັ້ງຄ່າ

source: Download
lo: ດາວໂຫຼດ

source: Do you still want to create the new project?
lo: ເຈົ້າຍັງຕ້ອງການສ້າງໂປຣເຈັກໃໝ່ບໍ່?

source: Do you still want to open another project?
lo: ເຈົ້າຍັງຕ້ອງການເປີດໂປຣເຈັກອື່ນບໍ່?

source: Do you still want to quit?
lo: ເຈົ້າຍັງຕ້ອງການອອກບໍ່?

source: Draw grid lines
lo: ແຕ້ມເສັ້ນຕາຕະລາງ

source: Draw the selection focused even if the Messages window has no focus. Use this if your theme has a hardly visible unfocused drawing.
lo: ແຕ້ມສ່ວນທີ່ເລືອກຄືກັບວ່າຖືກໂຟກັດ ເຖິງແມ່ນວ່າໜ້າຕ່າງ Messages ຈະບໍ່ໄດ້ໂຟກັດກໍຕາມ. ໃຊ້ອັນນີ້ຫາກ Theme ຂອງເຈົ້າເບິ່ງຍາກເມື່ອບໍ່ໄດ້ໂຟກັດ.

source: Drop Down Count
lo: ຈຳນວນ Drop Down

source: Used for all ComboBoxes in IDE dialogs
lo: ໃຊ້ສຳລັບ ComboBoxes ທັງໝົດໃນກ່ອງໂຕ້ຕອບ IDE

source: Copy selected components to clipboard
lo: ສຳເນົາ component ທີ່ເລືອກໄປຍັງ clipboard

source: Cut selected components to clipboard
lo: ຕັດ component ທີ່ເລືອກໄປຍັງ clipboard

source: Move component one back
lo: ຍ້າຍ component ກັບຫຼັງໜຶ່ງຂັ້ນ

source: Move component one forward
lo: ຍ້າຍ component ໄປໜ້າໜຶ່ງຂັ້ນ

source: Move component to back
lo: ຍ້າຍ component ໄປທາງຫຼັງສຸດ

source: Move component to front
lo: ຍ້າຍ component ມາທາງໜ້າສຸດ

source: Paste selected components from clipboard
lo: ວາງ component ທີ່ເລືອກຈາກ clipboard

source: Select parent component
lo: ເລືອກ component ແມ່ (Parent)

source: Show nonvisual components
lo: ສະແດງ component ທີ່ບໍ່ມີຮູບພາບ

source: Toggle showing nonvisual components
lo: ເປີດ/ປິດ ການສະແດງ component ທີ່ບໍ່ມີຮູບພາບ

source: Duplicate
lo: ເຮັດຊ້ຳ

source: Duplicate File Name
lo: ຊື່ໄຟລ໌ຊ້ຳກັນ

source: Duplicate found of value "%s".
lo: ພົບຄ່າຊ້ຳກັນຂອງ "%s".

source: Mode "%s" is already present in the list.
lo: ໂໝດ "%s" ມີຢູ່ໃນລາຍການແລ້ວ.

source: Duplicate Name
lo: ຊື່ຊ້ຳກັນ

source: Duplicate name: A component named "%s" already exists in the inherited component %s
lo: ຊື່ຊ້ຳກັນ: component ທີ່ຊື່ "%s" ມີຢູ່ແລ້ວໃນ inherited component %s

source: Duplicate ppu files. Delete one or make sure all search paths have correct order (Hint: FPC uses last path first).
lo: ໄຟລ໌ ppu ຊ້ຳກັນ. ລົບອັນໜຶ່ງອອກ ຫຼື ກວດສອບວ່າ search paths ມີລຳດັບທີ່ຖືກຕ້ອງ (ຄຳແນະນຳ: FPC ໃຊ້ path ສຸດທ້າຍກ່ອນ).

source: Duplicate search path
lo: Search path ຊ້ຳກັນ

source: Duplicate sources. Delete one or make sure all search paths have correct order (Hint: FPC uses last path first).
lo: Source ຊ້ຳກັນ. ລົບອັນໜຶ່ງອອກ ຫຼື ກວດສອບວ່າ search paths ມີລຳດັບທີ່ຖືກຕ້ອງ (ຄຳແນະນຳ: FPC ໃຊ້ path ສຸດທ້າຍກ່ອນ).

source: Duplicate Unit
lo: Unit ຊ້ຳກັນ

source: Duplicate unit "%s" in "%s"
lo: Unit ຊ້ຳກັນ "%s" ໃນ "%s"

source: Amount to scroll in
lo: ຈຳນວນທີ່ຈະເລື່ອນເຂົ້າ

source: Amount to scroll in (%)
lo: ຈຳນວນທີ່ຈະເລື່ອນເຂົ້າ (%)

source: Amount to scroll in (Max)
lo: ຈຳນວນທີ່ຈະເລື່ອນເຂົ້າ (ສູງສຸດ)

source: Auto Scroll on delete past left border
lo: ເລື່ອນອັດຕະໂນມັດເມື່ອລົບກາຍຂອບຊ້າຍ

source: Auto Scroll on type past right border
lo: ເລື່ອນອັດຕະໂນມັດເມື່ອພິມກາຍຂອບຂວາ

source: Trigger on min chars (% of width)
lo: ທຣິກເກີເມື່ອມີຕົວອັກສອນຂັ້ນຕ່ຳ (% ຂອງຄວາມກວ້າງ)

source: Trigger on min chars visible
lo: ທຣິກເກີເມື່ອມີຕົວອັກສອນຂັ້ນຕ່ຳທີ່ເບິ່ງເຫັນ

# lazarusidestrconsts.lisedit
source: Edit
lo: ແກ້ໄຂ

source: Edit additional help for messages
lo: ແກ້ໄຂຄວາມຊ່ວຍເຫຼືອເພີ່ມເຕີມສຳລັບຂໍ້ຄວາມ

source: Edit build modes
lo: ແກ້ໄຂ Build modes

source: Edit context help
lo: ແກ້ໄຂ Context help

source: Edit help
lo: ແກ້ໄຂ Help

source: Edit Key
lo: ແກ້ໄຂ Key

source: Editor Colors
lo: ສີຂອງຕົວແກ້ໄຂ

source: Editor Toolbar Settings
lo: ການຕັ້ງຄ່າ Editor Toolbar

source: Editor Toolbar is &visible
lo: ສະແດງ Editor Toolbar

source: Load a scheme
lo: ໂຫຼດ Scheme

source: Current Project
lo: ໂປຣເຈັກປັດຈຸບັນ

source: A valid tool needs at least a title and a filename.
lo: ເຄື່ອງມືທີ່ຖືກຕ້ອງຕ້ອງການຫົວຂໍ້ ແລະ ຊື່ໄຟລ໌ເປັນຢ່າງໜ້ອຍ.

source: Edit Tool
lo: ແກ້ໄຂເຄື່ອງມື

# lazarusidestrconsts.lisedtexttoolkey
source: Key
lo: ປຸ່ມ

source: Program Filename:
lo: ຊື່ໄຟລ໌ໂປຣແກຣມ:

source: Title and Filename required
lo: ຕ້ອງການຫົວຂໍ້ ແລະ ຊື່ໄຟລ໌

source: Working Directory:
lo: ໄດເຣັກທໍຣີເຮັດວຽກ:

source: Elevate the message priority to always show it (by default it has low priority "verbose")
lo: ຍົກລະດັບຄວາມສຳຄັນຂອງຂໍ້ຄວາມເພື່ອສະແດງສະເໝີ (ໂດຍປົກກະຕິມັນມີຄວາມສຳຄັນຕ່ຳ "verbose")

# lazarusidestrconsts.lisemdall
source: All
lo: ທັງໝົດ

# lazarusidestrconsts.lisemdemptymethods
source: Empty Methods
lo: Method ທີ່ຫວ່າງ

source: Found empty methods:
lo: ພົບ method ທີ່ຫວ່າງ:

source: No class
lo: ບໍ່ມີ Class

source: No class at %s(%s,%s)
lo: ບໍ່ມີ Class ທີ່ %s(%s,%s)

source: Only published
lo: ສະເພາະ Published

source: Remove methods
lo: ລົບ method

source: Search in these class sections:
lo: ຄົ້ນຫາໃນສ່ວນ Class ເຫຼົ່ານີ້:

source: Unable to show empty methods of the current class, because%s%s
lo: ບໍ່ສາມາດສະແດງ method ທີ່ຫວ່າງຂອງ Class ປັດຈຸບັນໄດ້, ເພາະວ່າ%s%s

source: Empty
lo: ຫວ່າງ

source: Destination directory for publishing is either a relative path or empty.
lo: ໄດເຣັກທໍຣີປາຍທາງສຳລັບການ Publish ເປັນ relative path ຫຼື ຫວ່າງເປົ່າ.

source: Enabled only for packages.
lo: ເປີດໃຊ້ງານສະເພາະແພັກເກັດເທົ່ານັ້ນ.

source: . Enable flag "Use Unit" of unit %s in package %s
lo: . ເປີດໃຊ້ງານທຸງ "Use Unit" ຂອງ unit %s ໃນແພັກເກັດ %s

source: Enable I18N for LFM
lo: ເປີດໃຊ້ງານ I18N ສຳລັບ LFM

source: Enable internationalization and translation support
lo: ເປີດໃຊ້ງານການຮອງຮັບພາສາສາກົນ ແລະ ການແປ

source: Enable Macros
lo: ເປີດໃຊ້ງານ Macros

source: Enable Dwarf 2 (-gw)
lo: ເປີດໃຊ້ງານ Dwarf 2 (-gw)

source: Enable Dwarf 2 with sets
lo: ເປີດໃຊ້ງານ Dwarf 2 ພ້ອມ sets

source: Enable Dwarf 3 (-gw3)
lo: ເປີດໃຊ້ງານ Dwarf 3 (-gw3)

source: Enable Option -Xg?
lo: ເປີດໃຊ້ງານຕົວເລືອກ -Xg ບໍ່?

source: Enable = pressing Return replaces whole identifier and Shift+Return replaces prefix, Disable = pressing Return replaces prefix and Shift+Return replaces whole identifier
lo: ເປີດ = ກົດ Return ແທນທີ່ຕົວລະບຸທັງໝົດ ແລະ Shift+Return ແທນທີ່ prefix, ປິດ = ກົດ Return ແທນທີ່ prefix ແລະ Shift+Return ແທນທີ່ຕົວລະບຸທັງໝົດ

source: Enclose in $IFDEF
lo: ກວມດ້ວຍ $IFDEF

source: Number of files failed to convert: %d
lo: ຈຳນວນໄຟລ໌ທີ່ແປງບໍ່ສຳເລັດ: %d

# lazarusidestrconsts.lisencodingoffileondiskisnewencodingis
source: Encoding of file "%s"%son disk is %s. New encoding is %s.
lo: ການເຂົ້າລະຫັດຂອງໄຟລ໌ "%s"%sໃນດິດແມ່ນ %s. ການເຂົ້າລະຫັດໃໝ່ແມ່ນ %s.

source: Enter new name for Macro "%s"
lo: ປ້ອນຊື່ໃໝ່ສຳລັບ Macro "%s"

source: Environment variable, name as parameter
lo: Environment variable, ຊື່ເປັນ parameter

source: Invalid debugger filename
lo: ຊື່ໄຟລ໌ Debugger ບໍ່ຖືກຕ້ອງ

source: The debugger file "%s" is not an executable.
lo: ໄຟລ໌ Debugger "%s" ບໍ່ແມ່ນໄຟລ໌ທີ່ສາມາດຮັນໄດ້ (executable).

source: Test directory "%s" not found.
lo: ບໍ່ພົບໄດເຣັກທໍຣີທົດສອບ "%s".

source: Invalid option at position %d: "%s"
lo: ຕົວເລືອກບໍ່ຖືກຕ້ອງທີ່ຕຳແໜ່ງ %d: "%s"

source: Option at position %d does not allow an argument: %s
lo: ຕົວເລືອກທີ່ຕຳແໜ່ງ %d ບໍ່ອະນຸຍາດໃຫ້ມີ argument: %s

source: Option at position %d needs an argument : %s
lo: ຕົວເລືອກທີ່ຕຳແໜ່ງ %d ຕ້ອງການ argument : %s

source: Error:
lo: ຜິດພາດ:

source: Error creating file
lo: ເກີດຂໍ້ຜິດພາດໃນການສ້າງໄຟລ໌

source: Error deleting file
lo: ເກີດຂໍ້ຜິດພາດໃນການລົບໄຟລ໌

source: Error in %s
lo: ເກີດຂໍ້ຜິດພາດໃນ %s

source: Error in the compiler file name:
lo: ເກີດຂໍ້ຜິດພາດໃນຊື່ໄຟລ໌ compiler:

source: Error in the custom compiler options (Other):
lo: ເກີດຂໍ້ຜິດພາດໃນຕົວເລືອກ compiler ແບບກຳນົດເອງ (ອື່ນໆ):

source: Error in the custom linker options (Compilation and Linking / Pass options to linker):
lo: ເກີດຂໍ້ຜິດພາດໃນຕົວເລືອກ linker ແບບກຳນົດເອງ (Compilation ແລະ Linking / ສົ່ງຕົວເລືອກໄປຍັງ linker):

source: Error in the "Debugger path addition":
lo: ເກີດຂໍ້ຜິດພາດໃນ "Debugger path addition":

source: Error in the search path for "Include files":
lo: ເກີດຂໍ້ຜິດພາດໃນ search path ສຳລັບ "Include files":

source: Error in the search path for "Libraries":
lo: ເກີດຂໍ້ຜິດພາດໃນ search path ສຳລັບ "Libraries":

source: Error in the search path for "Object files":
lo: ເກີດຂໍ້ຜິດພາດໃນ search path ສຳລັບ "Object files":

source: Error in the search path for "Other sources":
lo: ເກີດຂໍ້ຜິດພາດໃນ search path ສຳລັບ "Other sources":

source: Error in the search path for "Other unit files":
lo: ເກີດຂໍ້ຜິດພາດໃນ search path ສຳລັບ "Other unit files":

source: Error in the "unit output directory":
lo: ເກີດຂໍ້ຜິດພາດໃນ "unit output directory":

source: Error: invalid build mode "%s"
lo: ຜິດພາດ: build mode ບໍ່ຖືກຕ້ອງ "%s"

source: Error loading file
lo: ເກີດຂໍ້ຜິດພາດໃນການໂຫຼດໄຟລ໌

source: Error loading file "%s":
lo: ເກີດຂໍ້ຜິດພາດໃນການໂຫຼດໄຟລ໌ "%s":

source: Error moving component
lo: ເກີດຂໍ້ຜິດພາດໃນການຍ້າຍ component

source: Error moving component %s:%s
lo: ເກີດຂໍ້ຜິດພາດໃນການຍ້າຍ component %s:%s

source: Error naming component
lo: ເກີດຂໍ້ຜິດພາດໃນການຕັ້ງຊື່ component

source: Error opening component
lo: ເກີດຂໍ້ຜິດພາດໃນການເປີດ component

source: Error opening form
lo: ເກີດຂໍ້ຜິດພາດໃນການເປີດ Form

source: Error parsing lfm component stream.
lo: ເກີດຂໍ້ຜິດພາດໃນການແຍກ lfm component stream.

source: Error reading package list from file%s%s%s%s
lo: ເກີດຂໍ້ຜິດພາດໃນການອ່ານລາຍການແພັກເກັດຈາກໄຟລ໌%s%s%s%s

source: Error reading XML
lo: ເກີດຂໍ້ຜິດພາດໃນການອ່ານ XML

source: Error reading xml file "%s"%s%s
lo: ເກີດຂໍ້ຜິດພາດໃນການອ່ານໄຟລ໌ xml "%s"%s%s

source: Error renaming file
lo: ເກີດຂໍ້ຜິດພາດໃນການປ່ຽນຊື່ໄຟລ໌

# lazarusidestrconsts.liserrors
source: Errors
lo: ຂໍ້ຜິດພາດ

source: , Errors: %s
lo: , ຂໍ້ຜິດພາດ: %s

source: Error saving form
lo: ເກີດຂໍ້ຜິດພາດໃນການບັນທຶກ Form

source: Error setting the name of a component %s to %s
lo: ເກີດຂໍ້ຜິດພາດໃນການຕັ້ງຊື່ component %s ເປັນ %s

source: Error writing file "%s"
lo: ເກີດຂໍ້ຜິດພາດໃນການຂຽນໄຟລ໌ "%s"

source: Error writing package list to file%s%s%s%s
lo: ເກີດຂໍ້ຜິດພາດໃນການຂຽນລາຍການແພັກເກັດລົງໄຟລ໌%s%s%s%s

source: Show every n-th line number
lo: ສະແດງເລກແຖວທຸກໆ n ແຖວ

source: Example file:
lo: ໄຟລ໌ຕົວຢ່າງ:

source: Examples:%sIdentifier%sTMyEnum.Enum%sUnitname.Identifier%s#PackageName.UnitName.Identifier
lo: ຕົວຢ່າງ: %sIdentifier%sTMyEnum.Enum%sUnitname.Identifier%s#PackageName.UnitName.Identifier

source: Exclude
lo: ຍົກເວັ້ນ

source: %s excluded at run time
lo: %s ຖືກຍົກເວັ້ນໃນ run time

source: Excludes for * and ** in unit and include search paths
lo: ສິ່ງທີ່ຍົກເວັ້ນສຳລັບ * ແລະ ** ໃນ unit ແລະ include search paths

source: executable "%s" is a directory
lo: executable "%s" ແມ່ນໄດເຣັກທໍຣີ

source: executable "%s" lacks the permission to run
lo: executable "%s" ຂາດສິດທິໃນການຮັນ

source: Execute After
lo: Execute ຫຼັງຈາກ

source: Execute Before
lo: Execute ກ່ອນ

source: Execution stopped
lo: ການເຮັດວຽກຢຸດລົງ

source: Execution stopped with exit-code %1:d ($%2:s)
lo: ການເຮັດວຽກຢຸດລົງດ້ວຍ exit-code %1:d ($%2:s)

# lazarusidestrconsts.lisexit
source: Exit
lo: ອອກ

source: Expand
lo: ຂະຫຍາຍ

source: Expand All [Ctrl+Plus]
lo: ຂະຫຍາຍທັງໝົດ [Ctrl+Plus]

source: Expand All
lo: ຂະຫຍາຍທັງໝົດ

source: Expand all classes
lo: ຂະຫຍາຍ Class ທັງໝົດ

source: Expand all packages
lo: ຂະຫຍາຍແພັກເກັດທັງໝົດ

source: Expand all units
lo: ຂະຫຍາຍ unit ທັງໝົດ

source: Expanded filename of current editor file
lo: ຊື່ໄຟລ໌ແບບເຕັມຂອງຕົວແກ້ໄຂປັດຈຸບັນ

# lazarusidestrconsts.lisexport
source: Export
lo: ສົ່ງອອກ

source: Export all
lo: ສົ່ງອອກທັງໝົດ

source: Export All Items to File
lo: ສົ່ງອອກລາຍການທັງໝົດລົງໄຟລ໌

# lazarusidestrconsts.lisexportenvironmentoptions
source: Export environment options
lo: ສົ່ງອອກຕົວເລືອກສະພາບແວດລ້ອມ

source: Export as HTML
lo: ສົ່ງອອກເປັນ HTML

source: Export / Import
lo: ສົ່ງອອກ / ນຳເຂົ້າ

source: Export package list
lo: ສົ່ງອອກລາຍການແພັກເກັດ

source: Export selected
lo: ສົ່ງອອກທີ່ເລືອກ

source: Export >>
lo: ສົ່ງອອກ >>

source: Extract
lo: ແຍກອອກ (Extract)

# lazarusidestrconsts.lisextractprocedure
source: Extract Procedure
lo: ແຍກ Procedure

source: Pass additional options to the compiler. Can be given multiple times. If compilation options are also specified in --build-ide, then the options from --opt will be added after them.
lo: ສົ່ງຕົວເລືອກເພີ່ມເຕີມໄປຍັງ compiler. ສາມາດໃສ່ໄດ້ຫຼາຍຄັ້ງ. ຖ້າມີການລະບຸຕົວເລືອກ compilation ໃນ --build-ide, ຕົວເລືອກຈາກ --opt ຈະຖືກເພີ່ມຕໍ່ທ້າຍ.

source: Extremely Verbose
lo: ລະອຽດຫຼາຍທີ່ສຸດ (Extremely Verbose)

source: Do you want to delete the tool "%s"?
lo: ເຈົ້າຕ້ອງການລົບເຄື່ອງມື "%s" ບໍ່?

source: External Tools
lo: ເຄື່ອງມືພາຍນອກ

source: Maximum Tools reached
lo: ເຄື່ອງມືຄົບຈຳນວນສູງສຸດແລ້ວ

source: There is a maximum of %s tools.
lo: ມີເຄື່ອງມືໄດ້ສູງສຸດ %s ອັນ.

source: Failed to add %d not unique resource(s)
lo: ບໍ່ສາມາດເພີ່ມ %d ຊັບພະຍາກອນທີ່ບໍ່ຊ້ຳກັນໄດ້

source: Failed to create Application Bundle for "%s"
lo: ບໍ່ສາມາດສ້າງ Application Bundle ສຳລັບ "%s"

source: Failed to load fold state
lo: ບໍ່ສາມາດໂຫຼດສະຖານະການພັບ (fold state) ໄດ້

source: failed to resolve macros
lo: ບໍ່ສາມາດແກ້ໄຂ macros ໄດ້

source: Failed to save file.
lo: ບໍ່ສາມາດບັນທຶກໄຟລ໌ໄດ້.

source: Failed to save macro.
lo: ບໍ່ສາມາດບັນທຶກ macro ໄດ້.

# lazarusidestrconsts.lisfatal
source: Fatal
lo: ຮ້າຍແຮງ (Fatal)

# lazarusidestrconsts.lisfile
source: File
lo: ໄຟລ໌

source: File:
lo: ໄຟລ໌:

source: File "%s" already exists.
lo: ໄຟລ໌ "%s" ມີຢູ່ແລ້ວ.

source: File extension of programs
lo: ນາມສະກຸນໄຟລ໌ຂອງໂປຣແກຣມ

source: File filter
lo: ຕົວຕອງໄຟລ໌

source: File Filters
lo: ຕົວຕອງໄຟລ໌ (File Filters)

source: Add Row
lo: ເພີ່ມແຖວ

source: Delete Row
lo: ລົບແຖວ

source: Insert Row
lo: ແຊກແຖວ

source: Set defaults
lo: ຕັ້ງເປັນຄ່າເລີ່ມຕົ້ນ

source: These are file filters that will appear in all File Open dialogs
lo: ເຫຼົ່ານີ້ແມ່ນຕົວຕອງໄຟລ໌ທີ່ຈະປະກົດໃນກ່ອງໂຕ້ຕອບເປີດໄຟລ໌ທັງໝົດ

source: File found
lo: ພົບໄຟລ໌

source: File "%s" has changed. Save?
lo: ໄຟລ໌ "%s" ມີການປ່ຽນແປງ. ບັນທຶກບໍ່?

source: File has no project
lo: ໄຟລ໌ບໍ່ມີໂປຣເຈັກ

source: File is directory
lo: ໄຟລ໌ແມ່ນໄດເຣັກທໍຣີ

source: File is not an executable
lo: ໄຟລ໌ບໍ່ແມ່ນ executable

source: File "%s" is virtual.
lo: ໄຟລ໌ "%s" ແມ່ນ virtual.

source: Filename Style
lo: ຮູບແບບຊື່ໄຟລ໌

source: File not found
lo: ບໍ່ພົບໄຟລ໌

source: file %s not found
lo: ບໍ່ພົບໄຟລ໌ %s

source: file not found
lo: ບໍ່ພົບໄຟລ໌

source: File not found:%s%s
lo: ບໍ່ພົບໄຟລ໌:%s%s

source: File "%s" not found.%sDo you want to create it?
lo: ບໍ່ພົບໄຟລ໌ "%s".%sເຈົ້າຕ້ອງການສ້າງມັນບໍ່?

source: File not lowercase
lo: ໄຟລ໌ບໍ່ແມ່ນຕົວພິມນ້ອຍ

source: %d files were converted to text format.
lo: %d ໄຟລ໌ຖືກແປງເປັນຮູບແບບຂໍ້ຄວາມ.

source: File Settings
lo: ການຕັ້ງຄ່າໄຟລ໌

source: File %s has incorrect syntax.
lo: ໄຟລ໌ %s ມີ syntax ບໍ່ຖືກຕ້ອງ.

source: Files: %s, has Register procedure: %s, in package uses section: %s
lo: ໄຟລ໌: %s, ມີ Register procedure: %s, ໃນສ່ວນ uses ຂອງແພັກເກັດ: %s

source: *** All found files already have the right encoding ***
lo: *** ໄຟລ໌ທີ່ພົບທັງໝົດມີການເຂົ້າລະຫັດທີ່ຖືກຕ້ອງແລ້ວ ***

source: Files in ASCII or UTF-8 encoding
lo: ໄຟລ໌ໃນການເຂົ້າລະຫັດ ASCII ຫຼື UTF-8

source: File %s was converted to text format.
lo: ໄຟລ໌ %s ຖືກແປງເປັນຮູບແບບຂໍ້ຄວາມແລ້ວ.

source: Files not in ASCII nor UTF-8 encoding
lo: ໄຟລ໌ບໍ່ໄດ້ຢູ່ໃນການເຂົ້າລະຫັດ ASCII ຫຼື UTF-8

source: File where debug output is written to. Default is write to the console.
lo: ໄຟລ໌ທີ່ debug output ຖືກຂຽນລົງ. ຄ່າເລີ່ມຕົ້ນແມ່ນຂຽນລົງ console.

source: Filter
lo: ຕົວຕອງ (Filter)

source: Filter: %s
lo: ຕົວຕອງ: %s

source: Filter all messages of certain type
lo: ຕອງຂໍ້ຄວາມທັງໝົດຂອງບາງປະເພດ

source: Filter all messages of type %s
lo: ຕອງຂໍ້ຄວາມທັງໝົດຂອງປະເພດ %s

source: Filter already exists
lo: ຕົວຕອງມີຢູ່ແລ້ວ

source: Filter Debug Messages and below
lo: ຕອງຂໍ້ຄວາມ Debug ແລະ ຕ່ຳກວ່າ

source: Filter Hints and below
lo: ຕອງ Hints ແລະ ຕ່ຳກວ່າ

source: Filter Hints without Source Position
lo: ຕອງ Hints ທີ່ບໍ່ມີຕຳແໜ່ງ Source

source: Filter None, do not filter by urgency
lo: ບໍ່ຕອງ (None), ບໍ່ຕອງຕາມຄວາມຮີບດ່ວນ

source: Filter non urgent Messages
lo: ຕອງຂໍ້ຄວາມທີ່ບໍ່ຮີບດ່ວນ

source: Filter Notes and below
lo: ຕອງ Notes ແລະ ຕ່ຳກວ່າ

source: Filter the available options list
lo: ຕອງລາຍການຕົວເລືອກທີ່ມີ

source: Filter Verbose Messages and below
lo: ຕອງຂໍ້ຄວາມ Verbose ແລະ ຕ່ຳກວ່າ

source: Filter Warnings and below
lo: ຕອງ Warnings ແລະ ຕ່ຳກວ່າ

source: Find ...
lo: ຄົ້ນຫາ ...

source: Find Declaration of %s
lo: ຄົ້ນຫາ Declaration ຂອງ %s

source: D&irectories
lo: ໄດເຣັກທໍຣີ

source: Include &sub directories
lo: ລວມໄດເຣັກທໍຣີຍ່ອຍ

source: &Multiline pattern
lo: ຮູບແບບຫຼາຍແຖວ

source: This file contains characters that have different lengths in upper and lower case. The current implementation does not allow for correct replacement in this case (but you can use case-sensitive replacement). This file will have to be skipped:
lo: ໄຟລ໌ນີ້ມີຕົວອັກສອນທີ່ມີຄວາມຍາວຕ່າງກັນໃນຕົວພິມໃຫຍ່ ແລະ ຕົວພິມນ້ອຍ. ການປະຕິບັດປັດຈຸບັນບໍ່ອະນຸຍາດໃຫ້ແທນທີ່ຢ່າງຖືກຕ້ອງໃນກໍລະນີນີ້ (ແຕ່ເຈົ້າສາມາດໃຊ້ການແທນທີ່ແບບ case-sensitive ໄດ້). ໄຟລ໌ນີ້ຈະຕ້ອງຖືກຂ້າມ:

source: all files in &project
lo: ໄຟລ໌ທັງໝົດໃນໂປຣເຈັກ

source: all &open files
lo: ໄຟລ໌ທີ່ເປີດທັງໝົດ

source: &active file
lo: ໄຟລ໌ທີ່ໃຊ້ງານຢູ່

source: &directories
lo: ໄດເຣັກທໍຣີ

source: project &group
lo: ກຸ່ມໂປຣເຈັກ

source: Search location
lo: ຕຳແໜ່ງຄົ້ນຫາ

source: Find key combination
lo: ຄົ້ນຫາ Key combination

source: Find missing unit
lo: ຄົ້ນຫາ unit ທີ່ຫາຍໄປ

source: Find option
lo: ຄົ້ນຫາຕົວເລືອກ

source: Find overrides too
lo: ຄົ້ນຫາ overrides ນຳ

source: First
lo: ທຳອິດ

source: &First test
lo: ການທົດສອບທຳອິດ

source: Fix LFM file
lo: ສ້ອມແປງໄຟລ໌ LFM

source: Force renaming
lo: ບັງຄັບປ່ຽນຊື່

source: "Scoped" sorting will show local variables on top, then the members of current class, then of the ancestors, then the current unit, then of used units
lo: ການຈັດລຽງແບບ "Scoped" ຈະສະແດງຕົວປ່ຽນ local ຢູ່ທາງເທິງ, ຈາກນັ້ນແມ່ນ member ຂອງ class ປັດຈຸບັນ, ຈາກນັ້ນແມ່ນບັນພະບຸລຸດ, ຈາກນັ້ນແມ່ນ unit ປັດຈຸບັນ, ແລະ ສຸດທ້າຍແມ່ນ unit ທີ່ຖືກ use

source: For macOS (Darwin)
lo: ສຳລັບ macOS (Darwin)

source: Format error
lo: Format ຜິດພາດ

source: For Windows
lo: ສຳລັບ Windows

source: Found version %s, expected %s
lo: ພົບເວີຊັນ %s, ຄາດຫວັງ %s

source: FPC version as one number (e.g. 20701)
lo: ເວີຊັນ FPC ເປັນຕົວເລກດຽວ (ເຊັ່ນ: 20701)

source: FPC message file:
lo: ໄຟລ໌ຂໍ້ຄວາມ FPC:

source: FPC messages: Appendix
lo: ຂໍ້ຄວາມ FPC: Appendix

source: FPC too old
lo: FPC ເກົ່າເກີນໄປ

source: FPC Version (e.g. 2.2.2)
lo: FPC Version (ເຊັ່ນ: 2.2.2)

# lazarusidestrconsts.lisfpdoceditor
source: FPDoc Editor
lo: ຕົວແກ້ໄຂ FPDoc

source: Error writing "%s"%s%s
lo: ເກີດຂໍ້ຜິດພາດໃນການຂຽນ "%s"%s%s

source: FPDoc syntax error
lo: FPDoc syntax ຜິດພາດ

source: FPDoc package name:
lo: ຊື່ແພັກເກັດ FPDoc:

source: FPDoc package name. Default is project file name.
lo: ຊື່ແພັກເກັດ FPDoc. ຄ່າເລີ່ມຕົ້ນແມ່ນຊື່ໄຟລ໌ໂປຣເຈັກ.

source: There is a syntax error in the fpdoc element "%s":%s%s
lo: ມີ syntax ຜິດພາດໃນ fpdoc element "%s":%s%s

source: there is a problem with the Free Pascal compiler executable,
lo: ມີບັນຫາກັບ Free Pascal compiler executable,

source: Warnings have to be resolved first
lo: ຕ້ອງແກ້ໄຂຄຳເຕືອນກ່ອນ

source: The configuration file typically has the name "fppkg.cfg". When incorrect it may be impossible to resolve dependencies on Free Pascal packages. Leave empty to use the default.
lo: ໄຟລ໌ການຕັ້ງຄ່າໂດຍທົ່ວໄປມີຊື່ວ່າ "fppkg.cfg". ເມື່ອບໍ່ຖືກຕ້ອງ ມັນອາດຈະເປັນໄປບໍ່ໄດ້ທີ່ຈະແກ້ໄຂ dependencies ໃນແພັກເກັດ Free Pascal. ປ່ອຍຫວ່າງໄວ້ເພື່ອໃຊ້ຄ່າເລີ່ມຕົ້ນ.

source: Fppkg configuration file not found:%s%s
lo: ບໍ່ພົບໄຟລ໌ການຕັ້ງຄ່າ Fppkg:%s%s

source: Failed to generate the configuration file "%s": %s
lo: ບໍ່ສາມາດສ້າງໄຟລ໌ການຕັ້ງຄ່າ "%s": %s

source: Files to be written:
lo: ໄຟລ໌ທີ່ຈະຂຽນ:

source: You could try to restore the configuration files automatically, or adapt the configuration file manually.
lo: ເຈົ້າສາມາດລອງກູ້ຄືນໄຟລ໌ການຕັ້ງຄ່າແບບອັດຕະໂນມັດ, ຫຼື ປັບແຕ່ງໄຟລ໌ການຕັ້ງຄ່າດ້ວຍຕົນເອງ.

source: Failed to retrieve the version of the fpcmkcfg configuration tool.
lo: ບໍ່ສາມາດດຶງເວີຊັນຂອງເຄື່ອງມືການຕັ້ງຄ່າ fpcmkcfg ໄດ້.

source: Could not find the fpcmkcfg configuration tool, which is needed to create the configuration files.
lo: ບໍ່ສາມາດຊອກຫາເຄື່ອງມືການຕັ້ງຄ່າ fpcmkcfg, ເຊິ່ງຈຳເປັນໃນການສ້າງໄຟລ໌ການຕັ້ງຄ່າ.

source: An up-to-date version is needed to create the configuration files.
lo: ຕ້ອງການເວີຊັນທີ່ອັບເດດເພື່ອສ້າງໄຟລ໌ການຕັ້ງຄ່າ.

# lazarusidestrconsts.lisfppkgfpcmkcfgprobtooold
source: It is probably too old to create the configuration files.
lo: ມັນອາດຈະເກົ່າເກີນໄປທີ່ຈະສ້າງໄຟລ໌ການຕັ້ງຄ່າ.

source: The fpcmkcfg configuration tool it too old [%s].
lo: ເຄື່ອງມືການຕັ້ງຄ່າ fpcmkcfg ເກົ່າເກີນໄປ [%s].

source: The prefix of the Free Pascal Compiler installation is required. For example it has the units "%s" and/or "%s"
lo: ຕ້ອງການ prefix ຂອງການຕິດຕັ້ງ Free Pascal Compiler. ຕົວຢ່າງ ມັນມີ units "%s" ແລະ/ຫຼື "%s"

source: Problem with Fppkg configuration
lo: ບັນຫາກັບການຕັ້ງຄ່າ Fppkg

source: Make sure a recent version is installed and available in the path or alongside the compiler-executable.
lo: ກວດສອບໃຫ້ແນ່ໃຈວ່າໄດ້ຕິດຕັ້ງເວີຊັນຫຼ້າສຸດ ແລະ ມີຢູ່ໃນ path ຫຼື ຢູ່ຄຽງຂ້າງ compiler-executable.

source: A problem occurred while trying to create a new Fppkg configuration: %s
lo: ເກີດບັນຫາຂຶ້ນໃນຂະນະທີ່ພະຍາຍາມສ້າງການຕັ້ງຄ່າ Fppkg ໃໝ່: %s

source: Failed to create a new Fppkg configuration (%s) You will have to fix the configuration manually or reinstall Free Pascal.
lo: ບໍ່ສາມາດສ້າງການຕັ້ງຄ່າ Fppkg ໃໝ່ (%s) ເຈົ້າຈະຕ້ອງແກ້ໄຂການຕັ້ງຄ່າດ້ວຍຕົນເອງ ຫຼື ຕິດຕັ້ງ Free Pascal ໃໝ່.

source: Write new configuration files
lo: ຂຽນໄຟລ໌ການຕັ້ງຄ່າໃໝ່

source: &Backward search
lo: ຄົ້ນຫາກັບຫຼັງ

source: freeing buffer lines: %s
lo: ກຳລັງ free buffer lines: %s

source: Free Pascal Compiler messages
lo: ຂໍ້ຄວາມ Free Pascal Compiler

source: Free Pascal source directory
lo: ໄດເຣັກທໍຣີ source ຂອງ Free Pascal

source: Forwar&d search
lo: ຄົ້ນຫາໄປໜ້າ

source: Additional files to search (e.g. /path/*.pas;/path2/*.pp)
lo: ໄຟລ໌ເພີ່ມເຕີມທີ່ຈະຄົ້ນຫາ (ເຊັ່ນ: /path/*.pas;/path2/*.pp)

source: Find or Rename Identifier
lo: ຄົ້ນຫາ ຫຼື ປ່ຽນຊື່ Identifier

source: Find References
lo: ຄົ້ນຫາ References

source: in all open packages and projects
lo: ໃນແພັກເກັດ ແລະ ໂປຣເຈັກທີ່ເປີດທັງໝົດ

source: in current unit
lo: ໃນ unit ປັດຈຸບັນ

source: in main project
lo: ໃນໂປຣເຈັກຫຼັກ

source: in project/package owning current unit
lo: ໃນໂປຣເຈັກ/ແພັກເກັດ ທີ່ເປັນເຈົ້າຂອງ unit ປັດຈຸບັນ

source: Invalid Identifier
lo: Identifier ບໍ່ຖືກຕ້ອງ

source: Rename all References
lo: ປ່ຽນຊື່ References ທັງໝົດ

source: Renaming
lo: ກຳລັງປ່ຽນຊື່

source: Search
lo: ຄົ້ນຫາ

source: Search in comments too
lo: ຄົ້ນຫາໃນຄຳອະທິບາຍ (comments) ນຳ

source: Full
lo: ເຕັມ

# lazarusidestrconsts.lisgeneral
source: General
lo: ທົ່ວໄປ

source: Fppkg configuration: %s
lo: ການຕັ້ງຄ່າ Fppkg: %s
