Repository: fpc/Lazarus
Catalog: languages/lazaruside.*.po
Languages: lo

source: of the Project Inspector
lo: ຂອງ ຜູ້ກວດສອບໂຄງການ

source: Add to favorite properties
lo: ເພີ່ມໃສ່ຄຸນສົມບັດທີ່ມັກ

source: Choose a base class for the favorite property "%s".
lo: ເລືອກ base class ສຳລັບຄຸນສົມບັດທີ່ມັກ "%s".

source: Class "%s" not found.
lo: ບໍ່ພົບ Class "%s".

source: Remove from favorite properties
lo: ລຶບອອກຈາກຄຸນສົມບັດທີ່ມັກ

source: auto install dynamic
lo: ຕິດຕັ້ງ dynamic ອັດຕະໂນມັດ

source: auto install static
lo: ຕິດຕັ້ງ static ອັດຕະໂນມັດ

source: Description:
lo: ຄຳອະທິບາຍ:

source: %sDescription: %s
lo: %sຄຳອະທິບາຍ: %s

source: Filename: %s
lo: ຊື່ໄຟລ໌: %s

source: installed dynamic
lo: ຕິດຕັ້ງ dynamic ແລ້ວ

source: installed static
lo: ຕິດຕັ້ງ static ແລ້ວ

source: %sLicense: %s
lo: %sໃບອະນຸຍາດ: %s

source: missing
lo: ຂາດຫາຍໄປ

source: modified
lo: ຖືກແກ້ໄຂ

source: Open Loaded Package
lo: ເປີດແພັກເກັດທີ່ໂຫຼດແລ້ວ

source: Package Name
lo: ຊື່ແພັກເກັດ

source: Please select a package
lo: ກະລຸນາເລືອກແພັກເກັດ

source: readonly
lo: ອ່ານເທົ່ານັ້ນ

# lazarusidestrconsts.lisoipstate
source: State
lo: ສະຖານະ

source: %sThis package is installed but the lpk file was not found
lo: %sແພັກເກັດນີ້ຖືກຕິດຕັ້ງແລ້ວ ແຕ່ບໍ່ພົບໄຟລ໌ lpk

source: Old Class
lo: Class ເກົ່າ

source: On break line (i.e. return or enter key)
lo: ເມື່ອຕັດແຖວ (ເຊັ່ນ: ກົດ return ຫຼື enter)

source: available in the main repository
lo: ມີຢູ່ໃນ repository ຫຼັກ

source: only 32bit
lo: 32bit ເທົ່ານັ້ນ

source: Only available on Windows. Run the tool hidden.
lo: ມີໃຫ້ໃຊ້ສະເພາະໃນ Windows. ແລ່ນເຄື່ອງມືແບບເຊື່ອງໄວ້.

source: Only available on Windows. Run tool in a new console.
lo: ມີໃຫ້ໃຊ້ສະເພາະໃນ Windows. ແລ່ນເຄື່ອງມືໃນ console ໃໝ່.

source: Only messages fitting this regular expression:
lo: ສະເພາະຂໍ້ຄວາມທີ່ກົງກັບ regular expression ນີ້:

source: Only messages with these FPC IDs (comma separated):
lo: ສະເພາະຂໍ້ຄວາມທີ່ມີ FPC IDs ເຫຼົ່ານີ້ (ແຍກດ້ວຍຈຸດ):

source: Only register the Lazarus package files (.lpk). Do not build.
lo: ລົງທະບຽນສະເພາະໄຟລ໌ແພັກເກັດ Lazarus (.lpk). ບໍ່ຕ້ອງສ້າງ.

source: Only search for whole words
lo: ຄົ້ນຫາສະເພາະຄຳເຕັມ

source: On paste from clipboard
lo: ເມື່ອວາງຈາກ clipboard

# lazarusidestrconsts.lisopen
source: Open
lo: ເປີດ

source: Open as XML file
lo: ເປີດເປັນໄຟລ໌ XML

source: Open context help in the browser
lo: ເປີດ context help ໃນເບຣົາເຊີ

source: Open designer on open unit
lo: ເປີດ designer ເມື່ອເປີດຢູນິດ

source: Form is loaded in designer always when source unit is opened.
lo: ຟອມຈະຖືກໂຫຼດໃນ designer ສະເໝີເມື່ອເປີດ source unit.

source: Open existing file
lo: ເປີດໄຟລ໌ທີ່ມີຢູ່

# lazarusidestrconsts.lisopenfile
source: Open File
lo: ເປີດໄຟລ໌

# lazarusidestrconsts.lisopenfile2
source: Open file
lo: ເປີດໄຟລ໌

source: Open file at cursor
lo: ເປີດໄຟລ໌ທີ່ຕົວກະພິບ

source: Open in file manager
lo: ເປີດໃນຕົວຈັດການໄຟລ໌

source: Open destination directory in file manager
lo: ເປີດໄດເຣັກທໍຣີປາຍທາງໃນຕົວຈັດການໄຟລ໌

source: Open %s
lo: ເປີດ %s

source: Open Package?
lo: ເປີດແພັກເກັດບໍ່?

source: Open package %s
lo: ເປີດແພັກເກັດ %s

source: Open Package
lo: ເປີດແພັກເກັດ

source: Open Package File
lo: ເປີດໄຟລ໌ແພັກເກັດ

source: Open Project?
lo: ເປີດໂຄງການບໍ່?

source: Open project
lo: ເປີດໂຄງການ

source: Open project again
lo: ເປີດໂຄງການອີກຄັ້ງ

source: Open Project File
lo: ເປີດໄຟລ໌ໂຄງການ

source: Open the file as normal source
lo: ເປີດໄຟລ໌ເປັນຊອດໂຄດທຳມະດາ

source: Open the package "%s"? The "Package" menu has separate commands for opening packages and a list of recent ones.
lo: ເປີດແພັກເກັດ "%s" ບໍ່? ເມນູ "ແພັກເກັດ" ມີຄຳສັ່ງແຍກຕ່າງຫາກສຳລັບການເປີດແພັກເກັດ ແລະ ລາຍການແພັກເກັດຫຼ້າສຸດ.

source: Open the project "%s"? The "Project" menu has separate commands for opening projects and a list of recent ones.
lo: ເປີດໂຄງການ "%s" ບໍ່? ເມນູ "ໂຄງການ" ມີຄຳສັ່ງແຍກຕ່າງຫາກສຳລັບການເປີດໂຄງການ ແລະ ລາຍການໂຄງການຫຼ້າສຸດ.

source: Open Tool Options
lo: ເປີດຕົວເລືອກເຄື່ອງມື

source: Open Unit
lo: ເປີດ Unit

source: Open URL
lo: ເປີດ URL

source: Open XML
lo: ເປີດ XML

# lazarusidestrconsts.lisoptions
source: Options
lo: ຕົວເລືອກ

source: ignored
lo: ຖືກເມີນເສີຍ

source: other sources path of package "%s" contains directory "%s" which is already in the unit search path.
lo: ເສັ້ນທາງຊອດໂຄດອື່ນຂອງແພັກເກັດ "%s" ມີໂຟນເດີ "%s" ເຊິ່ງມີຢູ່ໃນເສັ້ນທາງຄົ້ນຫາ Unit ແລ້ວ.

source: output directory of %s contains Pascal unit source "%s"
lo: ໂຟນເດີຜົນລັບຂອງ %s ມີຊອດໂຄດ Pascal unit "%s"

source: Output filename of project
lo: ຊື່ໄຟລ໌ຜົນລັບຂອງໂຄງການ

source: Override language. For possible values see files in the "languages" directory. Example: "--language=de".
lo: ກຳນົດພາສາທັບຊ້ອນ. ສຳລັບຄ່າທີ່ເປັນໄປໄດ້ໃຫ້ເບິ່ງໄຟລ໌ໃນໂຟນເດີ "languages". ຕົວຢ່າງ: "--language=de".

source: Override function result string types with the first parameter expression type
lo: ກໍານົດຊະນິດ string ຂອງຜົນລັບຟັງຊັນທັບຊ້ອນ ດ້ວຍຊະນິດ expression ຂອງພາລາມິເຕີຕົວທຳອິດ

source: Override the default compiler. For example: ppc386 ppcx64 ppcppc. Default value is stored in environmentoptions.xml.
lo: ກໍານົດຕົວ compiler ເລີ່ມຕົ້ນທັບຊ້ອນ. ຕົວຢ່າງ: ppc386 ppcx64 ppcppc. ຄ່າເລີ່ມຕົ້ນຖືກເກັບໄວ້ໃນ environmentoptions.xml.

source: Override the project or IDE build mode.
lo: ກໍານົດ build mode ຂອງໂຄງການ ຫຼື IDE ທັບຊ້ອນ.

source: Override the project CPU. For example: i386 x86_64 powerpc powerpc_64. Default: %s.
lo: ກໍານົດ CPU ຂອງໂຄງການທັບຊ້ອນ. ຕົວຢ່າງ: i386 x86_64 powerpc powerpc_64. ຄ່າເລີ່ມຕົ້ນ: %s.

source: Override the project operating system. For example: win32 linux. Default: %s.
lo: ກໍານົດລະບົບປະຕິບັດການຂອງໂຄງການທັບຊ້ອນ. ຕົວຢ່າງ: win32 linux. ຄ່າເລີ່ມຕົ້ນ: %s.

source: Override the project subtarget.
lo: ກໍານົດ subtarget ຂອງໂຄງການທັບຊ້ອນ.

source: Override the project widgetset. For example: %s. Default: %s.
lo: ກໍານົດ widgetset ຂອງໂຄງການທັບຊ້ອນ. ຕົວຢ່າງ: %s. ຄ່າເລີ່ມຕົ້ນ: %s.

source: 'Owner' is already used by TReader/TWriter. Please choose another name.
lo: 'Owner' ຖືກໃຊ້ແລ້ວໂດຍ TReader/TWriter. ກະລຸນາເລືອກຊື່ອື່ນ.

source: Package
lo: ແພັກເກັດ

source: package %s
lo: ແພັກເກັດ %s

source: , package %s
lo: , ແພັກເກັດ %s

source: Package info
lo: ຂໍ້ມູນແພັກເກັດ

source: Package "%s" is designtime only, so it should only be compiled into the IDE, and not with the project settings.%sPlease use "Install" or "Tools / Build Lazarus" to build the IDE packages.
lo: ແພັກເກັດ "%s" ສຳລັບ designtime ເທົ່ານັ້ນ, ດັ່ງນັ້ນມັນຄວນຈະຖືກ compile ເຂົ້າໃນ IDE ເທົ່ານັ້ນ, ແລະ ບໍ່ແມ່ນກັບການຕັ້ງຄ່າໂຄງການ.%sກະລຸນາໃຊ້ "Install" ຫຼື "Tools / Build Lazarus" ເພື່ອ build ແພັກເກັດ IDE.

source: Package name begins with ...
lo: ຊື່ແພັກເກັດຂຶ້ນຕົ້ນດ້ວຍ ...

source: Package name contains ...
lo: ຊື່ແພັກເກັດປະກອບມີ ...

source: Package needs an output directory.
lo: ແພັກເກັດຕ້ອງການໂຟນເດີຜົນລັບ.

source: Package needs installation
lo: ແພັກເກັດຕ້ອງການການຕິດຕັ້ງ

source: Package "%s" Option
lo: ຕົວເລືອກແພັກເກັດ "%s"

source: Package output directories
lo: ໂຟນເດີຜົນລັບຂອງແພັກເກັດ

source: Package source directories
lo: ໂຟນເດີຊອດໂຄດຂອງແພັກເກັດ

source: packages=%s/%s units=%s/%s identifiers=%s/%s lines=%s bytes=%s
lo: ແພັກເກັດ=%s/%s units=%s/%s identifiers=%s/%s ແຖວ=%s ໄບຕ໌=%s

source: package unit
lo: unit ຂອງແພັກເກັດ

# lazarusidestrconsts.lispage
source: Page
lo: ໜ້າ

source: Page name
lo: ຊື່ໜ້າ

source: Page name "%s" already exists. Not added.
lo: ຊື່ໜ້າ "%s" ມີຢູ່ແລ້ວ. ບໍ່ໄດ້ເພີ່ມ.

source: , parsed
lo: , ວິເຄາະແລ້ວ

source: parser "%s": %s
lo: ຕົວວິເຄາະ "%s": %s

source: Parsers:
lo: ຕົວວິເຄາະ:

source: Passing --quiet two times will pass -vw-n-h-i-l-d-u-t-p-c-x- to the compiler.
lo: ການສົ່ງ --quiet ສອງຄັ້ງຈະສົ່ງ -vw-n-h-i-l-d-u-t-p-c-x- ໄປໃຫ້ compiler.

source: paste clipboard
lo: ວາງ clipboard

# lazarusidestrconsts.lispastefromclipboard
source: Paste from clipboard.
lo: ວາງຈາກ clipboard.

source: Pastel Colors
lo: ສີພາສເທວ

source: Path
lo: ເສັ້ນທາງ

# lazarusidestrconsts.lispatheditbrowse
source: Browse
lo: ເລືອກ

source: Delete Invalid Paths
lo: ລຶບເສັ້ນທາງທີ່ໃຊ້ບໍ່ໄດ້

source: Move path down (Ctrl+Down)
lo: ຍ້າຍເສັ້ນທາງລົງ (Ctrl+Down)

source: Move path up (Ctrl+Up)
lo: ຍ້າຍເສັ້ນທາງຂຶ້ນ (Ctrl+Up)

source: Add new path to the list
lo: ເພີ່ມເສັ້ນທາງໃໝ່ໃສ່ລາຍການ

source: Delete the selected path
lo: ລຶບເສັ້ນທາງທີ່ເລືອກ

source: Remove non-existent (gray) paths from the list
lo: ລຶບເສັ້ນທາງທີ່ບໍ່ມີຢູ່ຈິງ (ສີເທົາ) ອອກຈາກລາຍການ

source: Replace the selected path with a new path
lo: ແທນທີ່ເສັ້ນທາງທີ່ເລືອກດ້ວຍເສັ້ນທາງໃໝ່

source: Add template to the list
lo: ເພີ່ມແມ່ແບບໃສ່ລາຍການ

source: Path templates
lo: ແມ່ແບບເສັ້ນທາງ

source: Search paths:
lo: ເສັ້ນທາງຄົ້ນຫາ:

source: is not a directory
lo: ບໍ່ແມ່ນໂຟນເດີ

source: path of the instantfpc cache
lo: ເສັ້ນທາງຂອງ instantfpc cache

source: Path of the make utility
lo: ເສັ້ນທາງຂອງເຄື່ອງມື make

source: Path to failed Instance:
lo: ເສັ້ນທາງໄປຫາ Instance ທີ່ລົ້ມເຫຼວ:

# lazarusidestrconsts.lispause
source: Pause
lo: ຢຸດຊົ່ວຄາວ

source: Clear to use the package name
lo: ລ້າງເພື່ອໃຊ້ຊື່ແພັກເກັດ

source: Disable I18N of lfm
lo: ປິດການໃຊ້ງານ I18N ຂອງ lfm

source: Add Files from File System
lo: ເພີ່ມໄຟລ໌ຈາກລະບົບໄຟລ໌

# lazarusidestrconsts.lispckeditaddtoproject
source: Add to Project
lo: ເພີ່ມໃສ່ໂຄງການ

source: Apply changes
lo: ນຳໃຊ້ການປ່ຽນແປງ

source: (available online)
lo: (ມີອອນລາຍ)

source: Call %sRegister%s procedure of selected unit
lo: ເອີ້ນ procedure %sRegister%s ຂອງ Unit ທີ່ເລືອກ

source: Check availability online
lo: ກວດສອບຄວາມພ້ອມອອນລາຍ

source: Clean up dependencies ...
lo: ລ້າງ dependencies ...

source: Clear default/preferred filename of dependency
lo: ລ້າງຊື່ໄຟລ໌ ເລີ່ມຕົ້ນ/ທີ່ຕ້ອງການ ຂອງ dependency

source: Common
lo: ທົ່ວໄປ

source: Compile everything?
lo: Compile ທຸກຢ່າງບໍ່?

source: Compile package
lo: Compile ແພັກເກັດ

source: Create fpmake.pp
lo: ສ້າງ fpmake.pp

# lazarusidestrconsts.lispckeditcreatemakefile
source: Create Makefile
lo: ສ້າງ Makefile

source: Dependency Properties
lo: ຄຸນສົມບັດ Dependency

source: Edit general options
lo: ແກ້ໄຂຕົວເລືອກທົ່ວໄປ

source: File Properties
lo: ຄຸນສົມບັດໄຟລ໌

source: Install
lo: ຕິດຕັ້ງ

source: Invalid maximum version
lo: ເວີຊັນສູງສຸດບໍ່ຖືກຕ້ອງ

source: Invalid minimum version
lo: ເວີຊັນຕໍ່າສຸດບໍ່ຖືກຕ້ອງ

source: Maximum Version:
lo: ເວີຊັນສູງສຸດ:

source: Minimum Version:
lo: ເວີຊັນຕໍ່າສຸດ:

source: Modified: %s
lo: ຖືກແກ້ໄຂ: %s

source: Move dependency down
lo: ຍ້າຍ dependency ລົງ

source: Move dependency up
lo: ຍ້າຍ dependency ຂຶ້ນ

source: Options for Package %s
lo: ຕົວເລືອກສຳລັບແພັກເກັດ %s

source: Package %s
lo: ແພັກເກັດ %s

source: Package "%s" has changed.%sSave package?
lo: ແພັກເກັດ "%s" ມີການປ່ຽນແປງ.%sບັນທຶກແພັກເກັດບໍ່?

source: package %s not saved
lo: ແພັກເກັດ %s ບໍ່ໄດ້ບັນທຶກ

source: %s, Page: %s
lo: %s, ໜ້າ: %s

source: Re-Add dependency
lo: ເພີ່ມ dependency ອີກຄັ້ງ

source: Re-Add file
lo: ເພີ່ມໄຟລ໌ອີກຄັ້ງ

source: Read Only: %s
lo: ອ່ານໄດ້ຢ່າງດຽວ: %s

source: Recompile All Required
lo: Recompile ສິ່ງທີ່ຈຳເປັນທັງໝົດ

source: Recompile Clean
lo: Recompile ແບບສະອາດ

source: Re-Compile this and all required packages?
lo: Re-Compile ອັນນີ້ ແລະ ແພັກເກັດທີ່ຈຳເປັນທັງໝົດບໍ່?

source: Registered plugins
lo: Plugins ທີ່ລົງທະບຽນແລ້ວ

source: Register unit
lo: ລົງທະບຽນ Unit

source: Remove dependency
lo: ລຶບ dependency

source: Remove dependency "%s"%sfrom package "%s"?
lo: ລຶບ dependency "%s"%sອອກຈາກແພັກເກັດ "%s" ບໍ່?

source: Removed Files
lo: ໄຟລ໌ທີ່ຖືກລຶບ

# lazarusidestrconsts.lispckeditremovedrequiredpackages
source: Removed required packages
lo: ແພັກເກັດທີ່ຈຳເປັນທີ່ຖືກລຶບ

source: Remove file
lo: ລຶບໄຟລ໌

source: Remove file?
lo: ລຶບໄຟລ໌ບໍ່?

source: Remove file "%s"%sfrom package "%s"?
lo: ລຶບໄຟລ໌ "%s"%sອອກຈາກແພັກເກັດ "%s" ບໍ່?

source: Remove selected item
lo: ລຶບລາຍການທີ່ເລືອກ

source: Required Packages
lo: ແພັກເກັດທີ່ຕ້ອງການ

source: Save Package
lo: ບັນທຶກແພັກເກັດ

source: Store file name as default for this dependency
lo: ບັນທຶກຊື່ໄຟລ໌ເປັນຄ່າເລີ່ມຕົ້ນສຳລັບ dependency ນີ້

source: Store file name as preferred for this dependency
lo: ບັນທຶກຊື່ໄຟລ໌ເປັນຄ່າທີ່ຕ້ອງການສຳລັບ dependency ນີ້

source: The maximum version "%s" is not a valid package version.%s(good example 1.2.3.4)
lo: ເວີຊັນສູງສຸດ "%s" ບໍ່ແມ່ນເວີຊັນແພັກເກັດທີ່ຖືກຕ້ອງ.%s(ຕົວຢ່າງທີ່ດີ 1.2.3.4)

source: The minimum version "%s" is not a valid package version.%s(good example 1.2.3.4)
lo: ເວີຊັນຕໍ່າສຸດ "%s" ບໍ່ແມ່ນເວີຊັນແພັກເກັດທີ່ຖືກຕ້ອງ.%s(ຕົວຢ່າງທີ່ດີ 1.2.3.4)

source: Uninstall
lo: ຖອນການຕິດຕັ້ງ

# lazarusidestrconsts.lispckeditviewpackagesource
source: View Package Source
lo: ເບິ່ງຊອດໂຄດແພັກເກັດ

source: Base, cannot be uninstalled
lo: ພື້ນຖານ, ບໍ່ສາມາດຖອນການຕິດຕັ້ງໄດ້

# lazarusidestrconsts.lispckexplinstalled
source: Installed
lo: ຕິດຕັ້ງແລ້ວ

source: Install on next start
lo: ຕິດຕັ້ງໃນການເລີ່ມຕົ້ນຄັ້ງຕໍ່ໄປ

source: %sState:
lo: %sສະຖານະ:

source: Uninstall on next start (unless needed by an installed package)
lo: ຖອນການຕິດຕັ້ງໃນການເລີ່ມຕົ້ນຄັ້ງຕໍ່ໄປ (ເວັ້ນແຕ່ຕ້ອງການໂດຍແພັກເກັດທີ່ຕິດຕັ້ງຢູ່)

# lazarusidestrconsts.lispckexpluninstallpackage
source: Uninstall package %s
lo: ຖອນການຕິດຕັ້ງແພັກເກັດ %s

source: Add options to dependent packages and projects
lo: ເພີ່ມຕົວເລືອກໃສ່ແພັກເກັດແລະໂຄງການທີ່ກ່ຽວຂ້ອງ

source: Add paths to dependent packages/projects
lo: ເພີ່ມເສັ້ນທາງໃສ່ແພັກເກັດ/ໂຄງການທີ່ກ່ຽວຂ້ອງ

source: Author
lo: ຜູ້ຂຽນ

source: Automatically rebuild as needed
lo: Rebuild ອັດຕະໂນມັດຕາມຄວາມຕ້ອງການ

source: Auto rebuild when rebuilding all
lo: Rebuild ອັດຕະໂນມັດເມື່ອ Rebuild ທັງໝົດ

# lazarusidestrconsts.lispckoptscustom
source: Custom
lo: ກຳນົດເອງ

source: Description / Abstract
lo: ຄຳອະທິບາຍ / ບົດຄັດຫຍໍ້

source: Designtime and runtime
lo: Designtime ແລະ runtime

source: IDE Integration
lo: ການເຊື່ອມໂຍງ IDE

source: Invalid package type
lo: ຊະນິດແພັກເກັດບໍ່ຖືກຕ້ອງ

source: Library
lo: ໄລບຣາຣີ

source: License
lo: ໃບອະນຸຍາດ

source: Major
lo: ຫຼັກ

source: Manual compilation (never automatically)
lo: ການ Compile ດ້ວຍຕົນເອງ (ບໍ່ເຄີຍອັດຕະໂນມັດ)

source: Minor
lo: ຮອງ

source: Object
lo: ວັດຖຸ

source: Package type
lo: ຊະນິດແພັກເກັດ

source: Provides
lo: ໃຫ້

source: The package "%s" has the auto install flag.%sThis means it will be installed in the IDE.%sInstallation packages must be designtime Packages.
lo: ແພັກເກັດ "%s" ມີທຸງ auto install.%sນີ້ໝາຍຄວາມວ່າມັນຈະຖືກຕິດຕັ້ງໃນ IDE.%sແພັກເກັດຕິດຕັ້ງຕ້ອງເປັນ Designtime Packages.

source: This package provides the same as the following packages:
lo: ແພັກເກັດນີ້ໃຫ້ສິ່ງດຽວກັນກັບແພັກເກັດຕໍ່ໄປນີ້:

source: Update / Rebuild
lo: ອັບເດດ / Rebuild

source: Usage
lo: ການນຳໃຊ້

source: Package:
lo: ແພັກເກັດ:

source: Search paths for fpdoc xml files. Multiple paths must be separated by semicolon.
lo: ເສັ້ນທາງຄົ້ນຫາສຳລັບໄຟລ໌ fpdoc xml. ຫຼາຍເສັ້ນທາງຕ້ອງແຍກດ້ວຍ semicolon.

source: Show unneeded dependencies
lo: ສະແດງ dependencies ທີ່ບໍ່ຈຳເປັນ

source: When the form is saved, the IDE can store all TTranslateString properties to the package po file. For this you must enable I18N for this package, provide a po output directory and leave this option unchecked.
lo: ເມື່ອຟອມຖືກບັນທຶກ, IDE ສາມາດເກັບຄຸນສົມບັດ TTranslateString ທັງໝົດລົງໄຟລ໌ po ຂອງແພັກເກັດ. ສຳລັບສິ່ງນີ້ ເຈົ້າຕ້ອງເປີດໃຊ້ I18N ສຳລັບແພັກເກັດນີ້, ລະບຸໂຟນເດີຜົນລັບ po ແລະ ປະຕົວເລືອກນີ້ໄວ້ໂດຍບໍ່ຕ້ອງໝາຍຕິກ.

# lazarusidestrconsts.lispdabort
source: Abort
lo: ຍົກເລີກ

source: Progress
lo: ຄວາມຄືບໜ້າ

source: Collapse directory
lo: ຫຍໍ້ໂຟນເດີ

source: Conflict found
lo: ພົບຂໍ້ຂັດແຍ່ງ

source: Edit Virtual Unit
lo: ແກ້ໄຂ Virtual Unit

source: Expand directory
lo: ຂະຫຍາຍໂຟນເດີ

source: Filename:
lo: ຊື່ໄຟລ໌:

source: Fix Files Case
lo: ແກ້ໄຂຕົວພິມຂອງໄຟລ໌

source: Invalid unit filename
lo: ຊື່ໄຟລ໌ Unit ບໍ່ຖືກຕ້ອງ

source: Invalid unitname
lo: ຊື່ Unit ບໍ່ຖືກຕ້ອງ

source: Missing files of package %s
lo: ໄຟລ໌ທີ່ຂາດໄປຂອງແພັກເກັດ %s

source: New file not in include path
lo: ໄຟລ໌ໃໝ່ບໍ່ຢູ່ໃນ include path

# lazarusidestrconsts.lispenofilesmissingallfilesexist
source: No files missing. All files exist.
lo: ບໍ່ມີໄຟລ໌ຂາດຫາຍ. ໄຟລ໌ທັງໝົດມີຢູ່.

source: Please disable alphabetical sorting if you need to reorder items manually.
lo: ກະລຸນາປິດການລຽງລຳດັບຕາມຕົວອັກສອນ ຖ້າເຈົ້າຕ້ອງການຈັດລຽງລາຍການໃໝ່ດ້ວຍຕົນເອງ.

source: Remove files
lo: ລຶບໄຟລ໌

source: Revert Package
lo: ຍ້ອນກັບແພັກເກັດ

source: Save Package As ...
lo: ບັນທຶກແພັກເກັດເປັນ ...

source: Show directory hierarchy
lo: ສະແດງລຳດັບຊັ້ນໂຟນເດີ

source: Show Missing Files
lo: ສະແດງໄຟລ໌ທີ່ຂາດຫາຍ

source: Show properties panel
lo: ສະແດງແຖບຄຸນສົມບັດ

source: Sort Files Permanently
lo: ລຽງລຳດັບໄຟລ໌ຖາວອນ

source: Sort files alphabetically
lo: ລຽງລຳດັບໄຟລ໌ຕາມຕົວອັກສອນ

source: The file "%s" is currently not in the include path of the package.%sAdd "%s" to the include path?
lo: ໄຟລ໌ "%s" ປະຈຸບັນບໍ່ໄດ້ຢູ່ໃນ include path ຂອງແພັກເກັດ.%sເພີ່ມ "%s" ໃສ່ include path ບໍ່?

source: Unitname:
lo: ຊື່ Unit:

source: Use all units in directory
lo: ໃຊ້ Unit ທັງໝົດໃນໂຟນເດີ

source: Use no units in directory
lo: ບໍ່ໃຊ້ Unit ໃດໆໃນໂຟນເດີ

source: Clean up package dependencies
lo: ລ້າງ dependencies ຂອງແພັກເກັດ

source: Clear Selection
lo: ລ້າງການເລືອກ

source: Delete dependencies
lo: ລຶບ dependencies

source: Do you really want to forget all changes to package %s and reload it from file?
lo: ເຈົ້າຕ້ອງການລືມການປ່ຽນແປງທັງໝົດຕໍ່ແພັກເກັດ %s ແລະ ໂຫຼດມັນຄືນໃໝ່ຈາກໄຟລ໌ແທ້ບໍ່?

source: New unit not in unitpath
lo: Unit ໃໝ່ບໍ່ຢູ່ໃນ unitpath

source: Publish Package
lo: ເຜີຍແຜ່ແພັກເກັດ

source: Revert package?
lo: ຍ້ອນກັບແພັກເກັດບໍ່?

source: The file "%s"%sis currently not in the unit path of the package.%sAdd "%s" to unit path?
lo: ໄຟລ໌ "%s"%sປະຈຸບັນບໍ່ໄດ້ຢູ່ໃນ unit path ຂອງແພັກເກັດ.%sເພີ່ມ "%s" ໃສ່ unit path ບໍ່?

source: More functions for the package
lo: ຟັງຊັນເພີ່ມເຕີມສຳລັບແພັກເກັດ

source: %sAdding new Dependency for package %s: package %s
lo: %sກຳລັງເພີ່ມ Dependency ໃໝ່ສຳລັບແພັກເກັດ %s: ແພັກເກັດ %s

source: %sAdding new Dependency for project %s: package %s
lo: %sກຳລັງເພີ່ມ Dependency ໃໝ່ສຳລັບໂຄງການ %s: ແພັກເກັດ %s

source: Add unit to uses clause of package main file. Disable this only for units that should not be compiled in all cases.
lo: ເພີ່ມ Unit ໃສ່ uses clause ຂອງໄຟລ໌ຫຼັກຂອງແພັກເກັດ. ປິດສິ່ງນີ້ສະເພາະສຳລັບ Unit ທີ່ບໍ່ຄວນຖືກ compile ໃນທຸກກໍລະນີ.

source: Ambiguous units found
lo: ພົບ Unit ທີ່ບໍ່ຊັດເຈນ (ຊໍ້າກັນ)

source: Automatically installed packages
lo: ແພັກເກັດທີ່ຕິດຕັ້ງອັດຕະໂນມັດ

source: %sBoth packages are connected. This means, either one package uses the other, or they are both used by a third package.
lo: %sທັງສອງແພັກເກັດເຊື່ອມຕໍ່ກັນ. ນີ້ໝາຍຄວາມວ່າ, ແພັກເກັດໜຶ່ງໃຊ້ແພັກເກັດອື່ນ, ຫຼື ທັງສອງຖືກໃຊ້ໂດຍແພັກເກັດທີສາມ.

source: Broken dependency
lo: Dependency ທີ່ເສຍຫາຍ

source: Circular dependencies found
lo: ພົບ dependencies ທີ່ວົນຮອບ

source: Delete Old Package File?
lo: ລຶບໄຟລ໌ແພັກເກັດເກົ່າບໍ່?

source: Delete old package file "%s"?
lo: ລຶບໄຟລ໌ແພັກເກັດເກົ່າ "%s" ບໍ່?

source: Dependency without Owner: %s
lo: Dependency ທີ່ບໍ່ມີເຈົ້າຂອງ: %s

source: Error Reading Package
lo: ຜິດພາດໃນການອ່ານແພັກເກັດ

source: Error Writing Package
lo: ຜິດພາດໃນການຂຽນແພັກເກັດ

source: File is already in package
lo: ໄຟລ໌ຢູ່ໃນແພັກເກັດແລ້ວ

source: File is in Project
lo: ໄຟລ໌ຢູ່ໃນໂຄງການ

source: Filename differs from Packagename
lo: ຊື່ໄຟລ໌ແຕກຕ່າງຈາກຊື່ແພັກເກັດ

source: Filename is used by other package
lo: ຊື່ໄຟລ໌ຖືກໃຊ້ໂດຍແພັກເກັດອື່ນ

source: Filename is used by project
lo: ຊື່ໄຟລ໌ຖືກໃຊ້ໂດຍໂຄງການ

# lazarusidestrconsts.lispkgmangfilenotfound
source: File "%s" not found.
lo: ບໍ່ພົບໄຟລ໌ "%s".

source: File not saved
lo: ໄຟລ໌ບໍ່ໄດ້ບັນທຶກ

source: Installing the package %s will automatically install the package:
lo: ການຕິດຕັ້ງແພັກເກັດ %s ຈະຕິດຕັ້ງແພັກເກັດຕໍ່ໄປນີ້ໂດຍອັດຕະໂນມັດ:

source: Installing the package %s will automatically install the packages:
lo: ການຕິດຕັ້ງແພັກເກັດ %s ຈະຕິດຕັ້ງແພັກເກັດຕໍ່ໄປນີ້ໂດຍອັດຕະໂນມັດ:

source: Invalid file extension
lo: ນາມສະກຸນໄຟລ໌ບໍ່ຖືກຕ້ອງ

source: Invalid package file extension
lo: ນາມສະກຸນໄຟລ໌ແພັກເກັດບໍ່ຖືກຕ້ອງ

source: Invalid package filename
lo: ຊື່ໄຟລ໌ແພັກເກັດບໍ່ຖືກຕ້ອງ

source: Invalid package name
lo: ຊື່ແພັກເກັດບໍ່ຖືກຕ້ອງ

source: Invalid Package Name
lo: ຊື່ແພັກເກັດບໍ່ຖືກຕ້ອງ

source: Loading package %s will replace package %s%sfrom file %s.%sThe old package is modified.%sSave old package %s?
lo: ການໂຫຼດແພັກເກັດ %s ຈະແທນທີ່ແພັກເກັດ %s%sຈາກໄຟລ໌ %s.%sແພັກເກັດເກົ່າຖືກແກ້ໄຂ.%sບັນທຶກແພັກເກັດເກົ່າ %s ບໍ່?

source: Package: %s
lo: ແພັກເກັດ: %s

source: Package conflicts
lo: ແພັກເກັດຂັດແຍ່ງກັນ

source: Package is not a designtime package
lo: ແພັກເກັດບໍ່ແມ່ນ designtime package

source: Package is required
lo: ແພັກເກັດເປັນທີ່ຕ້ອງການ

source: Package name already exists
lo: ຊື່ແພັກເກັດມີຢູ່ແລ້ວ

source: Packages must have the extension .lpk
lo: ແພັກເກັດຕ້ອງມີນາມສະກຸນ .lpk

source: Please compile the package first.
lo: ກະລຸນາ compile ແພັກເກັດກ່ອນ.

source: Please save the file before adding it to a package.
lo: ກະລຸນາບັນທຶກໄຟລ໌ກ່ອນທີ່ຈະເພີ່ມມັນເຂົ້າໃນແພັກເກັດ.

source: Project: %s
lo: ໂຄງການ: %s

source: Rebuild Lazarus?
lo: Rebuild Lazarus ບໍ່?

source: Rename File lowercase?
lo: ປ່ຽນຊື່ໄຟລ໌ເປັນຕົວພິມນ້ອຍບໍ່?

source: Replace existing file "%s"?
lo: ແທນທີ່ໄຟລ໌ທີ່ມີຢູ່ "%s" ບໍ່?

source: Replace File
lo: ແທນທີ່ໄຟລ໌

source: One or more required packages were not found. See package graph for details.
lo: ບໍ່ພົບແພັກເກັດທີ່ຕ້ອງການໜຶ່ງ ຫຼື ຫຼາຍກວ່ານັ້ນ. ເບິ່ງ package graph ສຳລັບລາຍລະອຽດ.

source: The package %s is already open in the IDE. You cannot save a package with the same name.
lo: ແພັກເກັດ %s ເປີດຢູ່ໃນ IDE ແລ້ວ. ເຈົ້າບໍ່ສາມາດບັນທຶກແພັກເກັດທີ່ມີຊື່ດຽວກັນໄດ້.

source: Save package?
lo: ບັນທຶກແພັກເກັດບໍ່?

source: Save Package %s (*.lpk)
lo: ບັນທຶກແພັກເກັດ %s (*.lpk)

source: Should the file be renamed lowercase to%s"%s"?
lo: ຄວນປ່ຽນຊື່ໄຟລ໌ເປັນຕົວພິມນ້ອຍເປັນ%s"%s" ບໍ່?

source: Skip this package
lo: ຂ້າມແພັກເກັດນີ້

# lazarusidestrconsts.lispkgmangthefileisalreadyinthepackage
source: The file "%s"%sis already in the package %s.
lo: ໄຟລ໌ "%s"%sຢູ່ໃນແພັກເກັດ %s ແລ້ວ.

source: The file "%s" is not a Lazarus package.
lo: ໄຟລ໌ "%s" ບໍ່ແມ່ນແພັກເກັດ Lazarus.

source: The filename "%s" does not correspond to the package name "%s" in the file.%sChange package name to "%s"?
lo: ຊື່ໄຟລ໌ "%s" ບໍ່ກົງກັບຊື່ແພັກເກັດ "%s" ໃນໄຟລ໌.%sປ່ຽນຊື່ແພັກເກັດເປັນ "%s" ບໍ່?

source: The file name "%s" is part of the current project.%sProjects and Packages should not share files.
lo: ຊື່ໄຟລ໌ "%s" ແມ່ນສ່ວນໜຶ່ງຂອງໂຄງການປະຈຸບັນ.%sໂຄງການ ແລະ ແພັກເກັດບໍ່ຄວນໃຊ້ໄຟລ໌ຮ່ວມກັນ.

source: The file name "%s" is used by%sthe package "%s"%sin file "%s".
lo: ຊື່ໄຟລ໌ "%s" ຖືກໃຊ້ໂດຍ%sແພັກເກັດ "%s"%sໃນໄຟລ໌ "%s".

source: The following package failed to load:
lo: ແພັກເກັດຕໍ່ໄປນີ້ໂຫຼດບໍ່ສຳເລັດ:

source: The following packages failed to load:
lo: ແພັກເກັດຕໍ່ໄປນີ້ໂຫຼດບໍ່ສຳເລັດ:

source: %sThe following units will be added to the uses section of%s%s:%s%s
lo: %sUnit ຕໍ່ໄປນີ້ຈະຖືກເພີ່ມໃສ່ uses section ຂອງ%s%s:%s%s

source: The package file name "%s" in%s"%s" is not a valid Lazarus package name.
lo: ຊື່ໄຟລ໌ແພັກເກັດ "%s" ໃນ%s"%s" ບໍ່ແມ່ນຊື່ແພັກເກັດ Lazarus ທີ່ຖືກຕ້ອງ.

source: The package %s is a runtime only package.%sRuntime only packages cannot be installed in the IDE.
lo: ແພັກເກັດ %s ແມ່ນແພັກເກັດ runtime ເທົ່ານັ້ນ.%sແພັກເກັດ Runtime only ບໍ່ສາມາດຕິດຕັ້ງໃນ IDE ໄດ້.

source: The package "%s" is compiled automatically and its output directory is "%s" which is in the default unit search path of the compiler. The package uses other packages which also use the default unit search of the compiler. This creates an endless loop.%sYou can fix this issue by removing the path from your compiler config (e.g. fpc.cfg)%sor by disabling the auto update of this package or by removing dependencies.
lo: ແພັກເກັດ "%s" ຖືກ compile ອັດຕະໂນມັດ ແລະ ໂຟນເດີຜົນລັບຂອງມັນແມ່ນ "%s" ເຊິ່ງຢູ່ໃນ default unit search path ຂອງ compiler. ແພັກເກັດໃຊ້ແພັກເກັດອື່ນເຊິ່ງໃຊ້ default unit search ຂອງ compiler ເຊັ່ນກັນ. ສິ່ງນີ້ສ້າງ endless loop.%sເຈົ້າສາມາດແກ້ໄຂບັນຫານີ້ໄດ້ໂດຍການເອົາເສັ້ນທາງອອກຈາກການຕັ້ງຄ່າ compiler ຂອງເຈົ້າ (ເຊັ່ນ: fpc.cfg)%sຫຼື ໂດຍການປິດການອັບເດດອັດຕະໂນມັດຂອງແພັກເກັດນີ້ ຫຼື ໂດຍການເອົາ dependencies ອອກ.

source: The package "%s" is marked for installation but cannot be found.%sRemove dependency from the installation list of packages?
lo: ແພັກເກັດ "%s" ຖືກໝາຍໄວ້ສຳລັບການຕິດຕັ້ງ ແຕ່ບໍ່ພົບ.%sເອົາ dependency ອອກຈາກລາຍການຕິດຕັ້ງຂອງແພັກເກັດບໍ່?
