Repository: fpc/Lazarus
Catalog: languages/lazaruside.*.po
Languages: lo

source: Fppkg compiler configuration: %s
lo: ການຕັ້ງຄ່າ Fppkg compiler: %s

source: Use this screen to generate new Fppkg configuration files with the fpcmkcfg tool.
lo: ໃຊ້ໜ້າຈໍນີ້ເພື່ອສ້າງໄຟລ໌ການຕັ້ງຄ່າ Fppkg ໃໝ່ດ້ວຍເຄື່ອງມື fpcmkcfg.

source: Generate new Fppkg configuration files
lo: ສ້າງໄຟລ໌ການຕັ້ງຄ່າ Fppkg ໃໝ່

source: Print a list of build modes in the project. Active mode is listed first.
lo: ພິມລາຍການ build modes ໃນໂປຣເຈັກ. ໂໝດທີ່ໃຊ້ງານຢູ່ຈະຢູ່ທຳອິດ.

source: Print the result of substituting macros in the text. The absence of macros means the name of the macro. In case of an error, returns only the text with partially expanded macros and sets the error code (also for an empty string). Takes into account the active (or specified via --bm option) build mode.
lo: ພິມຜົນຂອງການແທນທີ່ macros ໃນຂໍ້ຄວາມ. ການບໍ່ມີ macros ໝາຍຄວາມວ່າຊື່ຂອງ macro. ໃນກໍລະນີທີ່ເກີດຂໍ້ຜິດພາດ, ຈະສົ່ງຄືນພຽງແຕ່ຂໍ້ຄວາມທີ່ມີ macros ທີ່ຂະຫຍາຍອອກບາງສ່ວນ ແລະ ຕັ້ງລະຫັດຜິດພາດ (ລວມທັງ string ຫວ່າງ). ພິຈາລະນາ build mode ທີ່ໃຊ້ງານຢູ່ (ຫຼື ລະບຸຜ່ານ --bm).

source: get word at current cursor position
lo: ເອົາຄຳສັບທີ່ຕຳແໜ່ງ cursor ປັດຈຸບັນ

source: Get word at current cursor position.
lo: ເອົາຄຳສັບທີ່ຕຳແໜ່ງ cursor ປັດຈຸບັນ.

source: Global settings
lo: ການຕັ້ງຄ່າ Global

source: Goto Line
lo: ໄປທີ່ແຖວ

source: <description> Copyright (C) <year> <name of author> <contact> This source is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. This code is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. A copy of the GNU General Public License is available on the World Wide Web at <http://www.gnu.org/copyleft/gpl.html>. You can also obtain it by writing to the Free Software Foundation, Inc., 51 Franklin Street - Fifth Floor, Boston, MA 02110-1335, USA.
lo: <description> Copyright (C) <year> <name of author> <contact> Source ນີ້ແມ່ນຊອບແວເສລີ; ເຈົ້າສາມາດແຈກຢາຍມັນຕໍ່ ແລະ/ຫຼື ແກ້ໄຂມັນພາຍໃຕ້ເງື່ອນໄຂຂອງ GNU General Public License ຕາມທີ່ເຜີຍແຜ່ໂດຍ Free Software Foundation; ບໍ່ວ່າຈະເປັນ version 2 ຂອງ License, ຫຼື (ຕາມທີ່ເຈົ້າເລືອກ) version ໃດໆຫຼັງຈາກນັ້ນ. Code ນີ້ຖືກແຈກຢາຍດ້ວຍຄວາມຫວັງວ່າມັນຈະເປັນປະໂຫຍດ, ແຕ່ ປາສະຈາກການຮັບປະກັນໃດໆ; ໂດຍບໍ່ມີການຮັບປະກັນ MERCHANTABILITY ຫຼື FITNESS FOR A PARTICULAR PURPOSE. ເບິ່ງ GNU General Public License ສຳລັບລາຍລະອຽດເພີ່ມເຕີມ. ສຳເນົາຂອງ GNU General Public License ສາມາດເບິ່ງໄດ້ທີ່ World Wide Web ທີ່ <http://www.gnu.org/copyleft/gpl.html>. ເຈົ້າຍັງສາມາດຂໍໄດ້ໂດຍການຂຽນຫາ Free Software Foundation, Inc., 51 Franklin Street - Fifth Floor, Boston, MA 02110-1335, USA.

source: Group
lo: ກຸ່ມ

source: Group automatically defined local variables
lo: ຈັດກຸ່ມຕົວປ່ຽນ local ທີ່ກຳນົດອັດຕະໂນມັດ

source: Enable or disable groups of debug output. Valid options are:
lo: ເປີດ ຫຼື ປິດ ກຸ່ມຂອງ debug output. ຕົວເລືອກທີ່ໃຊ້ໄດ້ແມ່ນ:

source: Grow to Largest
lo: ຂະຫຍາຍໃຫ້ໃຫຍ່ທີ່ສຸດ

source: Margin
lo: ຂອບ (Margin)

source: Visible
lo: ເບິ່ງເຫັນໄດ້

source: Width
lo: ຄວາມກວ້າງ

source: Has Help
lo: ມີ Help

source: Header colors
lo: ສີຂອງ Header

source: Header comment for class
lo: Header comment ສຳລັບ class

source: Help entries
lo: ລາຍການ Help

source: Help for Free Pascal Compiler message
lo: Help ສຳລັບຂໍ້ຄວາມ Free Pascal Compiler

source: Hide all hints and warnings by inserting IDE directives {%H-}
lo: ເຊື່ອງ hints ແລະ warnings ທັງໝົດໂດຍການແຊກ IDE directives {%H-}

source: Hide message at %s by inserting IDE directive {%H-}
lo: ເຊື່ອງຂໍ້ຄວາມທີ່ %s ໂດຍການແຊກ IDE directive {%H-}

source: Hide message by inserting IDE directive {%H-}
lo: ເຊື່ອງຂໍ້ຄວາມໂດຍການແຊກ IDE directive {%H-}

source: Hide message by inserting {$warn %s off} to unit "%s"
lo: ເຊື່ອງຂໍ້ຄວາມໂດຍການແຊກ {$warn %s off} ໃສ່ unit "%s"

source: Hide Search
lo: ເຊື່ອງການຄົ້ນຫາ

# lazarusidestrconsts.lishidewindow
source: Hide window
lo: ເຊື່ອງໜ້າຕ່າງ

source: Hide with package option (-vm%s)
lo: ເຊື່ອງດ້ວຍຕົວເລືອກແພັກເກັດ (-vm%s)

source: Hide with project option (-vm%s)
lo: ເຊື່ອງດ້ວຍຕົວເລືອກໂປຣເຈັກ (-vm%s)

# lazarusidestrconsts.lishint
source: Hint
lo: ຄຳແນະນຳ (Hint)

source: Hint: A default value can be defined in the conditionals.
lo: Hint: ຄ່າເລີ່ມຕົ້ນສາມາດກຳນົດໄດ້ໃນ conditionals.

source: A hint at property's name shows its description.
lo: hint ທີ່ຊື່ property ສະແດງຄຳອະທິບາຍຂອງມັນ.

source: Hint: Check if two packages contain a unit with the same name.
lo: Hint: ກວດສອບວ່າສອງແພັກເກັດມີ unit ທີ່ມີຊື່ດຽວກັນບໍ່.

source: Hint: Click on "Show Options" to find out where inherited paths are coming from.
lo: Hint: ຄລິກທີ່ "Show Options" ເພື່ອຊອກຫາວ່າ inherited paths ມາຈາກໃສ.

source: Hint: The "Make Resourcestring" function expects a string constant.%sPlease select the expression and try again.
lo: Hint: ຟັງຊັນ "Make Resourcestring" ຕ້ອງການ string constant.%sກະລຸນາເລືອກ expression ແລ້ວລອງໃໝ່ອີກຄັ້ງ.

source: View Forms
lo: ເບິ່ງ Forms

source: View Units
lo: ເບິ່ງ Units

source: Databases
lo: ຖານຂໍ້ມູນ

source: Help Options
lo: ຕົວເລືອກ Help

source: Horizontal
lo: ລວງນອນ

source: Horizontal lines between properties.
lo: ເສັ້ນລວງນອນລະຫວ່າງ properties.

source: Additional info to display in the IDE title
lo: ຂໍ້ມູນເພີ່ມເຕີມທີ່ຈະສະແດງໃນຫົວຂໍ້ IDE

source: The IDE will be recompiled and restarted during installation/uninstallation of packages.
lo: IDE ຈະຖືກ recompile ແລະ restart ລະຫວ່າງການຕິດຕັ້ງ/ຖອນການຕິດຕັ້ງແພັກເກັດ.

source: Welcome to Lazarus.%0:sThe IDE configuration found was previously used by another installation of Lazarus.%0:sIf you have two or more separate installations of Lazarus, they should not share the same configuration. This may lead to conflicts and your Lazarus installations may become unusable.%0:s%0:sIf you have only one installation and copied or moved the Lazarus executable, then you may upgrade this configuration.%0:s%1:s%0:s%0:sChoose:%0:s%0:s* Update info: Use this configuration and update it for being used with this Lazarus in future. The old installation will no longer use this.%0:s* Ignore: Use this configuration but keep the warning. This may lead to conflicts with the other installation.%0:s* Abort: Exit now. You can then fix the problem by starting this Lazarus with the correct configuration.%0:s%0:sAdditional information:%0:sThis configuration is at: %2:s%0:sIt belongs to the Lazarus installation at: %3:s%0:sThe current IDE was started from: %4:s%0:s
lo: ຍິນດີຕ້ອນຮັບສູ່ Lazarus.%0:sການຕັ້ງຄ່າ IDE ທີ່ພົບຖືກໃຊ້ໂດຍການຕິດຕັ້ງອື່ນຂອງ Lazarus ມາກ່ອນ.%0:sຖ້າເຈົ້າມີ Lazarus ສອງໂຕ ຫຼື ຫຼາຍກວ່າຕິດຕັ້ງແຍກກັນ, ພວກມັນບໍ່ຄວນໃຊ້ການຕັ້ງຄ່າດຽວກັນ. ສິ່ງນີ້ອາດນຳໄປສູ່ຂໍ້ຂັດແຍ່ງ ແລະ Lazarus ຂອງເຈົ້າອາດໃຊ້ງານບໍ່ໄດ້.%0:s%0:sຖ້າເຈົ້າມີການຕິດຕັ້ງດຽວ ແລະ ໄດ້ສຳເນົາ ຫຼື ຍ້າຍ Lazarus executable, ເຈົ້າອາດອັບເກຣດການຕັ້ງຄ່ານີ້ໄດ້.%0:s%1:s%0:s%0:sເລືອກ:%0:s%0:s* ອັບເດດຂໍ້ມູນ: ໃຊ້ການຕັ້ງຄ່ານີ້ ແລະ ອັບເດດມັນເພື່ອໃຊ້ກັບ Lazarus ນີ້ໃນອະນາຄົດ. ການຕິດຕັ້ງເກົ່າຈະບໍ່ໃຊ້ອັນນີ້ອີກຕໍ່ໄປ.%0:s* ບໍ່ສົນໃຈ: ໃຊ້ການຕັ້ງຄ່ານີ້ແຕ່ເກັບຄຳເຕືອນໄວ້. ສິ່ງນີ້ອາດນຳໄປສູ່ຂໍ້ຂັດແຍ່ງກັບການຕິດຕັ້ງອື່ນ.%0:s* ຍົກເລີກ: ອອກດຽວນີ້. ເຈົ້າສາມາດແກ້ໄຂບັນຫາໂດຍການເລີ່ມ Lazarus ນີ້ດ້ວຍການຕັ້ງຄ່າທີ່ຖືກຕ້ອງ.%0:s%0:sຂໍ້ມູນເພີ່ມເຕີມ:%0:sການຕັ້ງຄ່ານີ້ຢູ່ທີ່: %2:s%0:sມັນເປັນຂອງການຕິດຕັ້ງ Lazarus ທີ່: %3:s%0:sIDE ປັດຈຸບັນຖືກເລີ່ມຈາກ: %4:s%0:s

source: Information about the IDE
lo: ຂໍ້ມູນກ່ຽວກັບ IDE

source: The IDE maintains Application.Scaled (Hi-DPI) in main unit.
lo: IDE ຮັກສາ Application.Scaled (Hi-DPI) ໃນ main unit.

source: The IDE maintains the title in main unit.
lo: IDE ຮັກສາຫົວຂໍ້ (title) ໃນ main unit.

source: Identifier begins with ...
lo: Identifier ຂຶ້ນຕົ້ນດ້ວຍ ...

source: Identifier "%s" cannot be dotted
lo: Identifier "%s" ບໍ່ສາມາດມີຈຸດໄດ້

source: Identifier cannot be empty
lo: Identifier ບໍ່ສາມາດຫວ່າງໄດ້

source: Identifier contains ...
lo: Identifier ປະກອບດ້ວຍ ...

source: Identifier "%s" is already used
lo: Identifier "%s" ຖືກໃຊ້ແລ້ວ

source: Identifier "%s" is already used.
lo: Identifier "%s" ຖືກໃຊ້ແລ້ວ.

source: Identifier "%s" is a declared compiler function.
lo: Identifier "%s" ແມ່ນ compiler function ທີ່ຖືກປະກາດໄວ້.

source: Identifier "%s" is a declared compiler procedure.
lo: Identifier "%s" ແມ່ນ compiler procedure ທີ່ຖືກປະກາດໄວ້.

source: Identifier "%s" is invalid
lo: Identifier "%s" ບໍ່ຖືກຕ້ອງ

source: Identifier "%s" is a reserved word
lo: Identifier "%s" ແມ່ນ reserved word

source: IDE Options:
lo: ຕົວເລືອກ IDE:

source: Custom IDE title
lo: ຫົວຂໍ້ IDE ແບບກຳນົດເອງ

source: IDE main window and taskbar title
lo: ຫົວຂໍ້ IDE main window ແລະ taskbar

source: Show custom IDE title before built-in IDE title or info
lo: ສະແດງຫົວຂໍ້ IDE ແບບກຳນົດເອງກ່ອນຫົວຂໍ້ IDE ທີ່ມີຢູ່ ຫຼື ຂໍ້ມູນ

source: All build modes
lo: Build modes ທັງໝົດ

source: Compiler options of
lo: ຕົວເລືອກ Compiler ຂອງ

source: Current build mode
lo: Build mode ປັດຈຸບັນ

source: Error opening XML
lo: ເກີດຂໍ້ຜິດພາດໃນການເປີດ XML

source: Error opening XML file "%s":%s%s
lo: ເກີດຂໍ້ຜິດພາດໃນການເປີດໄຟລ໌ XML "%s":%s%s

source: Export Compiler Options
lo: ສົ່ງອອກຕົວເລືອກ Compiler

source: Export file exists
lo: ໄຟລ໌ສົ່ງອອກມີຢູ່ແລ້ວ

source: Export file "%s" exists.%sOpen file and replace only compiler options?%s(Other settings will be kept.)
lo: ໄຟລ໌ສົ່ງອອກ "%s" ມີຢູ່ແລ້ວ.%sເປີດໄຟລ໌ ແລະ ແທນທີ່ສະເພາະຕົວເລືອກ compiler ບໍ່?%s(ການຕັ້ງຄ່າອື່ນໆຈະຖືກເກັບໄວ້.)

source: Import Compiler Options
lo: ນຳເຂົ້າຕົວເລືອກ Compiler

source: Load from file
lo: ໂຫຼດຈາກໄຟລ໌

source: File "%s" does not contain compiler options.
lo: ໄຟລ໌ "%s" ບໍ່ມີຕົວເລືອກ compiler.

source: Save to file
lo: ບັນທຶກລົງໄຟລ໌

source: If not checked:
lo: ຖ້າບໍ່ໄດ້ໝາຍຕິກ:

source: If only the session info changed, ask about saving it.
lo: ຖ້າມີພຽງຂໍ້ມູນ session ປ່ຽນແປງ, ໃຫ້ຖາມກ່ຽວກັບການບັນທຶກມັນ.

source: If you want to use two different Lazarus versions you must start the second Lazarus with the command line parameter primary-config-path or pcp.%sFor example:
lo: ຖ້າເຈົ້າຕ້ອງການໃຊ້ Lazarus ສອງເວີຊັນທີ່ແຕກຕ່າງກັນ ເຈົ້າຕ້ອງເລີ່ມ Lazarus ໂຕທີສອງດ້ວຍ command line parameter primary-config-path ຫຼື pcp.%sຕົວຢ່າງ:

source: Ignore all
lo: ບໍ່ສົນໃຈທັງໝົດ

source: Ignore, use %s as ancestor
lo: ບໍ່ສົນໃຈ, ໃຊ້ %s ເປັນ ancestor

source: Imitate indentation of current unit, project or package
lo: ຮຽນແບບການຫຍໍ້ໜ້າຂອງ unit, ໂປຣເຈັກ ຫຼື ແພັກເກັດປັດຈຸບັນ

source: Implementation comment for class
lo: Implementation comment ສຳລັບ class

# lazarusidestrconsts.lisimport
source: Import
lo: ນຳເຂົ້າ

# lazarusidestrconsts.lisimportant
source: Important
lo: ສຳຄັນ

# lazarusidestrconsts.lisimportenvironmentoptions
source: Import environment options
lo: ນຳເຂົ້າຕົວເລືອກ environment

source: Import from File
lo: ນຳເຂົ້າຈາກໄຟລ໌

source: Importing BuildModes is not supported for packages.
lo: ການນຳເຂົ້າ BuildModes ບໍ່ຮອງຮັບສຳລັບແພັກເກັດ.

source: Import package list
lo: ນຳເຂົ້າລາຍການແພັກເກັດ

source: Impossible
lo: ເປັນໄປບໍ່ໄດ້

source: In a source directory of the package "%s".
lo: ໃນໄດເຣັກທໍຣີ source ຂອງແພັກເກັດ "%s".

source: In a source directory of the project. Check for duplicates.
lo: ໃນໄດເຣັກທໍຣີ source ຂອງໂປຣເຈັກ. ກວດສອບການຊ້ຳກັນ.

source: Including LFM files
lo: ລວມໄຟລ໌ LFM

source: , incompatible ppu=%s
lo: , ບໍ່ເຂົ້າກັນ ppu=%s

source: Incorrect configuration directory found
lo: ພົບໄດເຣັກທໍຣີການຕັ້ງຄ່າທີ່ບໍ່ຖືກຕ້ອງ

source: there is a problem with the Fppkg configuration. (%s)
lo: ມີບັນຫາກັບການຕັ້ງຄ່າ Fppkg. (%s)

source: Indentation for Pascal sources
lo: ການຫຍໍ້ໜ້າສຳລັບ source Pascal

source: Information
lo: ຂໍ້ມູນ

source: Information about %s
lo: ຂໍ້ມູນກ່ຽວກັບ %s

source: Information about used FPC
lo: ຂໍ້ມູນກ່ຽວກັບ FPC ທີ່ໃຊ້

source: In FPC unit search path. Probably installed by the FPC package. Check if the compiler and the ppu file are from the same installation.
lo: ໃນ FPC unit search path. ອາດຈະຕິດຕັ້ງໂດຍແພັກເກັດ FPC. ກວດສອບວ່າ compiler ແລະ ໄຟລ໌ ppu ມາຈາກການຕິດຕັ້ງດຽວກັນ.

source: In front of related
lo: ຢູ່ທາງໜ້າຂອງອັນທີ່ກ່ຽວຂ້ອງ

source: Initial Checks
lo: ການກວດສອບເບື້ອງຕົ້ນ

source: Initialize Local Variable
lo: Initialize ຕົວປ່ຽນ Local

source: In order to create a clean copy of the project/package, all files in the following directory will be deleted and all its content will be lost.%sDelete all files in "%s"?
lo: ເພື່ອສ້າງສຳເນົາທີ່ສະອາດຂອງໂປຣເຈັກ/ແພັກເກັດ, ໄຟລ໌ທັງໝົດໃນໄດເຣັກທໍຣີຕໍ່ໄປນີ້ຈະຖືກລົບ ແລະ ເນື້ອຫາທັງໝົດຈະຫາຍໄປ.%sລົບໄຟລ໌ທັງໝົດໃນ "%s" ບໍ່?

# lazarusidestrconsts.lisinsert
source: Insert
lo: ແຊກ

source: Insert Assignment %s := ...
lo: ແຊກ Assignment %s := ...

source: insert date
lo: ແຊກວັນທີ

source: insert date and time
lo: ແຊກວັນທີ ແລະ ເວລາ

source: Insert date and time. Optional: format string.
lo: ແຊກວັນທີ ແລະ ເວລາ. ທາງເລືອກ: format string.

source: Insert date. Optional: format string.
lo: ແຊກວັນທີ. ທາງເລືອກ: format string.

source: insert end if needed
lo: ແຊກ end ຖ້າຈຳເປັນ

source: Insert header of current procedure. Optional Parameters (comma separated): WithStart, // proc keyword e.g. 'function', 'class procedure' WithoutClassKeyword,// without 'class' proc keyword AddClassName, // extract/add ClassName. WithoutClassName, // skip classname WithoutName, // skip function name WithoutParamList, // skip param list WithVarModifiers, // extract 'var', 'out', 'const' WithParameterNames, // extract parameter names WithoutParamTypes, // skip colon, param types and default values WithDefaultValues, // extract default values WithResultType, // extract colon + result type WithOfObject, // extract 'of object' WithCallingSpecs, // extract cdecl; inline; WithProcModifiers, // extract forward; alias; external; WithComments, // extract comments and spaces InUpperCase, // turn to uppercase CommentsToSpace, // replace comments with a single space // (default is to skip unnecessary space, // e.g 'Do ;' normally becomes 'Do;' // with this option you get 'Do ;') WithoutBrackets, // skip start- and end-bracket of parameter list WithoutSemicolon, // skip semicolon at end
lo: ແຊກ header ຂອງ procedure ປັດຈຸບັນ. Parameters ທາງເລືອກ (ແຍກດ້ວຍຈຸດ): WithStart, // proc keyword ເຊັ່ນ 'function', 'class procedure' WithoutClassKeyword,// ບໍ່ມີ 'class' proc keyword AddClassName, // ແຍກ/ເພີ່ມ ClassName. WithoutClassName, // ຂ້າມ classname WithoutName, // ຂ້າມ function name WithoutParamList, // ຂ້າມ param list WithVarModifiers, // ແຍກ 'var', 'out', 'const' WithParameterNames, // ແຍກ parameter names WithoutParamTypes, // ຂ້າມ ຈຸດຄູ່ (:), param types ແລະ default values WithDefaultValues, // ແຍກ default values WithResultType, // ແຍກ ຈຸດຄູ່ (:) + result type WithOfObject, // ແຍກ 'of object' WithCallingSpecs, // ແຍກ cdecl; inline; WithProcModifiers, // ແຍກ forward; alias; external; WithComments, // ແຍກ comments ແລະ spaces InUpperCase, // ປ່ຽນເປັນຕົວພິມໃຫຍ່ CommentsToSpace, // ແທນທີ່ comments ດ້ວຍ space ດຽວ // (ຄ່າເລີ່ມຕົ້ນແມ່ນຂ້າມ space ທີ່ບໍ່ຈຳເປັນ, // ເຊັ່ນ 'Do ;' ປົກກະຕິຈະກາຍເປັນ 'Do;' // ດ້ວຍຕົວເລືອກນີ້ເຈົ້າຈະໄດ້ 'Do ;') WithoutBrackets, // ຂ້າມ start- ແລະ end-bracket ຂອງ parameter list WithoutSemicolon, // ຂ້າມ semicolon ທີ່ຢູ່ທ້າຍ

# lazarusidestrconsts.lisinsertmacro
source: Insert Macro
lo: ແຊກ Macro

source: Insert name of current procedure.
lo: ແຊກຊື່ຂອງ procedure ປັດຈຸບັນ.

source: Insert printshort tag
lo: ແຊກ printshort tag

source: insert procedure head
lo: ແຊກ procedure head

source: insert procedure name
lo: ແຊກ procedure name

source: Insert semicolon if needed
lo: ແຊກ semicolon ຖ້າຈຳເປັນ

source: insert time
lo: ແຊກເວລາ

source: Insert time. Optional: format string.
lo: ແຊກເວລາ. ທາງເລືອກ: format string.

source: Insert url tag
lo: ແຊກ url tag

source: In session
lo: ໃນ session

source: installed
lo: ຕິດຕັ້ງແລ້ວ

source: Install it, I like the fat
lo: ຕິດຕັ້ງມັນເລີຍ, ຂ້ອຍມັກແບບຈັດເຕັມ (fat)

source: The following packages are not installed, but available in the main repository: %s. Do you wish to install missing packages?
lo: ແພັກເກັດຕໍ່ໄປນີ້ຍັງບໍ່ໄດ້ຕິດຕັ້ງ, ແຕ່ມີຢູ່ໃນ repository ຫຼັກ: %s. ເຈົ້າຕ້ອງການຕິດຕັ້ງແພັກເກັດທີ່ຂາດໄປບໍ່?

source: Install selection
lo: ຕິດຕັ້ງທີ່ເລືອກ

# lazarusidestrconsts.lisinstalluninstallpackages
source: Install/Uninstall Packages
lo: ຕິດຕັ້ງ/ຖອນການຕິດຕັ້ງ ແພັກເກັດ

source: Instead of compiling a package create a simple Makefile.
lo: ແທນທີ່ຈະ compile ແພັກເກັດ ໃຫ້ສ້າງ Makefile ງ່າຍໆ.

source: Insufficient encoding
lo: ການເຂົ້າລະຫັດບໍ່ພຽງພໍ

source: Invalid Declaration
lo: Declaration ບໍ່ຖືກຕ້ອງ

source: Invalid delete
lo: ການລົບບໍ່ຖືກຕ້ອງ

source: Invalid Executable
lo: Executable ບໍ່ຖືກຕ້ອງ

source: The file "%s" is not executable.
lo: ໄຟລ໌ "%s" ບໍ່ສາມາດ execute ໄດ້.

source: Invalid expression.%sHint: The "Make Resourcestring" function expects a string constant in a single file. Please select the expression and try again.
lo: Expression ບໍ່ຖືກຕ້ອງ.%sHint: ຟັງຊັນ "Make Resourcestring" ຕ້ອງການ string constant ໃນໄຟລ໌ດຽວ. ກະລຸນາເລືອກ expression ແລ້ວລອງໃໝ່.

source: Invalid file name
lo: ຊື່ໄຟລ໌ບໍ່ຖືກຕ້ອງ

source: Invalid filter
lo: Filter ບໍ່ຖືກຕ້ອງ

source: Invalid line, column in message%s%s
lo: ແຖວ, ຖັນ ໃນຂໍ້ຄວາມບໍ່ຖືກຕ້ອງ%s%s

source: Invalid macros in "%s"
lo: Macros ບໍ່ຖືກຕ້ອງໃນ "%s"

source: Invalid macros "%s" in external tool "%s"
lo: Macros ບໍ່ຖືກຕ້ອງ "%s" ໃນ external tool "%s"

source: Invalid macro "%s". The macro name must be a Pascal identifier.
lo: Macro ບໍ່ຖືກຕ້ອງ "%s". ຊື່ macro ຕ້ອງເປັນ Pascal identifier.

source: Invalid macro name "%s". The name is a keyword.
lo: ຊື່ macro ບໍ່ຖືກຕ້ອງ "%s". ຊື່ເປັນ keyword.

source: Invalid Mask
lo: Mask ບໍ່ຖືກຕ້ອງ

source: Invalid mode %s
lo: Mode ບໍ່ຖືກຕ້ອງ %s

source: Invalid multiselection
lo: Multiselection ບໍ່ຖືກຕ້ອງ

source: Invalid Pascal Identifier
lo: Pascal Identifier ບໍ່ຖືກຕ້ອງ

source: The name "%s" is not a valid Pascal identifier.%sUse it anyway?
lo: ຊື່ "%s" ບໍ່ແມ່ນ Pascal identifier ທີ່ຖືກຕ້ອງ.%sໃຊ້ມັນໂລດບໍ່?

source: Invalid proc name
lo: ຊື່ proc ບໍ່ຖືກຕ້ອງ

source: Invalid project filename
lo: ຊື່ໄຟລ໌ໂປຣເຈັກບໍ່ຖືກຕ້ອງ

source: Invalid publishing Directory
lo: ໄດເຣັກທໍຣີ publishing ບໍ່ຖືກຕ້ອງ

source: Invalid selection
lo: ການເລືອກບໍ່ຖືກຕ້ອງ

source: invalid version in %s
lo: ເວີຊັນບໍ່ຖືກຕ້ອງໃນ %s

source: %s is already part of the Project.
lo: %s ເປັນສ່ວນໜຶ່ງຂອງໂປຣເຈັກແລ້ວ.

source: "%s" is an invalid project name.%sPlease choose another (e.g. project1.lpi)
lo: "%s" ເປັນຊື່ໂປຣເຈັກທີ່ບໍ່ຖືກຕ້ອງ.%sກະລຸນາເລືອກຊື່ອື່ນ (ເຊັ່ນ: project1.lpi)

source: %s is a %s.%sThis circular dependency is not allowed.
lo: %s ແມ່ນ %s.%sCircular dependency ນີ້ບໍ່ອະນຸຍາດ.

source: directory not found
lo: ບໍ່ພົບໄດເຣັກທໍຣີ

source: Issues
lo: ບັນຫາ

source: I wonder how you did that. Error in the %s:
lo: ຂ້ອຍສົງໄສວ່າເຈົ້າເຮັດແນວນັ້ນໄດ້ແນວໃດ. ເກີດຂໍ້ຜິດພາດໃນ %s:

source: I wonder how you did that: Error in the base directory:
lo: ຂ້ອຍສົງໄສວ່າເຈົ້າເຮັດແນວນັ້ນໄດ້ແນວໃດ: ເກີດຂໍ້ຜິດພາດໃນ base directory:

# lazarusidestrconsts.lisjhjumphistory
source: Jump History
lo: ປະຫວັດການ Jump

source: Jump to error
lo: ໄປທີ່ຂໍ້ຜິດພາດ

source: When an error in the sources is found at identifier completion, jump to it.
lo: ເມື່ອພົບຂໍ້ຜິດພາດໃນ source ຕອນ identifier completion, ໃຫ້ໄປທີ່ຈຸດນັ້ນ.

source: Jump to procedure %s
lo: ໄປທີ່ procedure %s

source: Keep
lo: ເກັບໄວ້

source: Keep converted files open in editor
lo: ເປີດໄຟລ໌ທີ່ແປງແລ້ວໄວ້ໃນຕົວແກ້ໄຂ

source: All project files will be open in editor after conversion
lo: ໄຟລ໌ໂປຣເຈັກທັງໝົດຈະເປີດໃນຕົວແກ້ໄຂຫຼັງຈາກການແປງ

source: Keep name
lo: ເກັບຊື່ໄວ້

source: Keep open
lo: ເປີດໄວ້

source: Keep absolute indentation, regardless of the current cursor indentation in the text.
lo: ຮັກສາ absolute indentation, ໂດຍບໍ່ສົນໃຈ indentation ຂອງ cursor ປັດຈຸບັນໃນຂໍ້ຄວາມ.

source: Keep them and continue
lo: ເກັບພວກມັນໄວ້ ແລະ ສືບຕໍ່

# lazarusidestrconsts.liskey
source: Key
lo: ປຸ່ມ

# lazarusidestrconsts.liskeycatcustom
source: Custom
lo: ກຳນົດເອງ

source: Key (or 2 key sequence)
lo: ປຸ່ມ (ຫຼື ລຳດັບ 2 ປຸ່ມ)

source: Abort building
lo: ຍົກເລີກການ build

source: Add Address Breakpoint
lo: ເພີ່ມ Address Breakpoint

source: Add Source Breakpoint
lo: ເພີ່ມ Source Breakpoint

source: Add Data/WatchPoint
lo: ເພີ່ມ Data/WatchPoint

# lazarusidestrconsts.liskmaddwatch
source: Add watch
lo: ເພີ່ມ watch

source: Build many modes
lo: Build ຫຼາຍໂໝດ

source: Build project/program
lo: Build ໂປຣເຈັກ/ໂປຣແກຣມ

source: Choose Keymapping scheme
lo: ເລືອກແບບແຜນ Keymapping

source: Classic
lo: ຄລາສສິກ

# lazarusidestrconsts.liskmcleanupandbuild
source: Clean up and build
lo: ລ້າງ ແລະ build

source: Close project
lo: ປິດໂປຣເຈັກ

source: Compile project/program
lo: Compile ໂປຣເຈັກ/ໂປຣແກຣມ

source: Config "Build File"
lo: ຕັ້ງຄ່າ "Build File"

source: Configure Custom Components
lo: ຕັ້ງຄ່າ Custom Components

source: Convert Delphi package to Lazarus package
lo: ແປງແພັກເກັດ Delphi ເປັນແພັກເກັດ Lazarus

source: Convert Delphi Project to Lazarus Project
lo: ແປງໂປຣເຈັກ Delphi ເປັນໂປຣເຈັກ Lazarus

source: Convert Delphi Unit to Lazarus Unit
lo: ແປງ Unit Delphi ເປັນ Unit Lazarus

source: Convert DFM File to LFM
lo: ແປງໄຟລ໌ DFM ເປັນ LFM

source: Copy selected components
lo: ສຳເນົາ components ທີ່ເລືອກ

source: Cut selected components
lo: ຕັດ components ທີ່ເລືອກ

source: Default adapted to macOS
lo: Default ທີ່ປັບໃຫ້ເຂົ້າກັບ macOS

source: Delete last char
lo: ລົບຕົວອັກສອນສຸດທ້າຍ

source: Diff Editor Files
lo: Diff ໄຟລ໌ Editor

source: Edit Code Templates
lo: ແກ້ໄຂ Code Templates

source: Edit context sensitive help
lo: ແກ້ໄຂ context sensitive help

source: External Tools settings
lo: ການຕັ້ງຄ່າ External Tools

source: Inspect
lo: ກວດສອບ (Inspect)

source: Keymapping Scheme
lo: ແບບແຜນ Keymapping

source: Lazarus default
lo: Lazarus ເລີ່ມຕົ້ນ

source: macOS, Apple style
lo: macOS, ແບບ Apple

source: macOS, Lazarus style
lo: macOS, ແບບ Lazarus

source: New package
lo: ແພັກເກັດໃໝ່

source: New project
lo: ໂປຣເຈັກໃໝ່

source: New project from file
lo: ໂປຣເຈັກໃໝ່ຈາກໄຟລ໌

# lazarusidestrconsts.liskmnewunit
source: New Unit
lo: Unit ໃໝ່

source: Note: All keys will be set to the values of the chosen scheme.
lo: ໝາຍເຫດ: ປຸ່ມທັງໝົດຈະຖືກຕັ້ງຄ່າຕາມແບບແຜນທີ່ເລືອກ.

source: Open package file
lo: ເປີດໄຟລ໌ແພັກເກັດ

# lazarusidestrconsts.liskmopenrecent
source: Open Recent
lo: ເປີດລາຍການລ່າສຸດ

source: Open recent package
lo: ເປີດແພັກເກັດລ່າສຸດ

source: Open recent project
lo: ເປີດໂປຣເຈັກລ່າສຸດ

source: Paste Components
lo: ວາງ Components

source: Pause program
lo: ຢຸດໂປຣແກຣມຊົ່ວຄາວ (Pause)

source: Publish project
lo: Publish ໂປຣເຈັກ

source: Quick compile, no linking
lo: Compile ດ່ວນ, ບໍ່ linking

source: Remove Active File from Project
lo: ເອົາໄຟລ໌ທີ່ໃຊ້ຢູ່ອອກຈາກໂປຣເຈັກ

source: Run program
lo: Run ໂປຣແກຣມ

# lazarusidestrconsts.liskmsaveall
source: Save All
lo: ບັນທຶກທັງໝົດ

source: Save As
lo: ບັນທຶກເປັນ

source: Save project
lo: ບັນທຶກໂປຣເຈັກ

source: Save project as
lo: ບັນທຶກໂປຣເຈັກເປັນ

source: Stop Program
lo: ຢຸດໂປຣແກຣມ

source: Toggle between Unit and Form
lo: ສະລັບລະຫວ່າງ Unit ແລະ Form

# lazarusidestrconsts.liskmtoggleviewassembler
source: View Assembler
lo: ເບິ່ງ Assembler

source: View Breakpoints
lo: ເບິ່ງ Breakpoints

# lazarusidestrconsts.liskmtoggleviewcallstack
source: View Call Stack
lo: ເບິ່ງ Call Stack

source: Toggle view Code Browser
lo: ເປີດ/ປິດ ມຸມມອງ Code Browser

source: Toggle view Code Explorer
lo: ເປີດ/ປິດ ມຸມມອງ Code Explorer

source: Toggle View Component Palette
lo: ເປີດ/ປິດ ມຸມມອງ Component Palette

source: View Debugger Event Log
lo: ເບິ່ງ Debugger Event Log

source: View Debugger Output
lo: ເບິ່ງ Debugger Output

source: Toggle view Documentation Editor
lo: ເປີດ/ປິດ ມຸມມອງ Documentation Editor

# lazarusidestrconsts.liskmtoggleviewhistory
source: View History
lo: ເບິ່ງປະຫວັດ (History)

source: Toggle view IDE speed buttons
lo: ເປີດ/ປິດ ມຸມມອງປຸ່ມລັດ IDE

source: View Local Variables
lo: ເບິ່ງຕົວປ່ຽນ Local

source: Toggle view Messages
lo: ເປີດ/ປິດ ມຸມມອງ Messages

source: Toggle view Object Inspector
lo: ເປີດ/ປິດ ມຸມມອງ Object Inspector

# lazarusidestrconsts.liskmtoggleviewpseudoterminal
source: View Console In/Output
lo: ສະແດງ ຄອນໂຊນ ເຂົ້າ/ອອກ
