Repository: fpc/Lazarus
Catalog: languages/lazaruside.*.po
Languages: lo

# lazarusidestrconsts.dlgedcodetempl
source: Code Templates
lo: ແມ່ແບບໂຄ້ດ

source: Add close statement for Pascal blocks
lo: ເພີ່ມຄຳສັ່ງປິດສຳລັບບລັອກ Pascal

source: User defined extension
lo: ນາມສະກຸນທີ່ຜູ້ໃຊ້ກຳນົດ

source: (%s sec delay)
lo: (ໜ່ວງເວລາ %s ວິນາທີ)

source: Display
lo: ການສະແດງຜົນ

source: Editor Files
lo: ໄຟລ໌ບັນນາທິການ

# lazarusidestrconsts.dlgedidcomlet
source: Identifier completion
lo: ການເຕີມເຕັມ Identifier

source: Invert
lo: ກັບຄ່າ

source: Ignore Locks, use longest unused editor
lo: ບໍ່ສົນໃຈການລອກ, ໃຊ້ editor ທີ່ບໍ່ໄດ້ໃຊ້ມາດົນທີ່ສຸດ

source: Ignore Locks, if editor is current
lo: ບໍ່ສົນໃຈການລອກ, ຖ້າ editor ເປັນປັດຈຸບັນ

source: Ignore Locks, if editor in current window
lo: ບໍ່ສົນໃຈການລອກ, ຖ້າ editor ຢູ່ໃນປ່ອງຢ້ຽມປັດຈຸບັນ

source: Locked, if text in view
lo: ລອກ, ຖ້າຂໍ້ຄວາມຢູ່ໃນມຸມມອງ

source: Unlocked
lo: ບໍ່ລອກ

source: Unlocked, if text in centered view
lo: ບໍ່ລອກ, ຖ້າຂໍ້ຄວາມຢູ່ໃນມຸມມອງເຄິ່ງກາງ

source: New tab, existing or new window
lo: ແຖບໃໝ່, ປ່ອງຢ້ຽມທີ່ມີຢູ່ ຫຼື ໃໝ່

source: New tab in new window
lo: ແຖບໃໝ່ໃນປ່ອງຢ້ຽມໃໝ່

source: New tab in existing window
lo: ແຖບໃໝ່ໃນປ່ອງຢ້ຽມທີ່ມີຢູ່

source: Italic
lo: ຕົວອຽງ

source: Use Background color in HTML export
lo: ໃຊ້ສີພື້ນຫຼັງໃນການສົ່ງອອກ HTML

source: (Edit Max Length)
lo: (ແກ້ໄຂຄວາມຍາວສູງສຸດ)

source: Editor font size
lo: ຂະໜາດຟອນບັນນາທິການ

# lazarusidestrconsts.dlgeditoroptions
source: Editor options
lo: ຕົວເລືອກບັນນາທິການ

# lazarusidestrconsts.dlgedmisc
source: Miscellaneous
lo: ເບັດເຕເລັດ

source: Off
lo: ປິດ

source: On
lo: ເປີດ

source: Tab and Indent
lo: ແຖບ ແລະ ຫຍໍ້ໜ້າ

source: Underline
lo: ຂີດກ້ອງ

source: Elastic min Widths
lo: ຄວາມກວ້າງ Elastic ຕ່ຳສຸດ

source: Element Attributes
lo: ຄຸນລັກສະນະອົງປະກອບ

source: End key jumps to nearest end
lo: ປຸ່ມ End ໂດດໄປຫາຈຸດຈົບທີ່ໃກ້ທີ່ສຸດ

source: Ask
lo: ຖາມ

source: Notes: Project files are all files in the project directory
lo: ໝາຍເຫດ: ໄຟລ໌ໂປຣເຈັກແມ່ນໄຟລ໌ທັງໝົດໃນໂຟນເດີໂປຣເຈັກ

source: Backup
lo: ສຳຮອງຂໍ້ມູນ

source: Files
lo: ໄຟລ໌

source: Grid
lo: ຕາຕະລາງ

source: IDE Startup
lo: ການເລີ່ມຕົ້ນ IDE

# lazarusidestrconsts.dlgenvlanguage
source: Language
lo: ພາສາ

# lazarusidestrconsts.dlgenvlanguagerestarthint
source: Restart the IDE to complete the language change.
lo: ຣີສະຕາດ IDE ເພື່ອເຮັດໃຫ້ການປ່ຽນພາສາສົມບູນ.

source: Guide lines
lo: ເສັ້ນນຳທາງ

# lazarusidestrconsts.dlgenvmisc
source: Miscellaneous
lo: ເບັດເຕເລັດ

# lazarusidestrconsts.dlgenvnone
source: None
lo: ບໍ່ມີ

source: Other Files
lo: ໄຟລ໌ອື່ນໆ

source: Tabs for project
lo: ແຖບສຳລັບໂປຣເຈັກ

# lazarusidestrconsts.dlgenvtype
source: Type
lo: ປະເພດ

source: Focus messages at compilation
lo: ໂຟກັສຂໍ້ຄວາມເມື່ອຄອມໄພລ໌

source: Extra character spacing
lo: ໄລຍະຫ່າງຕົວອັກສອນພິເສດ

source: Extra line spacing
lo: ໄລຍະຫ່າງແຖວພິເສດ

source: Use external debug symbols file
lo: ໃຊ້ໄຟລ໌ debug symbols ພາຍນອກ

source: Opening Files from OS
lo: ການເປີດໄຟລ໌ຈາກ OS

source: File extensions
lo: ນາມສະກຸນໄຟລ໌

source: %s files
lo: ໄຟລ໌ %s

# lazarusidestrconsts.dlgfilterall
source: All files
lo: ໄຟລ໌ທັງໝົດ

# lazarusidestrconsts.dlgfiltercodetoolstemplatefile
source: CodeTools template file
lo: ໄຟລ໌ແມ່ແບບ CodeTools

source: DCI file
lo: ໄຟລ໌ DCI

source: Delphi form
lo: ຟອມ Delphi

# lazarusidestrconsts.dlgfilterdelphipackage
source: Delphi package
lo: ແພັກເກັດ Delphi

# lazarusidestrconsts.dlgfilterdelphiproject
source: Delphi project
lo: ໂປຣເຈັກ Delphi

# lazarusidestrconsts.dlgfilterdelphiunit
source: Delphi unit
lo: ຢູນິດ Delphi

# lazarusidestrconsts.dlgfilterfpcmessagefile
source: FPC message file
lo: ໄຟລ໌ຂໍ້ຄວາມ FPC

source: Fppkg configuration file
lo: ໄຟລ໌ການຕັ້ງຄ່າ Fppkg

source: HTML files
lo: ໄຟລ໌ HTML

source: Bitmap images
lo: ຮູບພາບ Bitmap

source: Pixmap images
lo: ຮູບພາບ Pixmap

source: PNG images
lo: ຮູບພາບ PNG

# lazarusidestrconsts.dlgfilterlazarusdesktopsettings
source: Lazarus Desktop Settings
lo: ການຕັ້ງຄ່າ Lazarus Desktop

# lazarusidestrconsts.dlgfilterlazaruseditorfile
source: Editor file types
lo: ປະເພດໄຟລ໌ບັນນາທິການ

# lazarusidestrconsts.dlgfilterlazarusfile
source: Lazarus file
lo: ໄຟລ໌ Lazarus

# lazarusidestrconsts.dlgfilterlazarusform
source: Lazarus form
lo: ຟອມ Lazarus

# lazarusidestrconsts.dlgfilterlazarusinclude
source: Lazarus include file
lo: ໄຟລ໌ include Lazarus

# lazarusidestrconsts.dlgfilterlazarusotherfile
source: Lazarus other file
lo: ໄຟລ໌ອື່ນໆຂອງ Lazarus

# lazarusidestrconsts.dlgfilterlazaruspackage
source: Lazarus package
lo: ແພັກເກັດ Lazarus

# lazarusidestrconsts.dlgfilterlazarusproject
source: Lazarus project
lo: ໂປຣເຈັກ Lazarus

# lazarusidestrconsts.dlgfilterlazarusprojectsource
source: Lazarus project source
lo: ຊອດໂຄ້ດໂປຣເຈັກ Lazarus

# lazarusidestrconsts.dlgfilterlazarusunit
source: Lazarus unit
lo: ຢູນິດ Lazarus

source: Package list files
lo: ໄຟລ໌ລາຍຊື່ແພັກເກັດ

# lazarusidestrconsts.dlgfilterpascalfile
source: Pascal file
lo: ໄຟລ໌ Pascal

# lazarusidestrconsts.dlgfilterprograms
source: Programs
lo: ໂປຣແກຣມ

# lazarusidestrconsts.dlgfilterxml
source: XML files
lo: ໄຟລ໌ XML

source: Find text at cursor
lo: ຄົ້ນຫາຂໍ້ຄວາມທີ່ເຄີເຊີ

source: Chunk section
lo: ສ່ວນ Chunk

# lazarusidestrconsts.dlgfoldhtmlcomment
source: Comment
lo: ຄຳອະທິບາຍ

# lazarusidestrconsts.dlgfoldhtmlnode
source: Node
lo: ໂນດ

source: Item
lo: ລາຍການ

source: List <>
lo: ລາຍຊື່ <>

source: Object (inherited, inline)
lo: ວັດຖຸ (ສືບທອດ, inline)

source: Comment (* *)
lo: ຄຳອະທິບາຍ (* *)

source: Comment { }
lo: ຄຳອະທິບາຍ { }

source: Comment //
lo: ຄຳອະທິບາຍ //

# lazarusidestrconsts.dlgfoldxmlcomment
source: Comment
lo: ຄຳອະທິບາຍ

source: Processing Instruction
lo: ຄຳສັ່ງປະມວນຜົນ (Processing Instruction)

source: Force DPI scaling in design-time
lo: ບັງຄັບ DPI scaling ໃນ design-time

source: When checked the project scaling settings will be ignored - only the form/frame/datamodule Scaled property will be taken into account.
lo: ເມື່ອເລືອກ, ການຕັ້ງຄ່າ scaling ຂອງໂປຣເຈັກຈະຖືກບໍ່ສົນໃຈ - ພຽງແຕ່ຄຸນສົມບັດ Scaled ຂອງ form/frame/datamodule ເທົ່ານັ້ນທີ່ຈະຖືກນຳມາພິຈາລະນາ.

source: The running Lazarus instance cannot accept any files.
lo: Lazarus ທີ່ກຳລັງເຮັດວຽກຢູ່ບໍ່ສາມາດຮັບໄຟລ໌ໃດໆໄດ້.

source: Foreground
lo: ພື້ນໜ້າ

source: Change Object Inspector contents on clicking form title bar
lo: ປ່ຽນເນື້ອຫາ Object Inspector ເມື່ອຄລິກທີ່ແຖບຫົວຂໍ້ຂອງຟອມ

source: Show a form's properties in Object Inspector by clicking on its title bar.
lo: ສະແດງຄຸນສົມບັດຂອງຟອມໃນ Object Inspector ໂດຍການຄລິກທີ່ແຖບຫົວຂໍ້ຂອງມັນ.

source: Procedure insert policy
lo: ນະໂຍບາຍການແຊກ Procedure

source: Keep order of procedures
lo: ຮັກສາລຳດັບຂອງ procedure

source: Compiler executable (e.g. %s)
lo: ໄຟລ໌ຄອມໄພເລີ (ເຊັ່ນ: %s)

source: FPC source directory
lo: ໂຟນເດີຊອດໂຄ້ດ FPC

source: Fppkg configuration file (e.g. fppkg.cfg)
lo: ໄຟລ໌ການຕັ້ງຄ່າ Fppkg (ເຊັ່ນ: fppkg.cfg)

source: Text mark
lo: ເຄື່ອງໝາຍຂໍ້ຄວາມ

source: Form Editor
lo: ຕົວແກ້ໄຂຟອມ

source: From b&eginning
lo: ຈາກ&ເລີ່ມຕົ້ນ

source: From c&ursor
lo: ຈາກ&ເຄີເຊີ

source: &Global
lo: &ທົ່ວໄປ

source: Generate code for gprof
lo: ສ້າງໂຄ້ດສຳລັບ gprof

source: Grabber color
lo: ສີ Grabber

source: Grayed desktops are for docked environment.
lo: ເດັສທັອບສີເທົາແມ່ນສຳລັບສະພາບແວດລ້ອມ docked.

source: Grayed desktops are for undocked environment.
lo: ເດັສທັອບສີເທົາແມ່ນສຳລັບສະພາບແວດລ້ອມ undocked.

source: Grid color
lo: ສີຕາຕະລາງ

source: Grid consists of small dots which help aligning controls.
lo: ຕາຕະລາງປະກອບດ້ວຍຈຸດນ້ອຍໆທີ່ຊ່ວຍຈັດລຽງ controls.

source: Grid size X
lo: ຂະໜາດຕາຕະລາງ X

source: Horizontal grid step size
lo: ຂະໜາດຂັ້ນຕາຕະລາງແນວນອນ

source: Grid size Y
lo: ຂະໜາດຕາຕະລາງ Y

source: Vertical grid step size
lo: ຂະໜາດຂັ້ນຕາຕະລາງແນວຕັ້ງ

source: Editor
lo: ບັນນາທິການ

# lazarusidestrconsts.dlggroupenvironment
source: Environment
lo: ສະພາບແວດລ້ອມ

source: Show Guide Lines
lo: ສະແດງເສັ້ນນຳທາງ

source: When a control is aligned horizontally or vertically with another controls, a blue guide line is shown.
lo: ເມື່ອ control ຖືກຈັດລຽງແນວນອນ ຫຼື ແນວຕັ້ງກັບ control ອື່ນ, ເສັ້ນນຳທາງສີຟ້າຈະສະແດງຂຶ້ນ.

# lazarusidestrconsts.dlggutter
source: Gutter
lo: ຂອບແຖວ

source: Collapsed
lo: ຫຍໍ້

source: Gutter Color
lo: ສີຂອບແຖວ

source: Current Line (number)
lo: ແຖວປັດຈຸບັນ (ຕົວເລກ)

source: Current Line (other)
lo: ແຖວປັດຈຸບັນ (ອື່ນໆ)

source: Gutter Edge Color
lo: ສີຂອບຂອບແຖວ

source: Gutter separator index
lo: ດັດຊະນີຕົວແຍກຂອບແຖວ

source: Half page scroll
lo: ເລື່ອນເຄິ່ງໜ້າ

source: Heap and stack sizes
lo: ຂະໜາດ Heap ແລະ stack

source: Heap size
lo: ຂະໜາດ Heap

source: Height of one property in the grid.
lo: ຄວາມສູງຂອງໜຶ່ງຄຸນສົມບັດໃນຕາຕະລາງ.

source: Height:
lo: ຄວາມສູງ:

source: Hide IDE windows on Run/Debug
lo: ເຊື່ອງປ່ອງຢ້ຽມ IDE ເມື່ອ Run/Debug

source: Do not show the IDE at all while program is running.
lo: ບໍ່ຕ້ອງສະແດງ IDE ເລີຍໃນຂະນະທີ່ໂປຣແກຣມກຳລັງເຮັດວຽກ.

source: Hide tab in single page windows
lo: ເຊື່ອງແຖບໃນປ່ອງຢ້ຽມໜ້າດຽວ

source: Highlight Color
lo: ສີໄຮໄລ້

source: Highlight Font Color
lo: ສີຟອນໄຮໄລ້

source: Left Of Caret
lo: ຊ້າຍຂອງຕົວຊີ້ພິມ

source: Right Of Caret
lo: ຂວາຂອງຕົວຊີ້ພິມ

source: Show hints for parameter "Sender" not used
lo: ສະແດງຄຳແນະນຳສຳລັບ parameter "Sender" ທີ່ບໍ່ໄດ້ໃຊ້

source: Show hints for unused units in main
lo: ສະແດງຄຳແນະນຳສຳລັບ unit ທີ່ບໍ່ໄດ້ໃຊ້ໃນ main

source: Home key jumps to nearest start
lo: ປຸ່ມ Home ໂດດໄປຫາຈຸດເລີ່ມຕົ້ນທີ່ໃກ້ທີ່ສຸດ

source: Host application
lo: ແອັບພລິເຄຊັນໂຮສ

source: Template
lo: ແມ່ແບບ

# lazarusidestrconsts.dlgiahadentifiercomplentryother
source: Other
lo: ອື່ນໆ

# lazarusidestrconsts.dlgiahadentifiercomplentrytext
source: Text
lo: ຂໍ້ຄວາມ

# lazarusidestrconsts.dlgidentifiercompletion
source: Identifier Completion
lo: ການເຕີມເຕັມ Identifier

source: Identifier policy
lo: ນະໂຍບາຍ Identifier

source: IDE Options
lo: ຕົວເລືອກ IDE

source: Active $IFDEF code
lo: ໂຄ້ດ $IFDEF ທີ່ເຮັດວຽກ

source: Inactive $IFDEF code
lo: ໂຄ້ດ $IFDEF ທີ່ບໍ່ເຮັດວຽກ

source: Included mixed state $IFDEF code
lo: ໂຄ້ດ $IFDEF ສະຖານະປະສົມທີ່ລວມຢູ່

source: Active $IFDEF node
lo: ໂນດ $IFDEF ທີ່ເຮັດວຽກ

source: Inactive $IFDEF node
lo: ໂນດ $IFDEF ທີ່ບໍ່ເຮັດວຽກ

source: Included mixed state $IFDEF node
lo: ໂນດ $IFDEF ສະຖານະປະສົມທີ່ລວມຢູ່

source: A desktop with the same name already exists. Please confirm the desktop name:
lo: ມີເດັສທັອບທີ່ມີຊື່ດຽວກັນຢູ່ແລ້ວ. ກະລຸນາຢືນຢັນຊື່ເດັສທັອບ:

source: Include code templates
lo: ລວມເອົາແມ່ແບບໂຄ້ດ

source: Include identifiers containing prefix
lo: ລວມເອົາ identifier ທີ່ມີຄຳນຳໜ້າ

source: Include all keywords and operators
lo: ລວມເອົາ keyword ແລະ operator ທັງໝົດ

source: Include system variables
lo: ລວມເອົາຕົວປ່ຽນລະບົບ

source: Include words
lo: ລວມເອົາຄຳສັບ

source: don't include
lo: ບໍ່ລວມເອົາ

source: from all units
lo: ຈາກທຸກ unit

source: from current unit
lo: ຈາກ unit ປັດຈຸບັນ

source: Indent (New line)
lo: ຫຍໍ້ໜ້າ (ແຖວໃໝ່)

source: Indent (Tab key on Selection)
lo: ຫຍໍ້ໜ້າ (ປຸ່ມ Tab ເທິງສ່ວນທີ່ເລືອກ)

source: Tab key
lo: ປຸ່ມ Tab

source: Tabs widths (Tab stop position)
lo: ຄວາມກວ້າງແຖບ (ຕຳແໜ່ງຈຸດຢຸດແຖບ)

source: In front of methods
lo: ທາງໜ້າ method

source: Constructor name must be 'init' (destructor must be 'done')
lo: ຊື່ Constructor ຕ້ອງແມ່ນ 'init' (destructor ຕ້ອງແມ່ນ 'done')

source: Insert class parts
lo: ແຊກສ່ວນ class

source: Insert method implementations
lo: ແຊກ implementation ຂອງ method

source: Insert into Uses section of
lo: ແຊກເຂົ້າໃນສ່ວນ Uses ຂອງ

source: Insert space after
lo: ແຊກຍະຫວ່າງຫຼັງຈາກ

source: Insert space in front of
lo: ແຊກຍະຫວ່າງທາງໜ້າຂອງ

source: Interval in secs
lo: ໄລຍະຫ່າງເປັນວິນາທີ

source: Vertical position for a code block jump in % (0=top, 100=bottom)
lo: ຕຳແໜ່ງແນວຕັ້ງສຳລັບການໂດດບລັອກໂຄ້ດເປັນ % (0=ເທິງ, 100=ລຸ່ມ)

source: Jumping (e.g. Method Jumping)
lo: ການໂດດ (ເຊັ່ນ: ການໂດດ Method)

source: Vertical position for a single line jump in % (0=top, 100=bottom)
lo: ຕຳແໜ່ງແນວຕັ້ງສຳລັບການໂດດແຖວດຽວເປັນ % (0=ເທິງ, 100=ລຸ່ມ)

source: Jump directly to method body
lo: ໂດດໄປຫາເນື້ອຫາ method ໂດຍກົງ

source: Keep caret X position when navigating up/down
lo: ຮັກສາຕຳແໜ່ງ X ຂອງຕົວຊີ້ພິມເມື່ອເລື່ອນຂຶ້ນ/ລົງ

source: (Edit Key)
lo: (ແກ້ໄຂປຸ່ມ)

source: Key Mappings
lo: ການຈັບຄູ່ປຸ່ມ

source: Key mapping errors
lo: ຂໍ້ຜິດພາດການຈັບຄູ່ປຸ່ມ

source: Keyword policy
lo: ນະໂຍບາຍ Keyword

source: Allow LABEL and GOTO
lo: ອະນຸຍາດ LABEL ແລະ GOTO

# lazarusidestrconsts.dlglang
source: Language
lo: ພາສາ

source: Last (i.e. at end of source)
lo: ສຸດທ້າຍ (ເຊັ່ນ: ທີ່ຈົບຊອດໂຄ້ດ)

source: Lazarus directory (default for all projects)
lo: ໂຟນເດີ Lazarus (ເລີ່ມຕົ້ນສຳລັບທຸກໂປຣເຈັກ)

source: Guide lines Left,Top
lo: ເສັ້ນນຳທາງ ຊ້າຍ,ເທິງ

source: 1 (quick, debugger friendly with small limitations)
lo: 1 (ໄວ, ເປັນມິດກັບ debugger ໂດຍມີຂໍ້ຈຳກັດເລັກນ້ອຍ)

source: 2 (-O1 + quick optimizations)
lo: 2 (-O1 + optimizations ໄວ)

source: 3 (-O2 + slow optimizations)
lo: 3 (-O2 + optimizations ຊ້າ)

source: 4 (-O3 + aggressive optimizations, beware)
lo: 4 (-O3 + optimizations ຮຸນແຮງ, ລະວັງ)

source: 0 (no optimization, for debugging)
lo: 0 (ບໍ່ມີ optimization, ສຳລັບການດີບັກ)

source: Line Splitting
lo: ການແຍກແຖວ

source: Display line numbers in run-time error backtraces
lo: ສະແດງເລກແຖວໃນ backtraces ຂໍ້ຜິດພາດ run-time

source: View Project Forms
lo: ເບິ່ງຟອມໂປຣເຈັກ

source: View Project Frames
lo: ເບິ່ງ Frames ໂປຣເຈັກ

# lazarusidestrconsts.dlgmainviewunits
source: View Project Units
lo: ເບິ່ງ Units ໂປຣເຈັກ

source: Manage desktops
lo: ຈັດການເດັສທັອບ

source: Margin and gutter
lo: ຂອບ ແລະ ຂອບແຖວ

source: Marker color
lo: ສີເຄື່ອງໝາຍ

source: Overview gutter
lo: ຂອບແຖວພາບລວມ

source: (%s sec delay after caret move)
lo: (ໜ່ວງ %s ວິນາທີຫຼັງຈາກຍ້າຍຕົວຊີ້ພິມ)

source: Vertical mark
lo: ເຄື່ອງໝາຍແນວຕັ້ງ

source: Highlight all occurrences of Word under Caret
lo: ໄຮໄລ້ທຸກຈຸດຂອງຄຳສັບທີ່ຢູ່ໃຕ້ຕົວຊີ້ພິມ

source: Outline (global)
lo: ໂຄງຮ່າງ (ທົ່ວໄປ)

source: Warning: There are no colors configured for the selected language
lo: ຄຳເຕືອນ: ບໍ່ມີການຕັ້ງຄ່າສີສຳລັບພາສາທີ່ເລືອກ

# lazarusidestrconsts.dlgmarkupuserdefined
source: User defined markup
lo: Markup ທີ່ຜູ້ໃຊ້ກຳນົດ

# lazarusidestrconsts.dlgmarkupuserdefineddelcaption
source: Delete
lo: ລຶບ

source: Delete list "%s"?
lo: ລຶບລາຍຊື່ "%s" ບໍ?

source: Edit list
lo: ແກ້ໄຂລາຍຊື່

source: Add Word or Term by key
lo: ເພີ່ມຄຳ ຫຼື ຄຳສັບດ້ວຍປຸ່ມ

source: Remove Word or Term by key
lo: ລຶບຄຳ ຫຼື ຄຳສັບດ້ວຍປຸ່ມ

source: Toggle Word or Term by key
lo: ເປີດ/ປິດຄຳ ຫຼື ຄຳສັບດ້ວຍປຸ່ມ

source: Create or Select list
lo: ສ້າງ ຫຼື ເລືອກລາຍຊື່

source: Duplicate Term
lo: ຄຳສັບຊ້ຳກັນ

source: The term %s already exists. Duplicates will be removed when the list is saved.
lo: ຄຳສັບ %s ມີຢູ່ແລ້ວ. ຕົວຊ້ຳຈະຖືກລຶບອອກເມື່ອບັນທຶກລາຍຊື່.

source: Add/Remove in all editors
lo: ເພີ່ມ/ລຶບໃນທຸກ editor

source: Delete list
lo: ລຶບລາຍຊື່

# lazarusidestrconsts.dlgmarkupuserdefinedlistname
source: Name
lo: ຊື່

source: Add list
lo: ເພີ່ມລາຍຊື່

source: Case sensitive
lo: ຕົວພິມນ້ອຍ/ໃຫຍ່ມີຜົນ

source: Set bound at term end
lo: ຕັ້ງຂອບເຂດທີ່ຈົບຄຳສັບ

source: Set bound at term start
lo: ຕັ້ງຂອບເຂດທີ່ເລີ່ມຕົ້ນຄຳສັບ

source: Ignore bounds for terms longer than
lo: ບໍ່ສົນໃຈຂອບເຂດສຳລັບຄຳສັບທີ່ຍາວກວ່າ

source: selection
lo: ການເລືອກ

source: current word
lo: ຄຳປັດຈຸບັນ

source: Settings for terms added by key
lo: ການຕັ້ງຄ່າສຳລັບຄຳສັບທີ່ເພີ່ມດ້ວຍປຸ່ມ

source: Smart match selection bounds
lo: ຈັບຄູ່ຂອບເຂດການເລືອກແບບອັດສະລິຍະ

source: New list
lo: ລາຍຊື່ໃໝ່

source: No lists
lo: ບໍ່ມີລາຍຊື່

source: Select ...
lo: ເລືອກ ...

source: Key mappings
lo: ການຈັບຄູ່ປຸ່ມ

source: Main settings
lo: ການຕັ້ງຄ່າຫຼັກ

source: Keyword brackets on caret (global)
lo: ວົງເລັບ Keyword ເທິງຕົວຊີ້ພິມ (ທົ່ວໄປ)

source: Match whole words, if length is less or equal to:
lo: ກົງກັບຄຳເຕັມ, ຖ້າຄວາມຍາວໜ້ອຍກວ່າ ຫຼື ເທົ່າກັບ:

source: Markup current word by key: %s
lo: Markup ຄຳປັດຈຸບັນດ້ວຍປຸ່ມ: %s

source: Ignore keywords
lo: ບໍ່ສົນໃຈ keyword

source: Automatically markup current word on caret move
lo: Markup ຄຳປັດຈຸບັນໂດຍອັດຕະໂນມັດເມື່ອຍ້າຍຕົວຊີ້ພິມ

source: Trim spaces (when highlighting current selection)
lo: ຕັດຍະຫວ່າງ (ເມື່ອໄຮໄລ້ສ່ວນທີ່ເລືອກປັດຈຸບັນ)

source: Match words
lo: ກົງກັບຄຳ

source: Maximum counter
lo: ຕົວນັບສູງສຸດ

source: Max line length:
lo: ຄວາມຍາວແຖວສູງສຸດ:

source: Max recent files
lo: ໄຟລ໌ລ່າສຸດສູງສຸດ

source: Value 0 means unlimited.
lo: ຄ່າ 0 ໝາຍເຖິງບໍ່ຈຳກັດ.

source: Max recent project files
lo: ໄຟລ໌ໂປຣເຈັກລ່າສຸດສູງສຸດ

source: Middle-click-modifier to close all other tabs
lo: Middle-click-modifier ເພື່ອປິດແຖບອື່ນໆທັງໝົດ

source: Middle-click-modifier to close tabs on the right
lo: ປຸ່ມລັດຄລິກເມົ້າກາງເພື່ອປິດແຖບເບື້ອງຂວາ

source: Mix methods and properties
lo: ປະສົມວິທີການ ແລະ ຄຸນສົມບັດ

source: Mode
lo: ໂໝດ

source: Modifier
lo: ຕົວປັບປ່ຽນ

source: Mouse Action
lo: ການກະທຳຂອງເມົ້າ

# lazarusidestrconsts.dlgmouseoptbtn1
source: Single
lo: ດຽວ

# lazarusidestrconsts.dlgmouseoptbtn2
source: Double
lo: ສອງຄັ້ງ

# lazarusidestrconsts.dlgmouseoptbtn3
source: Triple
lo: ສາມຄັ້ງ

# lazarusidestrconsts.dlgmouseoptbtn4
source: Quad
lo: ສີ່ຄັ້ງ

source: Any
lo: ໃດໆ

# lazarusidestrconsts.dlgmouseoptbtnextra1
source: Extra 1
lo: ພິເສດ 1

# lazarusidestrconsts.dlgmouseoptbtnextra2
source: Extra 2
lo: ພິເສດ 2

# lazarusidestrconsts.dlgmouseoptbtnleft
source: Left
lo: ຊ້າຍ

# lazarusidestrconsts.dlgmouseoptbtnmiddle
source: Middle
lo: ກາງ

source: Make Fallback
lo: ຕັ້ງເປັນຄ່າສຳຮອງ

# lazarusidestrconsts.dlgmouseoptbtnright
source: Right
lo: ຂວາ

source: Wheel down
lo: ລໍ້ເລື່ອນລົງ

source: Wheel left
lo: ລໍ້ເລື່ອນຊ້າຍ

source: Wheel right
lo: ລໍ້ເລື່ອນຂວາ

source: Wheel up
lo: ລໍ້ເລື່ອນຂຶ້ນ

source: Capture
lo: ຈັບຄ່າ

source: Move Caret (extra)
lo: ຍ້າຍເຄີເຊີ (ເພີ່ມເຕີມ)

source: Act on Mouse up
lo: ເຮັດວຽກເມື່ອປ່ອຍເມົ້າ

# lazarusidestrconsts.dlgmouseoptdescaction
source: Action
lo: ການກະທຳ

# lazarusidestrconsts.dlgmouseoptdescbutton
source: Click
lo: ຄລິກ

source: Edit Mouse
lo: ແກ້ໄຂເມົ້າ

source: Duplicate Entry
lo: ລາຍການຊ້ຳກັນ

source: This entry conflicts with an existing entry
lo: ລາຍການນີ້ຂັດກັບລາຍການທີ່ມີຢູ່ແລ້ວ

# lazarusidestrconsts.dlgmouseoptheadbtn
source: Button
lo: ປຸ່ມ

# lazarusidestrconsts.dlgmouseoptheadcaret
source: Caret
lo: ເຄີເຊີ

source: Context
lo: ບໍລິບົດ

# lazarusidestrconsts.dlgmouseoptheadcount
source: Click
lo: ຄລິກ

# lazarusidestrconsts.dlgmouseoptheaddesc
source: Action
lo: ການກະທຳ

source: Up/Down
lo: ຂຶ້ນ/ລົງ

source: Option
lo: ທາງເລືອກ

# lazarusidestrconsts.dlgmouseoptheadorder
source: Order
lo: ລຳດັບ

# lazarusidestrconsts.dlgmouseoptheadpriority
source: Priority
lo: ຄວາມສຳຄັນ

# lazarusidestrconsts.dlgmouseoptions
source: Mouse
lo: ເມົ້າ

source: Advanced
lo: ຂັ້ນສູງ

source: IDE-Command
lo: ຄຳສັ່ງ IDE

# lazarusidestrconsts.dlgmouseoptnodeall
source: All
lo: ທັງໝົດ

# lazarusidestrconsts.dlgmouseoptnodegutter
source: Gutter
lo: ຂອບກັ້ນໜ້າ

source: Line Changes
lo: ການປ່ຽນແປງແຖວ

source: Fold Tree
lo: ໂຄງສ້າງການຫຍໍ້

source: Collapsed [+]
lo: ຫຍໍ້ເຂົ້າ [+]

source: Expanded [-]
lo: ຂະຫຍາຍອອກ [-]

source: Overview
lo: ພາບລວມ

source: Overview Mark
lo: ໝາຍພາບລວມ

source: Line Numbers
lo: ເລກແຖວ

# lazarusidestrconsts.dlgmouseoptnodemain
source: Text
lo: ຂໍ້ຄວາມ

# lazarusidestrconsts.dlgmouseoptnodeselect
source: Selection
lo: ການເລືອກ

source: Other actions using the same button
lo: ການກະທຳອື່ນທີ່ໃຊ້ປຸ່ມດຽວກັນ

source: They may be executed depending on the Modifier Keys, Fallthrough settings, Single/Double, Up/Down ...
lo: ພວກມັນອາດຈະຖືກປະຕິບັດຂຶ້ນກັບປຸ່ມລັດ, ການຕັ້ງຄ່າ Fallthrough, ດຽວ/ຄູ່, ຂຶ້ນ/ລົງ ...

source: Filter Mod-Keys
lo: ກັ່ນຕອງປຸ່ມ Mod

# lazarusidestrconsts.dlgmouseoptpriorlabel
source: Priority
lo: ຄວາມສຳຄັນ

# lazarusidestrconsts.dlgmsgwincolorurgentdebug
source: Debug
lo: ດີບັກ

# lazarusidestrconsts.dlgmsgwincolorurgenterror
source: Error
lo: ຂໍ້ຜິດພາດ

# lazarusidestrconsts.dlgmsgwincolorurgentfatal
source: Fatal
lo: ຮ້າຍແຮງ

# lazarusidestrconsts.dlgmsgwincolorurgenthint
source: Hint
lo: ຄຳແນະນຳ

# lazarusidestrconsts.dlgmsgwincolorurgentimportant
source: Important
lo: ສຳຄັນ

source: Normal
lo: ປົກກະຕິ

# lazarusidestrconsts.dlgmsgwincolorurgentnote
source: Note
lo: ໝາຍເຫດ

# lazarusidestrconsts.dlgmsgwincolorurgentpanic
source: Panic
lo: ວິກິດ

source: Time and statistics
lo: ເວລາ ແລະ ສະຖິຕິ

# lazarusidestrconsts.dlgmsgwincolorurgentverbose
source: Verbose
lo: ລະອຽດ

source: Verbose 2
lo: ລະອຽດ 2

source: Verbose 3
lo: ລະອຽດ 3

# lazarusidestrconsts.dlgmsgwincolorurgentwarning
source: Warning
lo: ຄຳເຕືອນ

source: Navigation keys move all carets (column-select)
lo: ປຸ່ມນຳທາງຍ້າຍທຸກເຄີເຊີ (ເລືອກແບບຖັນ)

source: Skip delete key at EOL (do not join lines)
lo: ຂ້າມປຸ່ມລຶບທີ່ທ້າຍແຖວ (ບໍ່ຕ້ອງຕໍ່ແຖວເຂົ້າກັນ)

source: Multi-caret
lo: ຫຼາຍເຄີເຊີ

source: Navigation keys move all carets
lo: ປຸ່ມນຳທາງຍ້າຍທຸກເຄີເຊີ

source: Enable multi-caret for column selection
lo: ເປີດໃຊ້ງານຫຼາຍເຄີເຊີສຳລັບການເລືອກແບບຖັນ

source: always start a new instance
lo: ເປີດໜ້າຕ່າງໃໝ່ສະເໝີ

source: do not allow multiple instances
lo: ບໍ່ອະນຸຍາດໃຫ້ເປີດຫຼາຍໜ້າຕ່າງຊ້ອນກັນ

source: open files in a running instance
lo: ເປີດໄຟລ໌ໃນໜ້າຕ່າງທີ່ກຳລັງເຮັດວຽກຢູ່

source: Multi Select
lo: ເລືອກຫຼາຍອັນ

source: Jump target priority between multiple editors
lo: ຄວາມສຳຄັນຂອງການໂດດໄປຫາເປົ້າໝາຍລະຫວ່າງຫຼາຍຕົວແກ້ໄຂ

source: Order to use for editors matching the same criteria
lo: ລຳດັບທີ່ຈະໃຊ້ສຳລັບຕົວແກ້ໄຂທີ່ກົງກັບເງື່ອນໄຂດຽວກັນ

source: Most recent focused editor for this file
lo: ຕົວແກ້ໄຂທີ່ຖືກໂຟກັດຫຼ້າສຸດສຳລັບໄຟລ໌ນີ້

source: Editor (for file) in most recent focused window
lo: ຕົວແກ້ໄຂ (ສຳລັບໄຟລ໌) ໃນໜ້າຕ່າງທີ່ຖືກໂຟກັດຫຼ້າສຸດ

source: Priority list of criteria to choose an editor:
lo: ລາຍການຄວາມສຳຄັນຂອງເງື່ອນໄຂໃນການເລືອກຕົວແກ້ໄຂ:

source: Pages and Windows
lo: ໜ້າ ແລະ ໜ້າຕ່າງ

source: Notebook Tabs
lo: ແຖບສະໝຸດບັນທຶກ

source: Naming
lo: ການຕັ້ງຊື່

source: New desktop ...
lo: ເດັສທັອບໃໝ່ ...

source: New Project Type
lo: ປະເພດໂປຣເຈັກໃໝ່

source: No automatic renaming
lo: ບໍ່ມີການປ່ຽນຊື່ໂອໂຕ້

source: No available units to add.
lo: ບໍ່ມີ unit ທີ່ສາມາດເພີ່ມໄດ້.

source: No Highlight
lo: ບໍ່ມີການໄຮໄລ້

source: Other Designer background (e. g. TDataModule)
lo: ພື້ນຫຼັງ Designer ອື່ນໆ (ເຊັ່ນ: TDataModule)

source: Source notebook tabs position
lo: ຕຳແໜ່ງແຖບສະໝຸດບັນທຶກຊອດໂຄ້ດ

source: Do not split line after
lo: ຢ່າຕັດແຖວຫຼັງຈາກ

source: Do not split line in front of
lo: ຢ່າຕັດແຖວທາງໜ້າຂອງ

source: Item height (0 = auto)
lo: ຄວາມສູງລາຍການ (0 = ອັດຕະໂນມັດ)

# lazarusidestrconsts.dlgoimiscellaneous
source: Miscellaneous
lo: ເບັດຕະເລັດ

source: Speed settings
lo: ການຕັ້ງຄ່າຄວາມໄວ

source: Use default Delphi settings
lo: ໃຊ້ການຕັ້ງຄ່າ Delphi ເລີ່ມຕົ້ນ

source: Use default Lazarus settings
lo: ໃຊ້ການຕັ້ງຄ່າ Lazarus ເລີ່ມຕົ້ນ

source: Edit debugger backend
lo: ແກ້ໄຂ debugger backend

source: Select debugger backend
lo: ເລືອກ debugger backend

source: The project options have been set to use a different debugger backend
lo: ຕົວເລືອກໂປຣເຈັກຖືກຕັ້ງຄ່າໃຫ້ໃຊ້ debugger backend ທີ່ຕ່າງອອກໄປ

source: Optimization levels
lo: ລະດັບການປັບປຸງປະສິດທິພາບ

source: Word-wrap
lo: ຕັດຄຳຂຶ້ນແຖວໃໝ່

source: Select all
lo: ເລືອກທັງໝົດ

source: Wrap at fixed column
lo: ຕັດແຖວທີ່ຖັນຄົງທີ່

source: Display caret at wrap-position...
lo: ສະແດງເຄີເຊີທີ່ຕຳແໜ່ງຕັດແຖວ...

source: end of line
lo: ທ້າຍແຖວ

source: Fixed line length
lo: ຄວາມຍາວແຖວຄົງທີ່

source: Force default home/end keys to subline start/end
lo: ບັງຄັບປຸ່ມ home/end ເລີ່ມຕົ້ນໃຫ້ໄປທີ່ ຕົ້ນ/ທ້າຍ ແຖວຍ່ອຍ

source: Indent width
lo: ຄວາມກວ້າງຫຍໍ້ໜ້າ

# lazarusidestrconsts.dlgoptwordwrapindentisoffset
source: Indent relative to text
lo: ຫຍໍ້ໜ້າທຽບກັບຂໍ້ຄວາມ

source: Maximum indent width
lo: ຄວາມກວ້າງຫຍໍ້ໜ້າສູງສຸດ

source: Maximum indent width (percent)
lo: ຄວາມກວ້າງຫຍໍ້ໜ້າສູງສຸດ (ເປີເຊັນ)

source: Minimum indent width
lo: ຄວາມກວ້າງຫຍໍ້ໜ້າຕ່ຳສຸດ

source: Maximum line length
lo: ຄວາມຍາວແຖວສູງສຸດ

source: Minimum line length
lo: ຄວາມຍາວແຖວຕ່ຳສຸດ

source: Clear selection
lo: ລຶບການເລືອກ

source: Wrap column settings
lo: ການຕັ້ງຄ່າຖັນຕັດຄຳ

source: Indent settings
lo: ການຕັ້ງຄ່າຫຍໍ້ໜ້າ

source: start of next line
lo: ຕົ້ນແຖວຖັດໄປ

source: Use Word-wrap
lo: ໃຊ້ການຕັດຄຳຂຶ້ນແຖວໃໝ່

source: Other optimizations
lo: ການປັບປຸງປະສິດທິພາບອື່ນໆ

source: Other unit files (-Fu):
lo: ໄຟລ໌ unit ອື່ນໆ (-Fu):
