Repository: fpc/Lazarus
Catalog: components/jcf2/IdePlugin/lazarus/languages/jcfuiconsts.*.po
Languages: tr

source: &About ...
tr: &Hakkında

source: JEDI Code Format
tr: JEDI Kod Formatı

source: Format code in current editor window
tr: Geçerli düzenleyici penceresinde kodu biçimlendir

source: &Current Editor Window
tr: &Mevcut Editör Penceresi

source: JEDI Code &Format
tr: Jedi Kod &Formatı

source: All &Open Windows
tr: Tüm &Pencereleri Aç

source: &All Files in Project
tr: Projedeki &Tüm Dosyalar

source: Global Settings ...
tr: Genel Ayarlar ...

source: &Format Settings ...
tr: For&mat Ayarları ...

source: About JEDI Code Format
tr: Jedi Kod Formatı Hakkında

source: Find more information on the web at: %s
tr: Daha fazla bilgiyi web'de bulabilirsiniz: %s

source: This program is open source software. It is released under the Mozilla Public Licence (MPL). http://www.mozilla.org/MPL
tr: Bu program açık kaynak kodlu bir yazılımdır. Mozilla Kamu Lisansı (MPL) altında yayınlanmaktadır. http://www.mozilla.org/MPL

source: This program is still under development. In spite of thorough testing and removal of reported bugs, no guarantees are given. Please make backups, or better yet use a source control system.
tr: Bu program halen geliştirilme aşamasındadır. Kapsamlı testlere ve bildirilen hataların giderilmesine rağmen, hiçbir garanti verilmemektedir. Lütfen yedekleme yapın ya da daha iyisi bir kaynak kontrol sistemi kullanın.

source: Version $VERSION$%s%sThis program attempts to standardise and make readable the layout of any Object Pascal source code.%s%sCopyright Anthony Steele 1999-2008
tr: Sürüm $VERSION$%s%sBu program herhangi bir Object Pascal kaynak kodunun düzenini standartlaştırmaya ve okunabilir hale getirmeye çalışır.%s%sTelif Hakkı Anthony Steele 1999-2008

source: Align
tr: Hizala

source: Assign
tr: Atama

source: Class and record fields
tr: Sınıf ve kayıt alanları

source: Comments
tr: Açıklamalar

source: Const
tr: Sabitler

source: Interface Only
tr: Sadece interface

source: Max Column
tr: Maks Sutün

source: Max unaligned
tr: Maks hizalanmamış

source: Max Variance
tr: Max Varyans

source: Max Variance Interface
tr: Maks Varyans Arayüzü

source: Min Column
tr: Min Sütun

source: Type defs
tr: Tür tanımları

source: Var declarations
tr: Var bildirimleri

source: What to Align
tr: Ne Hizalanmalı

source: &Breaks after label
tr: &Etiketten sonra kırılır

source: &Capitalization
tr: &Kapitalizasyon

source: &Enabled
tr: &Aktif

source: E&nabled
tr: Ak&tif

source: En&abled
tr: Akt&if

source: Indent
tr: Girinti

source: N&umber of breaks
tr: Mola &sayısı

source: &Params Indents
tr: &Girinti parametleri

source: &Statement Indents
tr: B&eyan Girintileri

source: After procedure header
tr: Prosedür başlığından sonra

source: At start and end of Begin...End block
tr: Begin...End bloğunun başında ve sonunda

source: Blank Lines
tr: Boş Satırlar

source: In procedure var section
tr: Prosedür var bölümünde

source: Lines before procedure
tr: Prosedür öncesi çizgiler

source: Max consecutive blank lines anywhere
tr: Herhangi bir yerde maksimum ardışık boş satır

source: Max consecutive blank lines before removal
tr: Kaldırılmadan önce maksimum ardışık boş satır

source: Number of returns after the unit's final End.
tr: Birimin son Bitişinden sonraki iade sayısı.

source: Between else and if
tr: if ve else arasında

source: Between end and else
tr: Else ve end arasında

source: Blocks
tr: Blok

source: Block with begin
tr: Begin ile blok

source: Block without begin
tr: Begin siz blok

source: Use a new line in blocks at:
tr: Bloklar halinde yeni bir satır kullanın:

source: Remove blank lines
tr: Boş satırları kaldır

source: Remove consecutive blank lines
tr: Ardışık boş satırları kaldırın

source: Any Word
tr: Herhangi bir Kelime

source: Enable
tr: Aktif

source: Set capitalisation on these words:
tr: Bu kelimelerde büyük harf kullanımını ayarlayın:

source: Capitalisation
tr: Kapitalizasyon

source: Constants
tr: Sabitler

source: Directives
tr: Direktifler

source: Enable capitalisation fixing
tr: Büyük harf düzeltmesini etkinleştirin

source: Identifiers
tr: Tanımlayıcılar

source: Set capitalisation on these identifiers:
tr: Bu tanımlayıcılarda büyük harf kullanımını ayarlayın:

source: Normalization of capitalisation
tr: Büyük harf kullanımının normalleştirilmesi

source: Use only one namespace
tr: Yalnızca bir ad alanı kullanın

source: Non-identifiers
tr: Tanımlayıcı olmayanlar

source: Set capitalisation on these non-identifiers:
tr: Bu tanımlayıcı olmayanlarda büyük harf kullanımını ayarlayın:

source: Operators
tr: Operatörler

source: Reserved words
tr: Ayrılmış kelimeler

source: Types
tr: Tipler

source: Set capitalisation on these unit names:
tr: Bu birim adlarında büyük harf kullanımını ayarlayın:

source: Unit Names
tr: Birim Adları

# jcfuiconsts.liscaseblocksalways
source: Always
tr: Herzaman

source: Case Blocks
tr: Case blokları

source: Case with begin
tr: Case begin ile

source: Case without begin
tr: Case begin olmadan

source: Else case with begin
tr: Case else begin ile

source: Else case without begin
tr: Case else begin olmadan

source: Label with begin
tr: Label begin ile

source: Label without begin
tr: Label begin olmadan

# jcfuiconsts.liscaseblocksleaveasis
source: Leave as is
tr: Olduğu gibi bırak

# jcfuiconsts.liscaseblocksnever
source: Never
tr: Asla

source: Use a new line in Case blocks at:
tr: Case bloklarında yeni satır kullan:

source: Compiler Directives
tr: Derleyici direktifleri

source: Other places
tr: Diğer yerler

source: Statements
tr: İfadeler

source: Use a new line after compiler directives:
tr: Derleyici direktiflerinden sonra yeni bir satır kullanın:

source: Use a new line before compiler directives:
tr: Derleyici direktiflerinden önce yeni bir satır kullanın:

source: Uses clause
tr: Uses bildirimi

source: Clarify
tr: Açıklama

source: Do &not run
tr: Çalıştı&rma

source: Do &run
tr: Ça&lıştır

source: File extensions to format:
tr: Biçimlendirilecek dosya uzantıları:

source: Run once-offs
tr: Bir kerelik çalıştırma

source: Run &only these
tr: Yalnızca bunları çalıştırın

source: JCF Global Settings
tr: JCF Genel Ayarlar

source: Directories to exclude from batch processing:
tr: Toplu işlemeden hariç tutulacak dizinler:

source: Individual files to exclude from batch processing:
tr: Toplu işlemden hariç tutulacak münferit dosyalar:

# jcfuiconsts.liscnfgenalways
source: Always
tr: Herzaman

source: Convert settings file
tr: Ayar dosyasını dönüştür

source: Fail quietly
tr: Sessizce başarısız ol

# jcfuiconsts.liscnfgennever
source: Never
tr: Asla

source: On parse error
tr: Ayrıştırma hatasında

source: Show parse &tree during parse
tr: Ayrıştır&ma sırasında ayrıştırma ağacını göster

source: &Write settings file
tr: Ayar d&osyasına yaz

source: Application: %s
tr: Uygulama: %s

source: Backup file extension
tr: Yedek doya uzantısı

source: Log file detail level
tr: Günlük dosyası ayrıntı düzeyi

source: Errors only
tr: Sadece hata

source: File
tr: Dosya

source: Log file directory
tr: Günlük dosya dizini

source: Output file extension
tr: Dosya çıktı uzantısı

source: Select specified directory
tr: Belirtilen dizini seçin

source: Specified: %s
tr: Belirtildi: %s

source: Temp: %s
tr: Geçici: %s

source: Log time taken to process
tr: İşlem için geçen süreyi günlüğe kaydetme

source: View log after each run
tr: Her çalıştırmadan sonra günlüğü görüntüleme

source: View Log now
tr: Günlüğü şimdi görüntüle

source: Exclusions
tr: İstisnalar

source: General
tr: Genel

source: Log file
tr: Log dosyası

source: Remove empty '{ }' comments
tr: Boş yorumları kaldır '{}'

source: Remove empty '//' comments
tr: Boş yorumları kaldır '//'

source: %sAt line %s col %s
tr: %sSatır %s sütun %s'de

# jcfuiconsts.lisederror
source: Error
tr: Hata

source: Exception %s
tr: İstisna %s

source: %s in %s
tr: %s içinde %s

source: JCF Parse error
tr: JCF ayrıştırma hatası

source: %s near %s
tr: %s yakınında %s

source: Type: %s%s
tr: Tip: %s%s

# jcfuiconsts.liserroract
source: Error
tr: Hata

source: Enable find and replace
tr: Bul ve değiştir özelliğini etkinleştirin

source: Find and Replace
tr: Ara ve Değiştir

source: Word list:
tr: Kelime listesi:

source: Show confirmation dialog before format
tr: Biçimlendirmeden önce onay iletişim kutusunu göster

source: Date file written: %s
tr: Dosyanın yazıldığı tarih: %s

source: Description:
tr: Açıklama:

source: File is read only
tr: Dosya salt okunur

source: File is writable
tr: Dosya yazılabilir

source: File not found
tr: Dosya bulunamadı

source: Open folder
tr: Klasörü aç

source: Settings File
tr: Ayarlar dosyası

source: Settings file is:
tr: Ayarlar dosyası:

source: Version that wrote this file: %s
tr: Bu dosyayı yazan sürüm: %s

source: Application Default:
tr: Uygulama Varsayılanı:

source: Imbalanced comment action
tr: Dengesiz yorum eylemi

source: Block indentation spaces
tr: Blok girinti boşlukları

source: Different indent for first level
tr: İlk seviye için farklı girinti

source: Extra indent for begin/end inside procedures
tr: Prosedürlerin içinde begin/end için ekstra girinti

source: Extra Indent for Case...Else blocks
tr: Case...Else blokları için ekstra girinti

source: Extra Indent for Case labels
tr: Case etiketleri için ekstra girinti

source: Extra Indent for If...Else blocks
tr: If...Else blokları için ekstra girinti

source: Extra Indent for interface GUID
tr: Interface GUID'si için Ekstra Girinti

source: Indentation
tr: Girinti

source: Indent for procedure body
tr: Prosedür gövdesi için girinti

source: Indent for procedures in program/library
tr: Program/library prosedürler için girinti

source: Indent nested types
tr: İç içe geçmiş türleri girintileme

source: Indent var and const in class
tr: Sınıf içinde var ve const girintisi

source: Keep single-line comments with code elsewhere
tr: Tek satırlık yorumları başka bir yerde kodla birlikte tutun

source: Keep single-line comments with code in class definitions
tr: Sınıf tanımlarında kodla birlikte tek satırlık açıklamalar bulundurun

source: Keep single-line comments with code in globals
tr: Tek satırlık açıklamaları globallerdeki kodlarla birlikte tutun

source: Keep single-line comments with code in procedures
tr: Yordamlarda kodla birlikte tek satırlık açıklamalar bulundurun

source: Options
tr: Özellikler

source: JCF Format Settings
tr: JCF Formatı Ayarları

source: JEDI Code Format of all open windows?
tr: JEDI Kodu Formatı tüm açık pencerelere uygulansın mı?

source: JEDI Code Format of %sAre you sure that you want to format all %s files in the project?
tr: JEDI Kodu Formatı %s'nin Projedeki tüm %s dosyalarını biçimlendirmek istediğinizden emin misiniz?

source: JEDI Code Format of %sStart formatting?
tr: JEDI Kodu Formatı Biçimlendirmeyi %sbaşlat?

source: &Break lines that are longer than max line length
tr: Maks satır &uzunluğundan daha uzun satırları kırın

source: Line Breaking
tr: Satır kırma

source: Max line length
tr: Maks satır uzunluğu

source: &Never
tr: As&la

source: &Sometimes, if a good place to break is found
tr: Ba&zen, mola vermek için iyi bir yer bulunursa

source: &Usually, unless there is no acceptable place to break
tr: Genellikle, mola vermek için k&abul edilebilir bir yer olmadığı sürece

source: ALL CAPITALS
tr: TÜMÜ BÜYÜKHARF

source: all lowercase
tr: tümü küçükharf

source: Leave alone
tr: Yalnız bırakın.

source: Mixed Case
tr: Karışık Case

source: Obfuscate
tr: Gizleme

source: &Obfuscate mode
tr: Gizleme mo&du

source: Obfuscate word &caps
tr: Kelime büyük harflerini &gizleme

source: Rebreak &lines
tr: Yeniden kır&ma hatları

source: Remove c&omments
tr: Açıklamayı &kaldır

source: Remove &indent
tr: Gi&rintiyi kaldır

# jcfuiconsts.lisobfsremovewhitespace
source: Remove &white space
tr: Beyaz alanı k&aldırın

source: Compiler options defined for conditional compilation:
tr: Koşullu derleme için tanımlanan derleyici seçenekleri:

source: Enable preprocessor parsing
tr: Ön işlemci ayrıştırmayı etkinleştir

source: PreProcessor
tr: Önişlemci

source: Symbols defined for conditional compilation:
tr: Koşullu derleme için tanımlanan semboller:

source: After uses
tr: Uses den sonra

source: Convert to Carriage Return (UNIX)
tr: Satırbaşı + Satır Beslemeye Dönüştür (Unix)

source: Convert to Carriage Return + Linefeed (DOS/Windows)
tr: Satırbaşı + Satır Beslemeye Dönüştür (DOS/Windows)

source: In expressions
tr: İfadelerde

source: In misc. bad places
tr: Çeşitli şekillerde. kötü yerler

source: In misc. good places
tr: Çeşitli şekillerde. iyi yerler

source: In procedure definitions
tr: Prosedür tanımlarında

source: In properties
tr: Property de

source: Insert returns
tr: Dönüş ekle

source: In variable declarations
tr: değişken bildiriminde

# jcfuiconsts.lisreturnsleaveasis
source: Leave as is
tr: Olduğu gibi bırakın

source: One uses clause item per line
tr: Satır başına bir uses maddesi öğesi

source: Remove returns
tr: Dönüşleri kaldırın

source: Return chars
tr: Dönüş karakterleri

source: Returns
tr: Dönüşler

source: After open
tr: Açtıktan sonra

# jcfuiconsts.lisspacesalways
source: Always
tr: Herzaman

source: Before end
tr: End den önce

source: Before [ in expression
tr: Önce [ ifade içinde

source: Case l&abel
tr: Case e&tiketinde

source: &Class variables
tr: Sınıf değişke&nlerinde

source: C&onst declarations
tr: Sab&itler bildiriminde

source: Fix &spacing
tr: Aralıkları dü&zeltin

source: &Function return types
tr: Fonksiyon dönüş tipin&de

source: In function &call
tr: Fonksiyon çağrı&larında

source: In function &declaration
tr: Fonksiyon &bildiriminde

source: In &generic
tr: &Jenerik olarak

source: &Insert space before bracket
tr: &Parantezden önce boşluk ekleyin

source: Insert space inside brackets
tr: Parantezlerin içine boşluk ekleyin

source: &Label
tr: &Etiket

# jcfuiconsts.lisspacesleaveasis
source: Leave as is
tr: Olduğu gibi bırakın

source: &Max spaces in code
tr: &Koddaki maksimum boşluklar

source: Move spaces to before colon
tr: Boşlukları iki nokta üst üste işaretinden önceye taşı

# jcfuiconsts.lisspacesnever
source: Never
tr: Asla

source: &Procedure parameters
tr: Prosedur parame&treleri

source: &Record fields
tr: &Kayıt alanları

source: Space before class &heritage
tr: Sınıf mirasından önce &boşluk

source: Spaces
tr: Boşluklar

source: Spaces around &operators
tr: &Operatörlerin etrafındaki boşluklar

source: Spaces &before colon in
tr: İki nokta üst üste işaret&inden önceki boşluklar

source: Spaces for tab
tr: Sekme için boşluk

source: Spaces per tab
tr: Sekme başına boşluk

source: &Tab characters
tr: &Tab karakteri

source: Turn spaces to tabs
tr: Boşlukları sekmelere dönüştürme

source: Turn tabs to spaces
tr: Sekmeleri boşluğa dönüştürme

source: &Var declarations
tr: &Var bildirimleri

source: Add begin and end to single statements
tr: Tekli ifadelere begin ve end ekleme

source: Add or Remove &begin and end from single statements
tr: Tekli ifadelere be&gin ve end ekleme veya kaldırma

source: Advanced settings
tr: Gelişmiş ayarlar

source: Alphabetic
tr: Alfabetik

source: Break on &comment
tr: Yorumda du&raklat

source: Break on &return
tr: Dönüşte d&uraklat

source: Leave begin and end as is
tr: Begin ve end i olduğu gibi brıak

source: Longest to shortest
tr: En uzundan en kısaya

source: Only with no comments
tr: Sadece yorumsuz

source: Put &semicolons after last statement in a block
tr: Bir bloktaki son ifadeden &sonra noktalı virgül koyun

source: Remove begin and end from around single statements
tr: Tekli ifadelerin etrafından begin ve end'i kaldırın

source: Reverse Alphabetic
tr: Ters Alfabetik

source: Shortest to longest
tr: En kısadan en uzuna

source: Sort i&mplementation uses
tr: Implementation uses i sırala

source: Sort i&nterface uses
tr: Inter&face uses i sırala

source: Sort &program uses
tr: Program uses i sırala

source: Sort &uses clauses
tr: Uses sı&rala

source: Transform
tr: Dönüştür

source: Uses sort &order
tr: Uses sıra&la

source: WARNING: changing order of uses clauses may break your code.
tr: UYARI: Uses cümlelerinin sırasını değiştirmek kodunuzu bozabilir.

source: Insert into Implementation
tr: Implementation a ekle

source: Insert into Interface
tr: Interface ye Ekle

source: Remove
tr: Kaldır

source: Replace
tr: Değiştir

source: Warn
tr: Uyarı

source: &Ignore unused parameters named:
tr: Adlandırılmış &kullanılmayan parametreleri yoksay:

source: Warn about &unused parameters
tr: Kullanılmayan par&ametreler hakkında uyar

source: Warnings
tr: Uyarılar

source: &Warnings On
tr: &Uyarılar Açık
