Repository: fpc/Lazarus
Catalog: components/onlinepackagemanager/languages/opkman_zip.*.po
Languages: pt_br, zh_cn

source: Changing buffer size is not allowed while (un)zipping.
pt_br: Alterar o tamanho do buffer não é permitido ao (des)compactar.
zh_cn: 更改缓冲区大小是不运行的 在(解)压缩时.

source: Corrupt ZIP file %s.
pt_br: Arquivo compactado corrompido %s.
zh_cn: 损坏的ZIP文件%s.

source: Cannot unzip item "%s": encryption is not supported.
pt_br: Impossível descompactar item "%s": encriptação não suportada.
zh_cn: 不能解压缩项目"%s":加密不支持.

source: Changing output file name is not allowed while (un)zipping.
pt_br: Alterar o nome de arquivo de saída não é permitido ao (des)compactar.
zh_cn: 更改输出文件名称是不运行的 在(解)压缩时.

source: File "%s" does not exist.
pt_br: Arquivo "%s" não existe.
zh_cn: 文件"%s"不存在.

source: Invalid CRC checksum while unzipping %s.
pt_br: Checksum CRC inválido ao descompactar %s.
zh_cn: 无效的CRC checksum 在解压缩%s.

source: Encountered %d file entries; maximum supported is %d.
pt_br: Encontrado %d entradas de arquivos; máximo suportado é %d.
zh_cn: 遇到%d文件入口(entries);最大支持是%d.

source: Missing archive filename in streamed entry %d.
pt_br: Nome de arquivo faltando na entrada transmitida %d.
zh_cn: 丢失档案文件名在流的入口(entry)%d.

source: Missing filename in entry %d.
pt_br: Nome de arquivo faltando na entrada %d.
zh_cn: 丢失文件名在入口(entry)%d.

source: No archive filename for examine operation.
pt_br: Nenhum nome de arquivo para examinar a operação
zh_cn: 没有档案文件名用于检查操作.

source: No stream is opened.
pt_br: Nenhum stream está aberto.
zh_cn: 没有流是打开的.

source: Cannot unzip item "%s": patch sets are not supported.
pt_br: Impossível descompactar item "%s": "patch sets" não suportados.
zh_cn: 不能解压缩项目"%s": patch sets (补丁集)不支持.

source: Position/offset %d is larger than maximum supported %d.
pt_br: Posição/deslocamento %d é maior que o máximo suportado %d.
zh_cn: 位置/补偿(offset)%d大于支持的%d最大值.

source: Unsupported compression format %d.
pt_br: Formato de compressão não suportado %d.
zh_cn: 不支持压缩格式%d.

source: A central directory split over multiple disks is unsupported.
pt_br: Um diretório central dividido em múltiplos discos não é suportado.
zh_cn: 一个中心目录分割到多个磁盘是不支持的.
